TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Sat Mar 11 21:51:20 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2806x_GlobalVariableDefs.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Lawrence\Google Drive\workspace_v7\SeventhProject\Debug")
      13                      .global _PartIdRegs
      14 00000000       _PartIdRegs:    .usect  "PartIdRegsFile",1,1,0
      15              $C$DW$1 .dwtag  DW_TAG_variable
      16                      .dwattr $C$DW$1, DW_AT_name("PartIdRegs")

     456              $C$DW$50        .dwtag  DW_TAG_variable
     457                      .dwattr $C$DW$50, DW_AT_name("EPwm4Regs")
     458                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_EPwm4Regs")
     459                      .dwattr $C$DW$50, DW_AT_location[DW_OP_addr _EPwm4Regs]
     460                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$723)
     461                      .dwattr $C$DW$50, DW_AT_external
     462              
     463                      .global _EPwm5Regs
     464 00000000       _EPwm5Regs:     .usect  "EPwm5RegsFile",64,1,1
     465              $C$DW$51        .dwtag  DW_TAG_variable
     466                      .dwattr $C$DW$51, DW_AT_name("EPwm5Regs")
     467                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_EPwm5Regs")
     468                      .dwattr $C$DW$51, DW_AT_location[DW_OP_addr _EPwm5Regs]
     469                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$723)
     470                      .dwattr $C$DW$51, DW_AT_external
     471              
     472                      .global _EPwm3Regs
     473 00000000       _EPwm3Regs:     .usect  "EPwm3RegsFile",64,1,1
     474              $C$DW$52        .dwtag  DW_TAG_variable
     475                      .dwattr $C$DW$52, DW_AT_name("EPwm3Regs")
     476                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_EPwm3Regs")
     477                      .dwattr $C$DW$52, DW_AT_location[DW_OP_addr _EPwm3Regs]
     478                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$723)
     479                      .dwattr $C$DW$52, DW_AT_external
     480              
     481                      .global _AdcRegs
     482 00000000       _AdcRegs:       .usect  "AdcRegsFile",80,1,0
     483              $C$DW$53        .dwtag  DW_TAG_variable
     484                      .dwattr $C$DW$53, DW_AT_name("AdcRegs")
     485                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_AdcRegs")
     486                      .dwattr $C$DW$53, DW_AT_location[DW_OP_addr _AdcRegs]
     487                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$711)
     488                      .dwattr $C$DW$53, DW_AT_external
     489              
     490                      .global _DmaRegs
     491 00000000       _DmaRegs:       .usect  "DmaRegsFile",224,1,1
     492              $C$DW$54        .dwtag  DW_TAG_variable
     493                      .dwattr $C$DW$54, DW_AT_name("DmaRegs")
     494                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_DmaRegs")
     495                      .dwattr $C$DW$54, DW_AT_location[DW_OP_addr _DmaRegs]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   10

     496                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$719)
     497                      .dwattr $C$DW$54, DW_AT_external
     498              
     499                      .global _PieVectTable
     500 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     501              $C$DW$55        .dwtag  DW_TAG_variable
     502                      .dwattr $C$DW$55, DW_AT_name("PieVectTable")
     503                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PieVectTable")
     504                      .dwattr $C$DW$55, DW_AT_location[DW_OP_addr _PieVectTable]
     505                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$738)
     506                      .dwattr $C$DW$55, DW_AT_external
     507              
     508                      .global _ECanaMboxes
     509 00000000       _ECanaMboxes:   .usect  "ECanaMboxesFile",256,1,1
     510              $C$DW$56        .dwtag  DW_TAG_variable
     511                      .dwattr $C$DW$56, DW_AT_name("ECanaMboxes")
     512                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ECanaMboxes")
     513                      .dwattr $C$DW$56, DW_AT_location[DW_OP_addr _ECanaMboxes]
     514                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$720)
     515                      .dwattr $C$DW$56, DW_AT_external
     516              
     517                      .global _Usb0Regs
     518 00000000       _Usb0Regs:      .usect  "Usb0RegsFile",1108,1,1
     519              $C$DW$57        .dwtag  DW_TAG_variable
     520                      .dwattr $C$DW$57, DW_AT_name("Usb0Regs")
     521                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Usb0Regs")
     522                      .dwattr $C$DW$57, DW_AT_location[DW_OP_addr _Usb0Regs]
     523                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$743)
     524                      .dwattr $C$DW$57, DW_AT_external
     525              
     526              ;       D:\TI\ccsv7\tools\compiler\ti-cgt-c2000_16.9.1.LTS\bin\opt2000.exe C:\\Users\\Lawrence\\AppData\\Loca
     527              ;       D:\TI\ccsv7\tools\compiler\ti-cgt-c2000_16.9.1.LTS\bin\ac2000.exe -@C:\\Users\\Lawrence\\AppData\\Loc
     528              
     529              ;***************************************************************
     530              ;* TYPE INFORMATION                                            *
     531              ;***************************************************************
     532              
     533              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     534                      .dwattr $C$DW$T$20, DW_AT_name("ADCCTL1_BITS")
     535                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     536              $C$DW$58        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     538                      .dwattr $C$DW$58, DW_AT_name("TEMPCONV")
     539                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_TEMPCONV")
     540                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0f)
     541                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     542                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     544              
     545              $C$DW$59        .dwtag  DW_TAG_member
     546                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     547                      .dwattr $C$DW$59, DW_AT_name("VREFLOCONV")
     548                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_VREFLOCONV")
     549                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0e)
     550                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   11

     551                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554              $C$DW$60        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$60, DW_AT_name("INTPULSEPOS")
     557                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_INTPULSEPOS")
     558                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0d)
     559                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     560                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     561                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     562              
     563              $C$DW$61        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$61, DW_AT_name("ADCREFSEL")
     566                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_ADCREFSEL")
     567                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
     568                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     569                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     571              
     572              $C$DW$62        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     574                      .dwattr $C$DW$62, DW_AT_name("rsvd1")
     575                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd1")
     576                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0b)
     577                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     578                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     579                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     580              
     581              $C$DW$63        .dwtag  DW_TAG_member
     582                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     583                      .dwattr $C$DW$63, DW_AT_name("ADCREFPWD")
     584                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_ADCREFPWD")
     585                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0a)
     586                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     587                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     589              
     590              $C$DW$64        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     592                      .dwattr $C$DW$64, DW_AT_name("ADCBGPWD")
     593                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_ADCBGPWD")
     594                      .dwattr $C$DW$64, DW_AT_bit_offset(0x09)
     595                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     598              
     599              $C$DW$65        .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     601                      .dwattr $C$DW$65, DW_AT_name("ADCPWDN")
     602                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_ADCPWDN")
     603                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08)
     604                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     605                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   12

     606                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     607              
     608              $C$DW$66        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$66, DW_AT_name("ADCBSYCHN")
     611                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_ADCBSYCHN")
     612                      .dwattr $C$DW$66, DW_AT_bit_offset(0x03)
     613                      .dwattr $C$DW$66, DW_AT_bit_size(0x05)
     614                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$67        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$67, DW_AT_name("ADCBSY")
     620                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_ADCBSY")
     621                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02)
     622                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     623                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     624                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     625              
     626              $C$DW$68        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$68, DW_AT_name("ADCENABLE")
     629                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_ADCENABLE")
     630                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01)
     631                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     632                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     634              
     635              $C$DW$69        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$69, DW_AT_name("RESET")
     638                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_RESET")
     639                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     640                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     641                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     643              
     644                      .dwendtag $C$DW$T$20
     645              
     646              
     647              $C$DW$T$21      .dwtag  DW_TAG_union_type
     648                      .dwattr $C$DW$T$21, DW_AT_name("ADCCTL1_REG")
     649                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     650              $C$DW$70        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     652                      .dwattr $C$DW$70, DW_AT_name("all")
     653                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     654                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657              $C$DW$71        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
     659                      .dwattr $C$DW$71, DW_AT_name("bit")
     660                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   13

     661                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     663              
     664                      .dwendtag $C$DW$T$21
     665              
     666              
     667              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     668                      .dwattr $C$DW$T$22, DW_AT_name("ADCCTL2_BITS")
     669                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     670              $C$DW$72        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$72, DW_AT_name("CLKDIV2EN")
     673                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CLKDIV2EN")
     674                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f)
     675                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     676                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     678              
     679              $C$DW$73        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$73, DW_AT_name("ADCNONOVERLAP")
     682                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
     683                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e)
     684                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     685                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     686                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     687              
     688              $C$DW$74        .dwtag  DW_TAG_member
     689                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     690                      .dwattr $C$DW$74, DW_AT_name("CLKDIV4EN")
     691                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_CLKDIV4EN")
     692                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d)
     693                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     694                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     696              
     697              $C$DW$75        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     699                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
     700                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
     701                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00)
     702                      .dwattr $C$DW$75, DW_AT_bit_size(0x0d)
     703                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     705              
     706                      .dwendtag $C$DW$T$22
     707              
     708              
     709              $C$DW$T$23      .dwtag  DW_TAG_union_type
     710                      .dwattr $C$DW$T$23, DW_AT_name("ADCCTL2_REG")
     711                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     712              $C$DW$76        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$76, DW_AT_name("all")
     715                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   14

     716                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719              $C$DW$77        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
     721                      .dwattr $C$DW$77, DW_AT_name("bit")
     722                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     723                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     725              
     726                      .dwendtag $C$DW$T$23
     727              
     728              
     729              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     730                      .dwattr $C$DW$T$24, DW_AT_name("ADCINTSOCSEL1_BITS")
     731                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     732              $C$DW$78        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$78, DW_AT_name("SOC0")
     735                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_SOC0")
     736                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0e)
     737                      .dwattr $C$DW$78, DW_AT_bit_size(0x02)
     738                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     740              
     741              $C$DW$79        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$79, DW_AT_name("SOC1")
     744                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SOC1")
     745                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0c)
     746                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
     747                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     749              
     750              $C$DW$80        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$80, DW_AT_name("SOC2")
     753                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SOC2")
     754                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0a)
     755                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
     756                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$81        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$81, DW_AT_name("SOC3")
     762                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SOC3")
     763                      .dwattr $C$DW$81, DW_AT_bit_offset(0x08)
     764                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
     765                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     767              
     768              $C$DW$82        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$82, DW_AT_name("SOC4")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   15

     771                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SOC4")
     772                      .dwattr $C$DW$82, DW_AT_bit_offset(0x06)
     773                      .dwattr $C$DW$82, DW_AT_bit_size(0x02)
     774                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777              $C$DW$83        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$83, DW_AT_name("SOC5")
     780                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SOC5")
     781                      .dwattr $C$DW$83, DW_AT_bit_offset(0x04)
     782                      .dwattr $C$DW$83, DW_AT_bit_size(0x02)
     783                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$84        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$84, DW_AT_name("SOC6")
     789                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SOC6")
     790                      .dwattr $C$DW$84, DW_AT_bit_offset(0x02)
     791                      .dwattr $C$DW$84, DW_AT_bit_size(0x02)
     792                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     794              
     795              $C$DW$85        .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$85, DW_AT_name("SOC7")
     798                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_SOC7")
     799                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
     800                      .dwattr $C$DW$85, DW_AT_bit_size(0x02)
     801                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804                      .dwendtag $C$DW$T$24
     805              
     806              
     807              $C$DW$T$25      .dwtag  DW_TAG_union_type
     808                      .dwattr $C$DW$T$25, DW_AT_name("ADCINTSOCSEL1_REG")
     809                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     810              $C$DW$86        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$86, DW_AT_name("all")
     813                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
     814                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$87        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$24)
     819                      .dwattr $C$DW$87, DW_AT_name("bit")
     820                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
     821                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824                      .dwendtag $C$DW$T$25
     825              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   16

     826              
     827              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     828                      .dwattr $C$DW$T$26, DW_AT_name("ADCINTSOCSEL2_BITS")
     829                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     830              $C$DW$88        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$88, DW_AT_name("SOC8")
     833                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_SOC8")
     834                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e)
     835                      .dwattr $C$DW$88, DW_AT_bit_size(0x02)
     836                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839              $C$DW$89        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$89, DW_AT_name("SOC9")
     842                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_SOC9")
     843                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
     844                      .dwattr $C$DW$89, DW_AT_bit_size(0x02)
     845                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     846                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     847              
     848              $C$DW$90        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     850                      .dwattr $C$DW$90, DW_AT_name("SOC10")
     851                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SOC10")
     852                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0a)
     853                      .dwattr $C$DW$90, DW_AT_bit_size(0x02)
     854                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     856              
     857              $C$DW$91        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$91, DW_AT_name("SOC11")
     860                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SOC11")
     861                      .dwattr $C$DW$91, DW_AT_bit_offset(0x08)
     862                      .dwattr $C$DW$91, DW_AT_bit_size(0x02)
     863                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     865              
     866              $C$DW$92        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$92, DW_AT_name("SOC12")
     869                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SOC12")
     870                      .dwattr $C$DW$92, DW_AT_bit_offset(0x06)
     871                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
     872                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$93        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$93, DW_AT_name("SOC13")
     878                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SOC13")
     879                      .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
     880                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   17

     881                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$94        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$94, DW_AT_name("SOC14")
     887                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SOC14")
     888                      .dwattr $C$DW$94, DW_AT_bit_offset(0x02)
     889                      .dwattr $C$DW$94, DW_AT_bit_size(0x02)
     890                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     892              
     893              $C$DW$95        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$95, DW_AT_name("SOC15")
     896                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SOC15")
     897                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
     898                      .dwattr $C$DW$95, DW_AT_bit_size(0x02)
     899                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902                      .dwendtag $C$DW$T$26
     903              
     904              
     905              $C$DW$T$27      .dwtag  DW_TAG_union_type
     906                      .dwattr $C$DW$T$27, DW_AT_name("ADCINTSOCSEL2_REG")
     907                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     908              $C$DW$96        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$96, DW_AT_name("all")
     911                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
     912                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$97        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
     917                      .dwattr $C$DW$97, DW_AT_name("bit")
     918                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
     919                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     921              
     922                      .dwendtag $C$DW$T$27
     923              
     924              
     925              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     926                      .dwattr $C$DW$T$28, DW_AT_name("ADCINT_BITS")
     927                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     928              $C$DW$98        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$98, DW_AT_name("ADCINT1")
     931                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ADCINT1")
     932                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0f)
     933                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
     934                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   18

     936              
     937              $C$DW$99        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$99, DW_AT_name("ADCINT2")
     940                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ADCINT2")
     941                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e)
     942                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
     943                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     945              
     946              $C$DW$100       .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     948                      .dwattr $C$DW$100, DW_AT_name("ADCINT3")
     949                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_ADCINT3")
     950                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0d)
     951                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
     952                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     954              
     955              $C$DW$101       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$101, DW_AT_name("ADCINT4")
     958                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_ADCINT4")
     959                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0c)
     960                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
     961                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964              $C$DW$102       .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$102, DW_AT_name("ADCINT5")
     967                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_ADCINT5")
     968                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0b)
     969                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
     970                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     972              
     973              $C$DW$103       .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$103, DW_AT_name("ADCINT6")
     976                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ADCINT6")
     977                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0a)
     978                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
     979                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     981              
     982              $C$DW$104       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$104, DW_AT_name("ADCINT7")
     985                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ADCINT7")
     986                      .dwattr $C$DW$104, DW_AT_bit_offset(0x09)
     987                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
     988                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     990              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   19

     991              $C$DW$105       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     993                      .dwattr $C$DW$105, DW_AT_name("ADCINT8")
     994                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ADCINT8")
     995                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
     996                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
     997                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     999              
    1000              $C$DW$106       .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$106, DW_AT_name("ADCINT9")
    1003                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ADCINT9")
    1004                      .dwattr $C$DW$106, DW_AT_bit_offset(0x07)
    1005                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1006                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1008              
    1009              $C$DW$107       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$107, DW_AT_name("rsvd1")
    1012                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd1")
    1013                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1014                      .dwattr $C$DW$107, DW_AT_bit_size(0x07)
    1015                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1017              
    1018                      .dwendtag $C$DW$T$28
    1019              
    1020              
    1021              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1022                      .dwattr $C$DW$T$29, DW_AT_name("ADCINT_REG")
    1023                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1024              $C$DW$108       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$108, DW_AT_name("all")
    1027                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    1028                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$109       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
    1033                      .dwattr $C$DW$109, DW_AT_name("bit")
    1034                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    1035                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038                      .dwendtag $C$DW$T$29
    1039              
    1040              
    1041              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1042                      .dwattr $C$DW$T$31, DW_AT_name("ADCOFFTRIM_BITS")
    1043                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1044              $C$DW$110       .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   20

    1046                      .dwattr $C$DW$110, DW_AT_name("OFFTRIM")
    1047                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OFFTRIM")
    1048                      .dwattr $C$DW$110, DW_AT_bit_offset(0x07)
    1049                      .dwattr $C$DW$110, DW_AT_bit_size(0x09)
    1050                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$111       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1056                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1057                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1058                      .dwattr $C$DW$111, DW_AT_bit_size(0x07)
    1059                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062                      .dwendtag $C$DW$T$31
    1063              
    1064              
    1065              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1066                      .dwattr $C$DW$T$32, DW_AT_name("ADCOFFTRIM_REG")
    1067                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1068              $C$DW$112       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$112, DW_AT_name("all")
    1071                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1072                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$113       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$31)
    1077                      .dwattr $C$DW$113, DW_AT_name("bit")
    1078                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1079                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082                      .dwendtag $C$DW$T$32
    1083              
    1084              
    1085              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1086                      .dwattr $C$DW$T$33, DW_AT_name("ADCREFTRIM_BITS")
    1087                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1088              $C$DW$114       .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$114, DW_AT_name("BG_FINE_TRIM")
    1091                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_BG_FINE_TRIM")
    1092                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0b)
    1093                      .dwattr $C$DW$114, DW_AT_bit_size(0x05)
    1094                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1096              
    1097              $C$DW$115       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$115, DW_AT_name("BG_COARSE_TRIM")
    1100                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BG_COARSE_TRIM")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   21

    1101                      .dwattr $C$DW$115, DW_AT_bit_offset(0x07)
    1102                      .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    1103                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1105              
    1106              $C$DW$116       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$116, DW_AT_name("EXTREF_FINE_TRIM")
    1109                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_EXTREF_FINE_TRIM")
    1110                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02)
    1111                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    1112                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115              $C$DW$117       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    1118                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    1119                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1120                      .dwattr $C$DW$117, DW_AT_bit_size(0x02)
    1121                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124                      .dwendtag $C$DW$T$33
    1125              
    1126              
    1127              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1128                      .dwattr $C$DW$T$34, DW_AT_name("ADCREFTRIM_REG")
    1129                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1130              $C$DW$118       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$118, DW_AT_name("all")
    1133                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1134                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$119       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$33)
    1139                      .dwattr $C$DW$119, DW_AT_name("bit")
    1140                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1141                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144                      .dwendtag $C$DW$T$34
    1145              
    1146              
    1147              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1148                      .dwattr $C$DW$T$35, DW_AT_name("ADCSAMPLEMODE_BITS")
    1149                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1150              $C$DW$120       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$120, DW_AT_name("SIMULEN0")
    1153                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SIMULEN0")
    1154                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0f)
    1155                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   22

    1156                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$121       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$121, DW_AT_name("SIMULEN2")
    1162                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SIMULEN2")
    1163                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0e)
    1164                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1165                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1167              
    1168              $C$DW$122       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$122, DW_AT_name("SIMULEN4")
    1171                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SIMULEN4")
    1172                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0d)
    1173                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1174                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1176              
    1177              $C$DW$123       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$123, DW_AT_name("SIMULEN6")
    1180                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_SIMULEN6")
    1181                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1182                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1183                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1184                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$124       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$124, DW_AT_name("SIMULEN8")
    1189                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SIMULEN8")
    1190                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b)
    1191                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1192                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1194              
    1195              $C$DW$125       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$125, DW_AT_name("SIMULEN10")
    1198                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SIMULEN10")
    1199                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    1200                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1201                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204              $C$DW$126       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$126, DW_AT_name("SIMULEN12")
    1207                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_SIMULEN12")
    1208                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    1209                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1210                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   23

    1211                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213              $C$DW$127       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$127, DW_AT_name("SIMULEN14")
    1216                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_SIMULEN14")
    1217                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1218                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1219                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1221              
    1222              $C$DW$128       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1225                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1226                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1227                      .dwattr $C$DW$128, DW_AT_bit_size(0x08)
    1228                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1230              
    1231                      .dwendtag $C$DW$T$35
    1232              
    1233              
    1234              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1235                      .dwattr $C$DW$T$36, DW_AT_name("ADCSAMPLEMODE_REG")
    1236                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1237              $C$DW$129       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$129, DW_AT_name("all")
    1240                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1241                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$130       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$35)
    1246                      .dwattr $C$DW$130, DW_AT_name("bit")
    1247                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1248                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251                      .dwendtag $C$DW$T$36
    1252              
    1253              
    1254              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1255                      .dwattr $C$DW$T$37, DW_AT_name("ADCSOC_BITS")
    1256                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1257              $C$DW$131       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$131, DW_AT_name("SOC0")
    1260                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SOC0")
    1261                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    1262                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1265              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   24

    1266              $C$DW$132       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$132, DW_AT_name("SOC1")
    1269                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SOC1")
    1270                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1271                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$133       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$133, DW_AT_name("SOC2")
    1278                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SOC2")
    1279                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    1280                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1281                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$134       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$134, DW_AT_name("SOC3")
    1287                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_SOC3")
    1288                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1289                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293              $C$DW$135       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$135, DW_AT_name("SOC4")
    1296                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SOC4")
    1297                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0b)
    1298                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1299                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302              $C$DW$136       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1304                      .dwattr $C$DW$136, DW_AT_name("SOC5")
    1305                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_SOC5")
    1306                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a)
    1307                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1308                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$137       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$137, DW_AT_name("SOC6")
    1314                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_SOC6")
    1315                      .dwattr $C$DW$137, DW_AT_bit_offset(0x09)
    1316                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$138       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   25

    1321                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$138, DW_AT_name("SOC7")
    1323                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SOC7")
    1324                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    1325                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1326                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$139       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$139, DW_AT_name("SOC8")
    1332                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SOC8")
    1333                      .dwattr $C$DW$139, DW_AT_bit_offset(0x07)
    1334                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1335                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$140       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$140, DW_AT_name("SOC9")
    1341                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_SOC9")
    1342                      .dwattr $C$DW$140, DW_AT_bit_offset(0x06)
    1343                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1344                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1346              
    1347              $C$DW$141       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$141, DW_AT_name("SOC10")
    1350                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SOC10")
    1351                      .dwattr $C$DW$141, DW_AT_bit_offset(0x05)
    1352                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1353                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$142       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$142, DW_AT_name("SOC11")
    1359                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_SOC11")
    1360                      .dwattr $C$DW$142, DW_AT_bit_offset(0x04)
    1361                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1362                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1364              
    1365              $C$DW$143       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1367                      .dwattr $C$DW$143, DW_AT_name("SOC12")
    1368                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_SOC12")
    1369                      .dwattr $C$DW$143, DW_AT_bit_offset(0x03)
    1370                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1371                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$144       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   26

    1376                      .dwattr $C$DW$144, DW_AT_name("SOC13")
    1377                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_SOC13")
    1378                      .dwattr $C$DW$144, DW_AT_bit_offset(0x02)
    1379                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1380                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$145       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$145, DW_AT_name("SOC14")
    1386                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SOC14")
    1387                      .dwattr $C$DW$145, DW_AT_bit_offset(0x01)
    1388                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1389                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$146       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$146, DW_AT_name("SOC15")
    1395                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SOC15")
    1396                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    1397                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1398                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401                      .dwendtag $C$DW$T$37
    1402              
    1403              
    1404              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1405                      .dwattr $C$DW$T$38, DW_AT_name("ADCSOC_REG")
    1406                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1407              $C$DW$147       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$147, DW_AT_name("all")
    1410                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    1411                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414              $C$DW$148       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$37)
    1416                      .dwattr $C$DW$148, DW_AT_name("bit")
    1417                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    1418                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421                      .dwendtag $C$DW$T$38
    1422              
    1423              
    1424              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1425                      .dwattr $C$DW$T$39, DW_AT_name("ADCSOCxCTL_BITS")
    1426                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1427              $C$DW$149       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$149, DW_AT_name("ACQPS")
    1430                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACQPS")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   27

    1431                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0a)
    1432                      .dwattr $C$DW$149, DW_AT_bit_size(0x06)
    1433                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1435              
    1436              $C$DW$150       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1438                      .dwattr $C$DW$150, DW_AT_name("CHSEL")
    1439                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_CHSEL")
    1440                      .dwattr $C$DW$150, DW_AT_bit_offset(0x06)
    1441                      .dwattr $C$DW$150, DW_AT_bit_size(0x04)
    1442                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1444              
    1445              $C$DW$151       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    1448                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    1449                      .dwattr $C$DW$151, DW_AT_bit_offset(0x05)
    1450                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1451                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$152       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$152, DW_AT_name("TRIGSEL")
    1457                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_TRIGSEL")
    1458                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    1459                      .dwattr $C$DW$152, DW_AT_bit_size(0x05)
    1460                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1462              
    1463                      .dwendtag $C$DW$T$39
    1464              
    1465              
    1466              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1467                      .dwattr $C$DW$T$40, DW_AT_name("ADCSOCxCTL_REG")
    1468                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1469              $C$DW$153       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$153, DW_AT_name("all")
    1472                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    1473                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$154       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$39)
    1478                      .dwattr $C$DW$154, DW_AT_name("bit")
    1479                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    1480                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1482              
    1483                      .dwendtag $C$DW$T$40
    1484              
    1485              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   28

    1486              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1487                      .dwattr $C$DW$T$44, DW_AT_name("ADC_REGS")
    1488                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x50)
    1489              $C$DW$155       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1491                      .dwattr $C$DW$155, DW_AT_name("ADCCTL1")
    1492                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ADCCTL1")
    1493                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$156       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    1498                      .dwattr $C$DW$156, DW_AT_name("ADCCTL2")
    1499                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ADCCTL2")
    1500                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1501                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$157       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    1506                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    1507                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1508                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$158       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    1513                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    1514                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1515                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$159       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$29)
    1519                      .dwattr $C$DW$159, DW_AT_name("ADCINTFLG")
    1520                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCINTFLG")
    1521                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1522                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$160       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$29)
    1526                      .dwattr $C$DW$160, DW_AT_name("ADCINTFLGCLR")
    1527                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1528                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1529                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$161       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$29)
    1533                      .dwattr $C$DW$161, DW_AT_name("ADCINTOVF")
    1534                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCINTOVF")
    1535                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1536                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$162       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$29)
    1540                      .dwattr $C$DW$162, DW_AT_name("ADCINTOVFCLR")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   29

    1541                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1542                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1543                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$163       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$289)
    1547                      .dwattr $C$DW$163, DW_AT_name("INTSEL1N2")
    1548                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_INTSEL1N2")
    1549                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1550                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$164       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$291)
    1554                      .dwattr $C$DW$164, DW_AT_name("INTSEL3N4")
    1555                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_INTSEL3N4")
    1556                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1557                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$165       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$293)
    1561                      .dwattr $C$DW$165, DW_AT_name("INTSEL5N6")
    1562                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_INTSEL5N6")
    1563                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1564                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$166       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$295)
    1568                      .dwattr $C$DW$166, DW_AT_name("INTSEL7N8")
    1569                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_INTSEL7N8")
    1570                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1571                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$167       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$297)
    1575                      .dwattr $C$DW$167, DW_AT_name("INTSEL9N10")
    1576                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTSEL9N10")
    1577                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1578                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580              $C$DW$168       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$168, DW_AT_name("rsvd3")
    1583                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd3")
    1584                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1585                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$169       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$169, DW_AT_name("rsvd4")
    1590                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd4")
    1591                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1592                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1593              
    1594              $C$DW$170       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   30

    1596                      .dwattr $C$DW$170, DW_AT_name("rsvd5")
    1597                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd5")
    1598                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1599                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$171       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$443)
    1603                      .dwattr $C$DW$171, DW_AT_name("SOCPRICTL")
    1604                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SOCPRICTL")
    1605                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1606                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1607              
    1608              $C$DW$172       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$172, DW_AT_name("rsvd6")
    1611                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd6")
    1612                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1613                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$173       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$36)
    1617                      .dwattr $C$DW$173, DW_AT_name("ADCSAMPLEMODE")
    1618                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1619                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1620                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$174       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$174, DW_AT_name("rsvd7")
    1625                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd7")
    1626                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1627                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1628              
    1629              $C$DW$175       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
    1631                      .dwattr $C$DW$175, DW_AT_name("ADCINTSOCSEL1")
    1632                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1633                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1634                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$176       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$27)
    1638                      .dwattr $C$DW$176, DW_AT_name("ADCINTSOCSEL2")
    1639                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1640                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1641                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$177       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$177, DW_AT_name("rsvd8")
    1646                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd8")
    1647                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1648                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$178       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   31

    1651                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$178, DW_AT_name("rsvd9")
    1653                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd9")
    1654                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1655                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657              $C$DW$179       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$38)
    1659                      .dwattr $C$DW$179, DW_AT_name("ADCSOCFLG1")
    1660                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1661                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1662                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664              $C$DW$180       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$180, DW_AT_name("rsvd10")
    1667                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd10")
    1668                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1669                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$181       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$38)
    1673                      .dwattr $C$DW$181, DW_AT_name("ADCSOCFRC1")
    1674                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1675                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1676                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$182       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$182, DW_AT_name("rsvd11")
    1681                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd11")
    1682                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1683                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685              $C$DW$183       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$38)
    1687                      .dwattr $C$DW$183, DW_AT_name("ADCSOCOVF1")
    1688                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1689                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1690                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1691              
    1692              $C$DW$184       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$184, DW_AT_name("rsvd12")
    1695                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd12")
    1696                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1697                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699              $C$DW$185       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$38)
    1701                      .dwattr $C$DW$185, DW_AT_name("ADCSOCOVFCLR1")
    1702                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1703                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1704                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1705              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   32

    1706              $C$DW$186       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$186, DW_AT_name("rsvd13")
    1709                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd13")
    1710                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1711                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713              $C$DW$187       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    1715                      .dwattr $C$DW$187, DW_AT_name("ADCSOC0CTL")
    1716                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ADCSOC0CTL")
    1717                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1718                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1719              
    1720              $C$DW$188       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    1722                      .dwattr $C$DW$188, DW_AT_name("ADCSOC1CTL")
    1723                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ADCSOC1CTL")
    1724                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1725                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727              $C$DW$189       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$40)
    1729                      .dwattr $C$DW$189, DW_AT_name("ADCSOC2CTL")
    1730                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ADCSOC2CTL")
    1731                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1732                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734              $C$DW$190       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$40)
    1736                      .dwattr $C$DW$190, DW_AT_name("ADCSOC3CTL")
    1737                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ADCSOC3CTL")
    1738                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1739                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1740              
    1741              $C$DW$191       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$40)
    1743                      .dwattr $C$DW$191, DW_AT_name("ADCSOC4CTL")
    1744                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ADCSOC4CTL")
    1745                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1746                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1747              
    1748              $C$DW$192       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$40)
    1750                      .dwattr $C$DW$192, DW_AT_name("ADCSOC5CTL")
    1751                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ADCSOC5CTL")
    1752                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1753                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1754              
    1755              $C$DW$193       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$40)
    1757                      .dwattr $C$DW$193, DW_AT_name("ADCSOC6CTL")
    1758                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_ADCSOC6CTL")
    1759                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1760                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   33

    1761              
    1762              $C$DW$194       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$40)
    1764                      .dwattr $C$DW$194, DW_AT_name("ADCSOC7CTL")
    1765                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ADCSOC7CTL")
    1766                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1767                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769              $C$DW$195       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$40)
    1771                      .dwattr $C$DW$195, DW_AT_name("ADCSOC8CTL")
    1772                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ADCSOC8CTL")
    1773                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1774                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1775              
    1776              $C$DW$196       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$40)
    1778                      .dwattr $C$DW$196, DW_AT_name("ADCSOC9CTL")
    1779                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_ADCSOC9CTL")
    1780                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1781                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1782              
    1783              $C$DW$197       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$40)
    1785                      .dwattr $C$DW$197, DW_AT_name("ADCSOC10CTL")
    1786                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_ADCSOC10CTL")
    1787                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1788                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1789              
    1790              $C$DW$198       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    1792                      .dwattr $C$DW$198, DW_AT_name("ADCSOC11CTL")
    1793                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_ADCSOC11CTL")
    1794                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1795                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$199       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    1799                      .dwattr $C$DW$199, DW_AT_name("ADCSOC12CTL")
    1800                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_ADCSOC12CTL")
    1801                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1802                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1803              
    1804              $C$DW$200       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$40)
    1806                      .dwattr $C$DW$200, DW_AT_name("ADCSOC13CTL")
    1807                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_ADCSOC13CTL")
    1808                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1809                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1810              
    1811              $C$DW$201       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$40)
    1813                      .dwattr $C$DW$201, DW_AT_name("ADCSOC14CTL")
    1814                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_ADCSOC14CTL")
    1815                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2806x_GlobalVariableDefs.asm                                        PAGE   34

    1816                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
