TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Sat Mar 11 21:51:21 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../watchdog.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Lawrence\Google Drive\workspace_v7\SeventhProject\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SysCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SysCtrlRegs")

      52 00000000 7622   EALLOW
      53 00000001 761F!         MOVW      DP,#_SysCtrlRegs+21   ; [CPU_U] 
         00000002 0000 
      54                      .dwpsn  file "../watchdog.c",line 20,column 5,is_stmt,isa 0
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    2

      55 00000003 56BF!         MOVB      @_SysCtrlRegs+21,#85,UNC ; [CPU_] |20| 
         00000004 5515 
      56                      .dwpsn  file "../watchdog.c",line 21,column 5,is_stmt,isa 0
      57 00000005 56BF!         MOVB      @_SysCtrlRegs+21,#170,UNC ; [CPU_] |21| 
         00000006 AA15 
      58 00000007 761A   EDIS
      59 00000008 FF69          SPM       #0                    ; [CPU_] 
      60              $C$DW$3 .dwtag  DW_TAG_TI_branch
      61                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
      62                      .dwattr $C$DW$3, DW_AT_TI_return
      63              
      64 00000009 0006          LRETR     ; [CPU_] 
      65                      ; return occurs ; [] 
      66                      .dwattr $C$DW$2, DW_AT_TI_end_file("../watchdog.c")
      67                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x17)
      68                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
      69                      .dwendentry
      70                      .dwendtag $C$DW$2
      71              
      72 0000000a               .sect   ".text"
      73                      .clink
      74                      .global _disableDog
      75              
      76              $C$DW$4 .dwtag  DW_TAG_subprogram
      77                      .dwattr $C$DW$4, DW_AT_name("disableDog")
      78                      .dwattr $C$DW$4, DW_AT_low_pc(_disableDog)
      79                      .dwattr $C$DW$4, DW_AT_high_pc(0x00)
      80                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_disableDog")
      81                      .dwattr $C$DW$4, DW_AT_external
      82                      .dwattr $C$DW$4, DW_AT_TI_begin_file("../watchdog.c")
      83                      .dwattr $C$DW$4, DW_AT_TI_begin_line(0x0a)
      84                      .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
      85                      .dwattr $C$DW$4, DW_AT_TI_max_frame_size(-2)
      86                      .dwpsn  file "../watchdog.c",line 11,column 1,is_stmt,address _disableDog,isa 0
      87              
      88                      .dwfde $C$DW$CIE, _disableDog
      89              
      90              ;***************************************************************
      91              ;* FNAME: _disableDog                   FR SIZE:   0           *
      92              ;*                                                             *
      93              ;* FUNCTION ENVIRONMENT                                        *
      94              ;*                                                             *
      95              ;* FUNCTION PROPERTIES                                         *
      96              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      97              ;***************************************************************
      98              
      99 0000000a       _disableDog:
     100                      .dwcfi  cfa_offset, -2
     101                      .dwcfi  save_reg_to_mem, 26, 0
     102 0000000a 7622   EALLOW
     103 0000000b 761F!         MOVW      DP,#_SysCtrlRegs+25   ; [CPU_U] 
         0000000c 0000 
     104                      .dwpsn  file "../watchdog.c",line 13,column 5,is_stmt,isa 0
     105 0000000d 56BF!         MOVB      @_SysCtrlRegs+25,#104,UNC ; [CPU_] |13| 
         0000000e 6819 
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    3

     106 0000000f 761A   EDIS
     107 00000010 FF69          SPM       #0                    ; [CPU_] 
     108              $C$DW$5 .dwtag  DW_TAG_TI_branch
     109                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     110                      .dwattr $C$DW$5, DW_AT_TI_return
     111              
     112 00000011 0006          LRETR     ; [CPU_] 
     113                      ; return occurs ; [] 
     114                      .dwattr $C$DW$4, DW_AT_TI_end_file("../watchdog.c")
     115                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x0f)
     116                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     117                      .dwendentry
     118                      .dwendtag $C$DW$4
     119              
     120              ;**************************************************************
     121              ;* UNDEFINED EXTERNAL REFERENCES                              *
     122              ;**************************************************************
     123                      .global _SysCtrlRegs
     124              
     125              ;***************************************************************
     126              ;* TYPE INFORMATION                                            *
     127              ;***************************************************************
     128              
     129              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     130                      .dwattr $C$DW$T$20, DW_AT_name("CLKCTL_BITS")
     131                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     132              $C$DW$6 .dwtag  DW_TAG_member
     133                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     134                      .dwattr $C$DW$6, DW_AT_name("OSCCLKSRCSEL")
     135                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     136                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     137                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     138                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     139                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     140              
     141              $C$DW$7 .dwtag  DW_TAG_member
     142                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     143                      .dwattr $C$DW$7, DW_AT_name("OSCCLKSRC2SEL")
     144                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     145                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     146                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     147                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     148                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     149              
     150              $C$DW$8 .dwtag  DW_TAG_member
     151                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     152                      .dwattr $C$DW$8, DW_AT_name("WDCLKSRCSEL")
     153                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     154                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     155                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     156                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     157                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     158              
     159              $C$DW$9 .dwtag  DW_TAG_member
     160                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    4

     161                      .dwattr $C$DW$9, DW_AT_name("TMR2CLKSRCSEL")
     162                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     163                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0b)
     164                      .dwattr $C$DW$9, DW_AT_bit_size(0x02)
     165                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     166                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     167              
     168              $C$DW$10        .dwtag  DW_TAG_member
     169                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     170                      .dwattr $C$DW$10, DW_AT_name("TMR2CLKPRESCALE")
     171                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     172                      .dwattr $C$DW$10, DW_AT_bit_offset(0x08)
     173                      .dwattr $C$DW$10, DW_AT_bit_size(0x03)
     174                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     175                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     176              
     177              $C$DW$11        .dwtag  DW_TAG_member
     178                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     179                      .dwattr $C$DW$11, DW_AT_name("INTOSC1OFF")
     180                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_INTOSC1OFF")
     181                      .dwattr $C$DW$11, DW_AT_bit_offset(0x07)
     182                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     183                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     184                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     185              
     186              $C$DW$12        .dwtag  DW_TAG_member
     187                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     188                      .dwattr $C$DW$12, DW_AT_name("INTOSC1HALTI")
     189                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     190                      .dwattr $C$DW$12, DW_AT_bit_offset(0x06)
     191                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     192                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     193                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     194              
     195              $C$DW$13        .dwtag  DW_TAG_member
     196                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     197                      .dwattr $C$DW$13, DW_AT_name("INTOSC2OFF")
     198                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_INTOSC2OFF")
     199                      .dwattr $C$DW$13, DW_AT_bit_offset(0x05)
     200                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     201                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     202                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     203              
     204              $C$DW$14        .dwtag  DW_TAG_member
     205                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     206                      .dwattr $C$DW$14, DW_AT_name("INTOSC2HALTI")
     207                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     208                      .dwattr $C$DW$14, DW_AT_bit_offset(0x04)
     209                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     210                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     211                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     212              
     213              $C$DW$15        .dwtag  DW_TAG_member
     214                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     215                      .dwattr $C$DW$15, DW_AT_name("WDHALTI")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    5

     216                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_WDHALTI")
     217                      .dwattr $C$DW$15, DW_AT_bit_offset(0x03)
     218                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     219                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     220                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     221              
     222              $C$DW$16        .dwtag  DW_TAG_member
     223                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     224                      .dwattr $C$DW$16, DW_AT_name("XCLKINOFF")
     225                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_XCLKINOFF")
     226                      .dwattr $C$DW$16, DW_AT_bit_offset(0x02)
     227                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     228                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     229                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     230              
     231              $C$DW$17        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     233                      .dwattr $C$DW$17, DW_AT_name("XTALOSCOFF")
     234                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_XTALOSCOFF")
     235                      .dwattr $C$DW$17, DW_AT_bit_offset(0x01)
     236                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     237                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     238                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     239              
     240              $C$DW$18        .dwtag  DW_TAG_member
     241                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     242                      .dwattr $C$DW$18, DW_AT_name("NMIRESETSEL")
     243                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_NMIRESETSEL")
     244                      .dwattr $C$DW$18, DW_AT_bit_offset(0x00)
     245                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     246                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     247                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     248              
     249                      .dwendtag $C$DW$T$20
     250              
     251              
     252              $C$DW$T$21      .dwtag  DW_TAG_union_type
     253                      .dwattr $C$DW$T$21, DW_AT_name("CLKCTL_REG")
     254                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     255              $C$DW$19        .dwtag  DW_TAG_member
     256                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     257                      .dwattr $C$DW$19, DW_AT_name("all")
     258                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_all")
     259                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     261              
     262              $C$DW$20        .dwtag  DW_TAG_member
     263                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     264                      .dwattr $C$DW$20, DW_AT_name("bit")
     265                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_bit")
     266                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     267                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     268              
     269                      .dwendtag $C$DW$T$21
     270              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    6

     271              
     272              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     273                      .dwattr $C$DW$T$22, DW_AT_name("EPWMCFG_BITS")
     274                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     275              $C$DW$21        .dwtag  DW_TAG_member
     276                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     277                      .dwattr $C$DW$21, DW_AT_name("CONFIG")
     278                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_CONFIG")
     279                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0f)
     280                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     281                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     282                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     283              
     284              $C$DW$22        .dwtag  DW_TAG_member
     285                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     286                      .dwattr $C$DW$22, DW_AT_name("rsvd1")
     287                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd1")
     288                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     289                      .dwattr $C$DW$22, DW_AT_bit_size(0x0f)
     290                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     291                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     292              
     293                      .dwendtag $C$DW$T$22
     294              
     295              
     296              $C$DW$T$23      .dwtag  DW_TAG_union_type
     297                      .dwattr $C$DW$T$23, DW_AT_name("EPWMCFG_REG")
     298                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     299              $C$DW$23        .dwtag  DW_TAG_member
     300                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     301                      .dwattr $C$DW$23, DW_AT_name("all")
     302                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     303                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     304                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     305              
     306              $C$DW$24        .dwtag  DW_TAG_member
     307                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     308                      .dwattr $C$DW$24, DW_AT_name("bit")
     309                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     310                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     311                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     312              
     313                      .dwendtag $C$DW$T$23
     314              
     315              
     316              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     317                      .dwattr $C$DW$T$24, DW_AT_name("INTOSC1TRIM_BITS")
     318                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     319              $C$DW$25        .dwtag  DW_TAG_member
     320                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     321                      .dwattr $C$DW$25, DW_AT_name("COARSETRIM")
     322                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_COARSETRIM")
     323                      .dwattr $C$DW$25, DW_AT_bit_offset(0x08)
     324                      .dwattr $C$DW$25, DW_AT_bit_size(0x08)
     325                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    7

     326                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     327              
     328              $C$DW$26        .dwtag  DW_TAG_member
     329                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     330                      .dwattr $C$DW$26, DW_AT_name("rsvd1")
     331                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd1")
     332                      .dwattr $C$DW$26, DW_AT_bit_offset(0x07)
     333                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     334                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     335                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     336              
     337              $C$DW$27        .dwtag  DW_TAG_member
     338                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     339                      .dwattr $C$DW$27, DW_AT_name("FINETRIM")
     340                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_FINETRIM")
     341                      .dwattr $C$DW$27, DW_AT_bit_offset(0x01)
     342                      .dwattr $C$DW$27, DW_AT_bit_size(0x06)
     343                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     344                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     345              
     346              $C$DW$28        .dwtag  DW_TAG_member
     347                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     348                      .dwattr $C$DW$28, DW_AT_name("rsvd2")
     349                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd2")
     350                      .dwattr $C$DW$28, DW_AT_bit_offset(0x00)
     351                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     352                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355                      .dwendtag $C$DW$T$24
     356              
     357              
     358              $C$DW$T$25      .dwtag  DW_TAG_union_type
     359                      .dwattr $C$DW$T$25, DW_AT_name("INTOSC1TRIM_REG")
     360                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     361              $C$DW$29        .dwtag  DW_TAG_member
     362                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     363                      .dwattr $C$DW$29, DW_AT_name("all")
     364                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_all")
     365                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     366                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     367              
     368              $C$DW$30        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$24)
     370                      .dwattr $C$DW$30, DW_AT_name("bit")
     371                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_bit")
     372                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     373                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     374              
     375                      .dwendtag $C$DW$T$25
     376              
     377              
     378              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     379                      .dwattr $C$DW$T$26, DW_AT_name("INTOSC2TRIM_BITS")
     380                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    8

     381              $C$DW$31        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     383                      .dwattr $C$DW$31, DW_AT_name("COARSETRIM")
     384                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_COARSETRIM")
     385                      .dwattr $C$DW$31, DW_AT_bit_offset(0x08)
     386                      .dwattr $C$DW$31, DW_AT_bit_size(0x08)
     387                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     388                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     389              
     390              $C$DW$32        .dwtag  DW_TAG_member
     391                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     392                      .dwattr $C$DW$32, DW_AT_name("rsvd1")
     393                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd1")
     394                      .dwattr $C$DW$32, DW_AT_bit_offset(0x07)
     395                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     396                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     397                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     398              
     399              $C$DW$33        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     401                      .dwattr $C$DW$33, DW_AT_name("FINETRIM")
     402                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_FINETRIM")
     403                      .dwattr $C$DW$33, DW_AT_bit_offset(0x01)
     404                      .dwattr $C$DW$33, DW_AT_bit_size(0x06)
     405                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     406                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     407              
     408              $C$DW$34        .dwtag  DW_TAG_member
     409                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     410                      .dwattr $C$DW$34, DW_AT_name("rsvd2")
     411                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd2")
     412                      .dwattr $C$DW$34, DW_AT_bit_offset(0x00)
     413                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     414                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     416              
     417                      .dwendtag $C$DW$T$26
     418              
     419              
     420              $C$DW$T$27      .dwtag  DW_TAG_union_type
     421                      .dwattr $C$DW$T$27, DW_AT_name("INTOSC2TRIM_REG")
     422                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     423              $C$DW$35        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$35, DW_AT_name("all")
     426                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_all")
     427                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     428                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     429              
     430              $C$DW$36        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$26)
     432                      .dwattr $C$DW$36, DW_AT_name("bit")
     433                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_bit")
     434                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     435                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE    9

     436              
     437                      .dwendtag $C$DW$T$27
     438              
     439              
     440              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     441                      .dwattr $C$DW$T$28, DW_AT_name("JTAGDEBUG_BITS")
     442                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     443              $C$DW$37        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     445                      .dwattr $C$DW$37, DW_AT_name("JTAGDIS")
     446                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_JTAGDIS")
     447                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0f)
     448                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     449                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452              $C$DW$38        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$38, DW_AT_name("rsvd1")
     455                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd1")
     456                      .dwattr $C$DW$38, DW_AT_bit_offset(0x00)
     457                      .dwattr $C$DW$38, DW_AT_bit_size(0x0f)
     458                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     460              
     461                      .dwendtag $C$DW$T$28
     462              
     463              
     464              $C$DW$T$29      .dwtag  DW_TAG_union_type
     465                      .dwattr $C$DW$T$29, DW_AT_name("JTAGDEBUG_REG")
     466                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     467              $C$DW$39        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$39, DW_AT_name("all")
     470                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_all")
     471                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     472                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     473              
     474              $C$DW$40        .dwtag  DW_TAG_member
     475                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$28)
     476                      .dwattr $C$DW$40, DW_AT_name("bit")
     477                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_bit")
     478                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     479                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     480              
     481                      .dwendtag $C$DW$T$29
     482              
     483              
     484              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     485                      .dwattr $C$DW$T$30, DW_AT_name("LOSPCP_BITS")
     486                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     487              $C$DW$41        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$41, DW_AT_name("LSPCLK")
     490                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_LSPCLK")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   10

     491                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0d)
     492                      .dwattr $C$DW$41, DW_AT_bit_size(0x03)
     493                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     495              
     496              $C$DW$42        .dwtag  DW_TAG_member
     497                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     498                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     499                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     500                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
     501                      .dwattr $C$DW$42, DW_AT_bit_size(0x0d)
     502                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     504              
     505                      .dwendtag $C$DW$T$30
     506              
     507              
     508              $C$DW$T$31      .dwtag  DW_TAG_union_type
     509                      .dwattr $C$DW$T$31, DW_AT_name("LOSPCP_REG")
     510                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     511              $C$DW$43        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$43, DW_AT_name("all")
     514                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     515                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     516                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     517              
     518              $C$DW$44        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$30)
     520                      .dwattr $C$DW$44, DW_AT_name("bit")
     521                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     522                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525                      .dwendtag $C$DW$T$31
     526              
     527              
     528              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     529                      .dwattr $C$DW$T$32, DW_AT_name("LPMCR0_BITS")
     530                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     531              $C$DW$45        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     533                      .dwattr $C$DW$45, DW_AT_name("LPM")
     534                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_LPM")
     535                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0e)
     536                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
     537                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     538                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     539              
     540              $C$DW$46        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$46, DW_AT_name("QUALSTDBY")
     543                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_QUALSTDBY")
     544                      .dwattr $C$DW$46, DW_AT_bit_offset(0x08)
     545                      .dwattr $C$DW$46, DW_AT_bit_size(0x06)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   11

     546                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     548              
     549              $C$DW$47        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     552                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     553                      .dwattr $C$DW$47, DW_AT_bit_offset(0x01)
     554                      .dwattr $C$DW$47, DW_AT_bit_size(0x07)
     555                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558              $C$DW$48        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     560                      .dwattr $C$DW$48, DW_AT_name("WDINTE")
     561                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_WDINTE")
     562                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00)
     563                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     564                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567                      .dwendtag $C$DW$T$32
     568              
     569              
     570              $C$DW$T$33      .dwtag  DW_TAG_union_type
     571                      .dwattr $C$DW$T$33, DW_AT_name("LPMCR0_REG")
     572                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     573              $C$DW$49        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     575                      .dwattr $C$DW$49, DW_AT_name("all")
     576                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     577                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     579              
     580              $C$DW$50        .dwtag  DW_TAG_member
     581                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$32)
     582                      .dwattr $C$DW$50, DW_AT_name("bit")
     583                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     584                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     586              
     587                      .dwendtag $C$DW$T$33
     588              
     589              
     590              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     591                      .dwattr $C$DW$T$34, DW_AT_name("PCLKCR0_BITS")
     592                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     593              $C$DW$51        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     595                      .dwattr $C$DW$51, DW_AT_name("HRPWMENCLK")
     596                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_HRPWMENCLK")
     597                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0f)
     598                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     599                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     600                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   12

     601              
     602              $C$DW$52        .dwtag  DW_TAG_member
     603                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     604                      .dwattr $C$DW$52, DW_AT_name("rsvd1")
     605                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd1")
     606                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0e)
     607                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     608                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     610              
     611              $C$DW$53        .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     613                      .dwattr $C$DW$53, DW_AT_name("TBCLKSYNC")
     614                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_TBCLKSYNC")
     615                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0d)
     616                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     617                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     619              
     620              $C$DW$54        .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     622                      .dwattr $C$DW$54, DW_AT_name("ADCENCLK")
     623                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ADCENCLK")
     624                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c)
     625                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     626                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     627                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     628              
     629              $C$DW$55        .dwtag  DW_TAG_member
     630                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     631                      .dwattr $C$DW$55, DW_AT_name("I2CAENCLK")
     632                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_I2CAENCLK")
     633                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0b)
     634                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     635                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     637              
     638              $C$DW$56        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$56, DW_AT_name("rsvd2")
     641                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd2")
     642                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0a)
     643                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     644                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     646              
     647              $C$DW$57        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$57, DW_AT_name("rsvd3")
     650                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd3")
     651                      .dwattr $C$DW$57, DW_AT_bit_offset(0x08)
     652                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
     653                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     654                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     655              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   13

     656              $C$DW$58        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$58, DW_AT_name("SPIAENCLK")
     659                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_SPIAENCLK")
     660                      .dwattr $C$DW$58, DW_AT_bit_offset(0x07)
     661                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     662                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     664              
     665              $C$DW$59        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     667                      .dwattr $C$DW$59, DW_AT_name("SPIBENCLK")
     668                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_SPIBENCLK")
     669                      .dwattr $C$DW$59, DW_AT_bit_offset(0x06)
     670                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     671                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     673              
     674              $C$DW$60        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     676                      .dwattr $C$DW$60, DW_AT_name("SCIAENCLK")
     677                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SCIAENCLK")
     678                      .dwattr $C$DW$60, DW_AT_bit_offset(0x05)
     679                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     680                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$61        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$61, DW_AT_name("SCIBENCLK")
     686                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_SCIBENCLK")
     687                      .dwattr $C$DW$61, DW_AT_bit_offset(0x04)
     688                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     691              
     692              $C$DW$62        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$62, DW_AT_name("MCBSPAENCLK")
     695                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_MCBSPAENCLK")
     696                      .dwattr $C$DW$62, DW_AT_bit_offset(0x03)
     697                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     698                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$63        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     703                      .dwattr $C$DW$63, DW_AT_name("rsvd4")
     704                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd4")
     705                      .dwattr $C$DW$63, DW_AT_bit_offset(0x02)
     706                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     707                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     708                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     709              
     710              $C$DW$64        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   14

     711                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     712                      .dwattr $C$DW$64, DW_AT_name("ECANAENCLK")
     713                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_ECANAENCLK")
     714                      .dwattr $C$DW$64, DW_AT_bit_offset(0x01)
     715                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     716                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719              $C$DW$65        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$65, DW_AT_name("rsvd5")
     722                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd5")
     723                      .dwattr $C$DW$65, DW_AT_bit_offset(0x00)
     724                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     725                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728                      .dwendtag $C$DW$T$34
     729              
     730              
     731              $C$DW$T$35      .dwtag  DW_TAG_union_type
     732                      .dwattr $C$DW$T$35, DW_AT_name("PCLKCR0_REG")
     733                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     734              $C$DW$66        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$66, DW_AT_name("all")
     737                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_all")
     738                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     740              
     741              $C$DW$67        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$34)
     743                      .dwattr $C$DW$67, DW_AT_name("bit")
     744                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_bit")
     745                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748                      .dwendtag $C$DW$T$35
     749              
     750              
     751              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     752                      .dwattr $C$DW$T$36, DW_AT_name("PCLKCR1_BITS")
     753                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     754              $C$DW$68        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$68, DW_AT_name("EPWM1ENCLK")
     757                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_EPWM1ENCLK")
     758                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0f)
     759                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     760                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$69        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$69, DW_AT_name("EPWM2ENCLK")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   15

     766                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_EPWM2ENCLK")
     767                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0e)
     768                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     769                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$70        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$70, DW_AT_name("EPWM3ENCLK")
     775                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_EPWM3ENCLK")
     776                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0d)
     777                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     778                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$71        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$71, DW_AT_name("EPWM4ENCLK")
     784                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_EPWM4ENCLK")
     785                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0c)
     786                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     787                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     789              
     790              $C$DW$72        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$72, DW_AT_name("EPWM5ENCLK")
     793                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_EPWM5ENCLK")
     794                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0b)
     795                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     796                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     798              
     799              $C$DW$73        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$73, DW_AT_name("EPWM6ENCLK")
     802                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_EPWM6ENCLK")
     803                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0a)
     804                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     805                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     807              
     808              $C$DW$74        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$74, DW_AT_name("EPWM7ENCLK")
     811                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_EPWM7ENCLK")
     812                      .dwattr $C$DW$74, DW_AT_bit_offset(0x09)
     813                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     814                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$75        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$75, DW_AT_name("EPWM8ENCLK")
     820                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_EPWM8ENCLK")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   16

     821                      .dwattr $C$DW$75, DW_AT_bit_offset(0x08)
     822                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     823                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     825              
     826              $C$DW$76        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$76, DW_AT_name("ECAP1ENCLK")
     829                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_ECAP1ENCLK")
     830                      .dwattr $C$DW$76, DW_AT_bit_offset(0x07)
     831                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     832                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     834              
     835              $C$DW$77        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     837                      .dwattr $C$DW$77, DW_AT_name("ECAP2ENCLK")
     838                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_ECAP2ENCLK")
     839                      .dwattr $C$DW$77, DW_AT_bit_offset(0x06)
     840                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     841                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     843              
     844              $C$DW$78        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$78, DW_AT_name("ECAP3ENCLK")
     847                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_ECAP3ENCLK")
     848                      .dwattr $C$DW$78, DW_AT_bit_offset(0x05)
     849                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$79        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
     856                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
     857                      .dwattr $C$DW$79, DW_AT_bit_offset(0x02)
     858                      .dwattr $C$DW$79, DW_AT_bit_size(0x03)
     859                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     861              
     862              $C$DW$80        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     864                      .dwattr $C$DW$80, DW_AT_name("EQEP1ENCLK")
     865                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_EQEP1ENCLK")
     866                      .dwattr $C$DW$80, DW_AT_bit_offset(0x01)
     867                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     868                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     870              
     871              $C$DW$81        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$81, DW_AT_name("EQEP2ENCLK")
     874                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_EQEP2ENCLK")
     875                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   17

     876                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     877                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     879              
     880                      .dwendtag $C$DW$T$36
     881              
     882              
     883              $C$DW$T$37      .dwtag  DW_TAG_union_type
     884                      .dwattr $C$DW$T$37, DW_AT_name("PCLKCR1_REG")
     885                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     886              $C$DW$82        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     888                      .dwattr $C$DW$82, DW_AT_name("all")
     889                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
     890                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     892              
     893              $C$DW$83        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$36)
     895                      .dwattr $C$DW$83, DW_AT_name("bit")
     896                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
     897                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     899              
     900                      .dwendtag $C$DW$T$37
     901              
     902              
     903              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     904                      .dwattr $C$DW$T$38, DW_AT_name("PCLKCR2_BITS")
     905                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     906              $C$DW$84        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
     909                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
     910                      .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
     911                      .dwattr $C$DW$84, DW_AT_bit_size(0x08)
     912                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$85        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$85, DW_AT_name("HRCAP1ENCLK")
     918                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_HRCAP1ENCLK")
     919                      .dwattr $C$DW$85, DW_AT_bit_offset(0x07)
     920                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     921                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$86        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$86, DW_AT_name("HRCAP2ENCLK")
     927                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_HRCAP2ENCLK")
     928                      .dwattr $C$DW$86, DW_AT_bit_offset(0x06)
     929                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     930                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   18

     931                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     932              
     933              $C$DW$87        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     935                      .dwattr $C$DW$87, DW_AT_name("HRCAP3ENCLK")
     936                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_HRCAP3ENCLK")
     937                      .dwattr $C$DW$87, DW_AT_bit_offset(0x05)
     938                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     939                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     941              
     942              $C$DW$88        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$88, DW_AT_name("HRCAP4ENCLK")
     945                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_HRCAP4ENCLK")
     946                      .dwattr $C$DW$88, DW_AT_bit_offset(0x04)
     947                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     948                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     950              
     951              $C$DW$89        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$89, DW_AT_name("rsvd2")
     954                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd2")
     955                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
     956                      .dwattr $C$DW$89, DW_AT_bit_size(0x04)
     957                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     958                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     959              
     960                      .dwendtag $C$DW$T$38
     961              
     962              
     963              $C$DW$T$39      .dwtag  DW_TAG_union_type
     964                      .dwattr $C$DW$T$39, DW_AT_name("PCLKCR2_REG")
     965                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     966              $C$DW$90        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$90, DW_AT_name("all")
     969                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     970                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     972              
     973              $C$DW$91        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$38)
     975                      .dwattr $C$DW$91, DW_AT_name("bit")
     976                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
     977                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     979              
     980                      .dwendtag $C$DW$T$39
     981              
     982              
     983              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     984                      .dwattr $C$DW$T$40, DW_AT_name("PCLKCR3_BITS")
     985                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   19

     986              $C$DW$92        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$92, DW_AT_name("COMP1ENCLK")
     989                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_COMP1ENCLK")
     990                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0f)
     991                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$93        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$93, DW_AT_name("COMP2ENCLK")
     998                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_COMP2ENCLK")
     999                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e)
    1000                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1003              
    1004              $C$DW$94        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$94, DW_AT_name("COMP3ENCLK")
    1007                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_COMP3ENCLK")
    1008                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d)
    1009                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1010                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$95        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
    1016                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
    1017                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1018                      .dwattr $C$DW$95, DW_AT_bit_size(0x05)
    1019                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1021              
    1022              $C$DW$96        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$96, DW_AT_name("CPUTIMER0ENCLK")
    1025                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CPUTIMER0ENCLK")
    1026                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1027                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1028                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$97        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$97, DW_AT_name("CPUTIMER1ENCLK")
    1034                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_CPUTIMER1ENCLK")
    1035                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1036                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1037                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1039              
    1040              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   20

    1041                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$98, DW_AT_name("CPUTIMER2ENCLK")
    1043                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_CPUTIMER2ENCLK")
    1044                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1045                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1046                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1048              
    1049              $C$DW$99        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1051                      .dwattr $C$DW$99, DW_AT_name("DMAENCLK")
    1052                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DMAENCLK")
    1053                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1054                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1055                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1057              
    1058              $C$DW$100       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1061                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1062                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1063                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1064                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1066              
    1067              $C$DW$101       .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$101, DW_AT_name("rsvd3")
    1070                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd3")
    1071                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1072                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1073                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1075              
    1076              $C$DW$102       .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$102, DW_AT_name("CLA1ENCLK")
    1079                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_CLA1ENCLK")
    1080                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1081                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1084              
    1085              $C$DW$103       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$103, DW_AT_name("USB0ENCLK")
    1088                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_USB0ENCLK")
    1089                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1090                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1091                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1093              
    1094                      .dwendtag $C$DW$T$40
    1095              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   21

    1096              
    1097              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1098                      .dwattr $C$DW$T$41, DW_AT_name("PCLKCR3_REG")
    1099                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1100              $C$DW$104       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$104, DW_AT_name("all")
    1103                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1104                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107              $C$DW$105       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$40)
    1109                      .dwattr $C$DW$105, DW_AT_name("bit")
    1110                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1111                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114                      .dwendtag $C$DW$T$41
    1115              
    1116              
    1117              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1118                      .dwattr $C$DW$T$42, DW_AT_name("PLL2CTL_BITS")
    1119                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1120              $C$DW$106       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$106, DW_AT_name("PLL2CLKSRCSEL")
    1123                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PLL2CLKSRCSEL")
    1124                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e)
    1125                      .dwattr $C$DW$106, DW_AT_bit_size(0x02)
    1126                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129              $C$DW$107       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$107, DW_AT_name("PLL2EN")
    1132                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PLL2EN")
    1133                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d)
    1134                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1135                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$108       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$108, DW_AT_name("rsvd1")
    1141                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd1")
    1142                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00)
    1143                      .dwattr $C$DW$108, DW_AT_bit_size(0x0d)
    1144                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1146              
    1147                      .dwendtag $C$DW$T$42
    1148              
    1149              
    1150              $C$DW$T$43      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   22

    1151                      .dwattr $C$DW$T$43, DW_AT_name("PLL2CTL_REG")
    1152                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1153              $C$DW$109       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$109, DW_AT_name("all")
    1156                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    1157                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$110       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$42)
    1162                      .dwattr $C$DW$110, DW_AT_name("bit")
    1163                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1164                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1166              
    1167                      .dwendtag $C$DW$T$43
    1168              
    1169              
    1170              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1171                      .dwattr $C$DW$T$44, DW_AT_name("PLL2MULT_BITS")
    1172                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1173              $C$DW$111       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$111, DW_AT_name("PLL2MULT")
    1176                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PLL2MULT")
    1177                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1178                      .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1179                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$112       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    1185                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    1186                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1187                      .dwattr $C$DW$112, DW_AT_bit_size(0x0c)
    1188                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191                      .dwendtag $C$DW$T$44
    1192              
    1193              
    1194              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1195                      .dwattr $C$DW$T$45, DW_AT_name("PLL2MULT_REG")
    1196                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1197              $C$DW$113       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$113, DW_AT_name("all")
    1200                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1201                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204              $C$DW$114       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   23

    1206                      .dwattr $C$DW$114, DW_AT_name("bit")
    1207                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1208                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1210              
    1211                      .dwendtag $C$DW$T$45
    1212              
    1213              
    1214              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1215                      .dwattr $C$DW$T$46, DW_AT_name("PLL2STS_BITS")
    1216                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1217              $C$DW$115       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$115, DW_AT_name("PLL2LOCKS")
    1220                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PLL2LOCKS")
    1221                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0f)
    1222                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1224                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$116       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1229                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1230                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1231                      .dwattr $C$DW$116, DW_AT_bit_size(0x0f)
    1232                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235                      .dwendtag $C$DW$T$46
    1236              
    1237              
    1238              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1239                      .dwattr $C$DW$T$47, DW_AT_name("PLL2STS_REG")
    1240                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1241              $C$DW$117       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$117, DW_AT_name("all")
    1244                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1245                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$118       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$46)
    1250                      .dwattr $C$DW$118, DW_AT_name("bit")
    1251                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1252                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255                      .dwendtag $C$DW$T$47
    1256              
    1257              
    1258              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1259                      .dwattr $C$DW$T$48, DW_AT_name("PLLCR_BITS")
    1260                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   24

    1261              $C$DW$119       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$119, DW_AT_name("DIV")
    1264                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_DIV")
    1265                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b)
    1266                      .dwattr $C$DW$119, DW_AT_bit_size(0x05)
    1267                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$120       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1273                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1274                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1275                      .dwattr $C$DW$120, DW_AT_bit_size(0x0b)
    1276                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279                      .dwendtag $C$DW$T$48
    1280              
    1281              
    1282              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1283                      .dwattr $C$DW$T$49, DW_AT_name("PLLCR_REG")
    1284                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1285              $C$DW$121       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$121, DW_AT_name("all")
    1288                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1289                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1291              
    1292              $C$DW$122       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$48)
    1294                      .dwattr $C$DW$122, DW_AT_name("bit")
    1295                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1296                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299                      .dwendtag $C$DW$T$49
    1300              
    1301              
    1302              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1303                      .dwattr $C$DW$T$50, DW_AT_name("PLLSTS_BITS")
    1304                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1305              $C$DW$123       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$123, DW_AT_name("PLLLOCKS")
    1308                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PLLLOCKS")
    1309                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f)
    1310                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$124       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   25

    1316                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    1317                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    1318                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1319                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323              $C$DW$125       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$125, DW_AT_name("PLLOFF")
    1326                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PLLOFF")
    1327                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1328                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$126       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$126, DW_AT_name("MCLKSTS")
    1335                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_MCLKSTS")
    1336                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c)
    1337                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$127       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$127, DW_AT_name("MCLKCLR")
    1344                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_MCLKCLR")
    1345                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b)
    1346                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1349              
    1350              $C$DW$128       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$128, DW_AT_name("OSCOFF")
    1353                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_OSCOFF")
    1354                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    1355                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1356                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$129       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$129, DW_AT_name("MCLKOFF")
    1362                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_MCLKOFF")
    1363                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09)
    1364                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$130       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$130, DW_AT_name("DIVSEL")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   26

    1371                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DIVSEL")
    1372                      .dwattr $C$DW$130, DW_AT_bit_offset(0x07)
    1373                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1374                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$131       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1380                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1381                      .dwattr $C$DW$131, DW_AT_bit_offset(0x01)
    1382                      .dwattr $C$DW$131, DW_AT_bit_size(0x06)
    1383                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$132       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$132, DW_AT_name("NORMRDYE")
    1389                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_NORMRDYE")
    1390                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1391                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1392                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395                      .dwendtag $C$DW$T$50
    1396              
    1397              
    1398              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1399                      .dwattr $C$DW$T$51, DW_AT_name("PLLSTS_REG")
    1400                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1401              $C$DW$133       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1403                      .dwattr $C$DW$133, DW_AT_name("all")
    1404                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1405                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408              $C$DW$134       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$50)
    1410                      .dwattr $C$DW$134, DW_AT_name("bit")
    1411                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1412                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1414              
    1415                      .dwendtag $C$DW$T$51
    1416              
    1417              
    1418              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1419                      .dwattr $C$DW$T$55, DW_AT_name("SYS_CTRL_REGS")
    1420                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x30)
    1421              $C$DW$135       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$57)
    1423                      .dwattr $C$DW$135, DW_AT_name("XCLK")
    1424                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_XCLK")
    1425                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
watchdog.asm                                                         PAGE   27

    1426                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1427              
    1428              $C$DW$136       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$51)
    1430                      .dwattr $C$DW$136, DW_AT_name("PLLSTS")
    1431                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PLLSTS")
    1432                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1433                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1434              
    1435              $C$DW$137       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    1437                      .dwattr $C$DW$137, DW_AT_name("CLKCTL")
