TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Apr 10 14:49:15 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/F2806x_PieVect.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DINTCH4_ISR")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DINTCH4_ISR")

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   21

     968                      .global _DINTCH5_ISR
     969                      .global _DINTCH3_ISR
     970                      .global _DINTCH1_ISR
     971                      .global _DINTCH2_ISR
     972                      .global _MXINTA_ISR
     973                      .global _SCITXINTA_ISR
     974                      .global _SCIRXINTB_ISR
     975                      .global _SCIRXINTA_ISR
     976                      .global _I2CINT1A_ISR
     977                      .global _I2CINT2A_ISR
     978                      .global _HRCAP3_INT_ISR
     979                      .global _HRCAP4_INT_ISR
     980                      .global _EQEP2_INT_ISR
     981                      .global _HRCAP2_INT_ISR
     982                      .global _EQEP1_INT_ISR
     983                      .global _HRCAP1_INT_ISR
     984                      .global _MRINTA_ISR
     985                      .global _DINTCH6_ISR
     986                      .global _SPIRXINTB_ISR
     987                      .global _SPIRXINTA_ISR
     988                      .global _SPITXINTA_ISR
     989                      .global _USB0_INT_ISR
     990                      .global _CLA1_INT7_ISR
     991                      .global _CLA1_INT8_ISR
     992                      .global _CLA1_INT6_ISR
     993                      .global _CLA1_INT4_ISR
     994                      .global _CLA1_INT5_ISR
     995                      .global _CLA1_INT3_ISR
     996                      .global _rsvd_ISR
     997                      .global _PIE_RESERVED
     998                      .global _LVF_ISR
     999                      .global _LUF_ISR
    1000                      .global _ADCINT4_ISR
    1001                      .global _ADCINT5_ISR
    1002                      .global _ADCINT3_ISR
    1003                      .global _ECAN0INTA_ISR
    1004                      .global _ECAN1INTA_ISR
    1005                      .global _SCITXINTB_ISR
    1006                      .global _CLA1_INT2_ISR
    1007                      .global _XINT3_ISR
    1008                      .global _CLA1_INT1_ISR
    1009                      .global _ADCINT7_ISR
    1010                      .global _ADCINT8_ISR
    1011                      .global _USER9_ISR
    1012                      .global _USER10_ISR
    1013                      .global _USER8_ISR
    1014                      .global _USER6_ISR
    1015                      .global _USER7_ISR
    1016                      .global _USER5_ISR
    1017                      .global _XINT1_ISR
    1018                      .global _XINT2_ISR
    1019                      .global _ADCINT2_ISR
    1020                      .global _USER12_ISR
    1021                      .global _ADCINT1_ISR
    1022                      .global _EMUINT_ISR
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   22

    1023                      .global _NMI_ISR
    1024                      .global _RTOSINT_ISR
    1025                      .global _INT14_ISR
    1026                      .global _DATALOG_ISR
    1027                      .global _INT13_ISR
    1028                      .global _USER4_ISR
    1029                      .global _USER11_ISR
    1030                      .global _USER3_ISR
    1031                      .global _USER1_ISR
    1032                      .global _USER2_ISR
    1033                      .global _ILLEGAL_ISR
    1034                      .global _EPWM5_INT_ISR
    1035                      .global _EPWM6_INT_ISR
    1036                      .global _EPWM4_INT_ISR
    1037                      .global _EPWM2_INT_ISR
    1038                      .global _EPWM3_INT_ISR
    1039                      .global _EPWM1_INT_ISR
    1040                      .global _ECAP3_INT_ISR
    1041                      .global _ADCINT6_ISR
    1042                      .global _ECAP2_INT_ISR
    1043                      .global _EPWM8_INT_ISR
    1044                      .global _ECAP1_INT_ISR
    1045                      .global _EPWM2_TZINT_ISR
    1046                      .global _EPWM3_TZINT_ISR
    1047                      .global _EPWM1_TZINT_ISR
    1048                      .global _TINT0_ISR
    1049                      .global _WAKEINT_ISR
    1050                      .global _ADCINT9_ISR
    1051                      .global _EPWM8_TZINT_ISR
    1052                      .global _EPWM7_INT_ISR
    1053                      .global _EPWM7_TZINT_ISR
    1054                      .global _EPWM5_TZINT_ISR
    1055                      .global _EPWM6_TZINT_ISR
    1056                      .global _EPWM4_TZINT_ISR
    1057                      .global _PieCtrlRegs
    1058                      .global _PieVectTable
    1059              
    1060              ;***************************************************************
    1061              ;* TYPE INFORMATION                                            *
    1062              ;***************************************************************
    1063              
    1064              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1065                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1066                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1067              $C$DW$98        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$98, DW_AT_name("ACK1")
    1070                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ACK1")
    1071                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0f)
    1072                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1073                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1075              
    1076              $C$DW$99        .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   23

    1078                      .dwattr $C$DW$99, DW_AT_name("ACK2")
    1079                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ACK2")
    1080                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e)
    1081                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1084              
    1085              $C$DW$100       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$100, DW_AT_name("ACK3")
    1088                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_ACK3")
    1089                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0d)
    1090                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1091                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1093              
    1094              $C$DW$101       .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1096                      .dwattr $C$DW$101, DW_AT_name("ACK4")
    1097                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_ACK4")
    1098                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0c)
    1099                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1100                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1102              
    1103              $C$DW$102       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$102, DW_AT_name("ACK5")
    1106                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_ACK5")
    1107                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0b)
    1108                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1109                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1110                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1111              
    1112              $C$DW$103       .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1114                      .dwattr $C$DW$103, DW_AT_name("ACK6")
    1115                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ACK6")
    1116                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0a)
    1117                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1118                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1120              
    1121              $C$DW$104       .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1123                      .dwattr $C$DW$104, DW_AT_name("ACK7")
    1124                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ACK7")
    1125                      .dwattr $C$DW$104, DW_AT_bit_offset(0x09)
    1126                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1127                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1129              
    1130              $C$DW$105       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$105, DW_AT_name("ACK8")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   24

    1133                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ACK8")
    1134                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1135                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1136                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1138              
    1139              $C$DW$106       .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1141                      .dwattr $C$DW$106, DW_AT_name("ACK9")
    1142                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ACK9")
    1143                      .dwattr $C$DW$106, DW_AT_bit_offset(0x07)
    1144                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1145                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148              $C$DW$107       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$107, DW_AT_name("ACK10")
    1151                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ACK10")
    1152                      .dwattr $C$DW$107, DW_AT_bit_offset(0x06)
    1153                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157              $C$DW$108       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1159                      .dwattr $C$DW$108, DW_AT_name("ACK11")
    1160                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ACK11")
    1161                      .dwattr $C$DW$108, DW_AT_bit_offset(0x05)
    1162                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1163                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166              $C$DW$109       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$109, DW_AT_name("ACK12")
    1169                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ACK12")
    1170                      .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    1171                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1172                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1174              
    1175              $C$DW$110       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1178                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1179                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1180                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1181                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1183              
    1184                      .dwendtag $C$DW$T$20
    1185              
    1186              
    1187              $C$DW$T$21      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   25

    1188                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1189                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1190              $C$DW$111       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$111, DW_AT_name("all")
    1193                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1194                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1196              
    1197              $C$DW$112       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1199                      .dwattr $C$DW$112, DW_AT_name("bit")
    1200                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1201                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204                      .dwendtag $C$DW$T$21
    1205              
    1206              
    1207              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1208                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1209                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1210              $C$DW$113       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$113, DW_AT_name("ENPIE")
    1213                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_ENPIE")
    1214                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1215                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1216                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1217                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1218              
    1219              $C$DW$114       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$114, DW_AT_name("PIEVECT")
    1222                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PIEVECT")
    1223                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1224                      .dwattr $C$DW$114, DW_AT_bit_size(0x0f)
    1225                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228                      .dwendtag $C$DW$T$22
    1229              
    1230              
    1231              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1232                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1233                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1234              $C$DW$115       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$115, DW_AT_name("all")
    1237                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1238                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$116       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   26

    1243                      .dwattr $C$DW$116, DW_AT_name("bit")
    1244                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1245                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248                      .dwendtag $C$DW$T$23
    1249              
    1250              
    1251              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1252                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
    1253                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1254              $C$DW$117       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$117, DW_AT_name("INTx1")
    1257                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx1")
    1258                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f)
    1259                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1260                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$118       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$118, DW_AT_name("INTx2")
    1266                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx2")
    1267                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e)
    1268                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$119       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$119, DW_AT_name("INTx3")
    1275                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INTx3")
    1276                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d)
    1277                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1278                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$120       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$120, DW_AT_name("INTx4")
    1284                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INTx4")
    1285                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c)
    1286                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$121       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$121, DW_AT_name("INTx5")
    1293                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTx5")
    1294                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b)
    1295                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1296                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   27

    1298              
    1299              $C$DW$122       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$122, DW_AT_name("INTx6")
    1302                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_INTx6")
    1303                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a)
    1304                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1305                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1307              
    1308              $C$DW$123       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$123, DW_AT_name("INTx7")
    1311                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx7")
    1312                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09)
    1313                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1314                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$124       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$124, DW_AT_name("INTx8")
    1320                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx8")
    1321                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08)
    1322                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1323                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$125       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1329                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1330                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    1331                      .dwattr $C$DW$125, DW_AT_bit_size(0x08)
    1332                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335                      .dwendtag $C$DW$T$24
    1336              
    1337              
    1338              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1339                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
    1340                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1341              $C$DW$126       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$126, DW_AT_name("all")
    1344                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1345                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$127       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
    1350                      .dwattr $C$DW$127, DW_AT_name("bit")
    1351                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1352                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   28

    1353                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355                      .dwendtag $C$DW$T$25
    1356              
    1357              
    1358              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1359                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
    1360                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1361              $C$DW$128       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$128, DW_AT_name("INTx1")
    1364                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTx1")
    1365                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0f)
    1366                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1367                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$129       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$129, DW_AT_name("INTx2")
    1373                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTx2")
    1374                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0e)
    1375                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1376                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1378              
    1379              $C$DW$130       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1381                      .dwattr $C$DW$130, DW_AT_name("INTx3")
    1382                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTx3")
    1383                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0d)
    1384                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1385                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388              $C$DW$131       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$131, DW_AT_name("INTx4")
    1391                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_INTx4")
    1392                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0c)
    1393                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1394                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$132       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$132, DW_AT_name("INTx5")
    1400                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_INTx5")
    1401                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0b)
    1402                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1403                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406              $C$DW$133       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   29

    1408                      .dwattr $C$DW$133, DW_AT_name("INTx6")
    1409                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_INTx6")
    1410                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a)
    1411                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1412                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1414              
    1415              $C$DW$134       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1417                      .dwattr $C$DW$134, DW_AT_name("INTx7")
    1418                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INTx7")
    1419                      .dwattr $C$DW$134, DW_AT_bit_offset(0x09)
    1420                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1421                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1423              
    1424              $C$DW$135       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$135, DW_AT_name("INTx8")
    1427                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INTx8")
    1428                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08)
    1429                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1430                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$136       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    1436                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    1437                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    1438                      .dwattr $C$DW$136, DW_AT_bit_size(0x08)
    1439                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442                      .dwendtag $C$DW$T$26
    1443              
    1444              
    1445              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1446                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
    1447                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1448              $C$DW$137       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$137, DW_AT_name("all")
    1451                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    1452                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1454              
    1455              $C$DW$138       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$26)
    1457                      .dwattr $C$DW$138, DW_AT_name("bit")
    1458                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1459                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462                      .dwendtag $C$DW$T$27
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   30

    1463              
    1464              
    1465              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1466                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
    1467                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
    1468              $C$DW$139       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    1470                      .dwattr $C$DW$139, DW_AT_name("PIECTRL")
    1471                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PIECTRL")
    1472                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$140       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1477                      .dwattr $C$DW$140, DW_AT_name("PIEACK")
    1478                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEACK")
    1479                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1480                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$141       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$25)
    1484                      .dwattr $C$DW$141, DW_AT_name("PIEIER1")
    1485                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PIEIER1")
    1486                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1487                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$142       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    1491                      .dwattr $C$DW$142, DW_AT_name("PIEIFR1")
    1492                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PIEIFR1")
    1493                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1494                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$143       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    1498                      .dwattr $C$DW$143, DW_AT_name("PIEIER2")
    1499                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PIEIER2")
    1500                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1501                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$144       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    1505                      .dwattr $C$DW$144, DW_AT_name("PIEIFR2")
    1506                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEIFR2")
    1507                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1508                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$145       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$25)
    1512                      .dwattr $C$DW$145, DW_AT_name("PIEIER3")
    1513                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIEIER3")
    1514                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1515                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$146       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   31

    1518                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    1519                      .dwattr $C$DW$146, DW_AT_name("PIEIFR3")
    1520                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIEIFR3")
    1521                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1522                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$147       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    1526                      .dwattr $C$DW$147, DW_AT_name("PIEIER4")
    1527                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIEIER4")
    1528                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1529                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$148       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    1533                      .dwattr $C$DW$148, DW_AT_name("PIEIFR4")
    1534                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PIEIFR4")
    1535                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1536                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$149       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$25)
    1540                      .dwattr $C$DW$149, DW_AT_name("PIEIER5")
    1541                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PIEIER5")
    1542                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1543                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$150       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    1547                      .dwattr $C$DW$150, DW_AT_name("PIEIFR5")
    1548                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PIEIFR5")
    1549                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1550                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$151       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$25)
    1554                      .dwattr $C$DW$151, DW_AT_name("PIEIER6")
    1555                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PIEIER6")
    1556                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1557                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$152       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    1561                      .dwattr $C$DW$152, DW_AT_name("PIEIFR6")
    1562                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PIEIFR6")
    1563                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1564                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$153       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$25)
    1568                      .dwattr $C$DW$153, DW_AT_name("PIEIER7")
    1569                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PIEIER7")
    1570                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1571                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1572              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   32

    1573              $C$DW$154       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    1575                      .dwattr $C$DW$154, DW_AT_name("PIEIFR7")
    1576                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PIEIFR7")
    1577                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1578                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580              $C$DW$155       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$25)
    1582                      .dwattr $C$DW$155, DW_AT_name("PIEIER8")
    1583                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PIEIER8")
    1584                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1585                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$156       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    1589                      .dwattr $C$DW$156, DW_AT_name("PIEIFR8")
    1590                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PIEIFR8")
    1591                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1592                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1593              
    1594              $C$DW$157       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$25)
    1596                      .dwattr $C$DW$157, DW_AT_name("PIEIER9")
    1597                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PIEIER9")
    1598                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1599                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$158       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    1603                      .dwattr $C$DW$158, DW_AT_name("PIEIFR9")
    1604                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PIEIFR9")
    1605                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1606                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1607              
    1608              $C$DW$159       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$25)
    1610                      .dwattr $C$DW$159, DW_AT_name("PIEIER10")
    1611                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PIEIER10")
    1612                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1613                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$160       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    1617                      .dwattr $C$DW$160, DW_AT_name("PIEIFR10")
    1618                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PIEIFR10")
    1619                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1620                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1621              
    1622              $C$DW$161       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$25)
    1624                      .dwattr $C$DW$161, DW_AT_name("PIEIER11")
    1625                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PIEIER11")
    1626                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1627                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   33

    1628              
    1629              $C$DW$162       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    1631                      .dwattr $C$DW$162, DW_AT_name("PIEIFR11")
    1632                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PIEIFR11")
    1633                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1634                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$163       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$25)
    1638                      .dwattr $C$DW$163, DW_AT_name("PIEIER12")
    1639                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PIEIER12")
    1640                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1641                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$164       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    1645                      .dwattr $C$DW$164, DW_AT_name("PIEIFR12")
    1646                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEIFR12")
    1647                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1648                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650                      .dwendtag $C$DW$T$28
    1651              
    1652              $C$DW$165       .dwtag  DW_TAG_TI_far_type
    1653                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
    1654              
    1655              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1656                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$165)
    1657              
    1658              
    1659              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1660                      .dwattr $C$DW$T$32, DW_AT_name("PIE_VECT_TABLE")
    1661                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x100)
    1662              $C$DW$166       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    1664                      .dwattr $C$DW$166, DW_AT_name("PIE1_RESERVED")
    1665                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PIE1_RESERVED")
    1666                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$167       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    1671                      .dwattr $C$DW$167, DW_AT_name("PIE2_RESERVED")
    1672                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PIE2_RESERVED")
    1673                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1674                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$168       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1678                      .dwattr $C$DW$168, DW_AT_name("PIE3_RESERVED")
    1679                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PIE3_RESERVED")
    1680                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1681                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1682              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   34

    1683              $C$DW$169       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
    1685                      .dwattr $C$DW$169, DW_AT_name("PIE4_RESERVED")
    1686                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PIE4_RESERVED")
    1687                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1688                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$170       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
    1692                      .dwattr $C$DW$170, DW_AT_name("PIE5_RESERVED")
    1693                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PIE5_RESERVED")
    1694                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1695                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697              $C$DW$171       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    1699                      .dwattr $C$DW$171, DW_AT_name("PIE6_RESERVED")
    1700                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PIE6_RESERVED")
    1701                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1702                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$172       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    1706                      .dwattr $C$DW$172, DW_AT_name("PIE7_RESERVED")
    1707                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PIE7_RESERVED")
    1708                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1709                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$173       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    1713                      .dwattr $C$DW$173, DW_AT_name("PIE8_RESERVED")
    1714                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PIE8_RESERVED")
    1715                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1716                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$174       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    1720                      .dwattr $C$DW$174, DW_AT_name("PIE9_RESERVED")
    1721                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PIE9_RESERVED")
    1722                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1723                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$175       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    1727                      .dwattr $C$DW$175, DW_AT_name("PIE10_RESERVED")
    1728                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PIE10_RESERVED")
    1729                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1730                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$176       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    1734                      .dwattr $C$DW$176, DW_AT_name("PIE11_RESERVED")
    1735                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PIE11_RESERVED")
    1736                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1737                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   35

    1738              
    1739              $C$DW$177       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1741                      .dwattr $C$DW$177, DW_AT_name("PIE12_RESERVED")
    1742                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PIE12_RESERVED")
    1743                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1744                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746              $C$DW$178       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1748                      .dwattr $C$DW$178, DW_AT_name("PIE13_RESERVED")
    1749                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PIE13_RESERVED")
    1750                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1751                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$179       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    1755                      .dwattr $C$DW$179, DW_AT_name("TINT1")
    1756                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_TINT1")
    1757                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1758                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$180       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1762                      .dwattr $C$DW$180, DW_AT_name("TINT2")
    1763                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_TINT2")
    1764                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1765                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767              $C$DW$181       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    1769                      .dwattr $C$DW$181, DW_AT_name("DATALOG")
    1770                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DATALOG")
    1771                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1772                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$182       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1776                      .dwattr $C$DW$182, DW_AT_name("RTOSINT")
    1777                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RTOSINT")
    1778                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1779                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$183       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1783                      .dwattr $C$DW$183, DW_AT_name("EMUINT")
    1784                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_EMUINT")
    1785                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1786                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$184       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1790                      .dwattr $C$DW$184, DW_AT_name("NMI")
    1791                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_NMI")
    1792                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   36

    1793                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1794              
    1795              $C$DW$185       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    1797                      .dwattr $C$DW$185, DW_AT_name("ILLEGAL")
    1798                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ILLEGAL")
    1799                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1800                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$186       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1804                      .dwattr $C$DW$186, DW_AT_name("USER1")
    1805                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_USER1")
    1806                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1807                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809              $C$DW$187       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1811                      .dwattr $C$DW$187, DW_AT_name("USER2")
    1812                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_USER2")
    1813                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1814                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$188       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1818                      .dwattr $C$DW$188, DW_AT_name("USER3")
    1819                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_USER3")
    1820                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1821                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$189       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1825                      .dwattr $C$DW$189, DW_AT_name("USER4")
    1826                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_USER4")
    1827                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1828                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$190       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1832                      .dwattr $C$DW$190, DW_AT_name("USER5")
    1833                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_USER5")
    1834                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1835                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$191       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    1839                      .dwattr $C$DW$191, DW_AT_name("USER6")
    1840                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_USER6")
    1841                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1842                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$192       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$31)
    1846                      .dwattr $C$DW$192, DW_AT_name("USER7")
    1847                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_USER7")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   37

    1848                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1849                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$193       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
    1853                      .dwattr $C$DW$193, DW_AT_name("USER8")
    1854                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_USER8")
    1855                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1856                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1857              
    1858              $C$DW$194       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
    1860                      .dwattr $C$DW$194, DW_AT_name("USER9")
    1861                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_USER9")
    1862                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1863                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$195       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
    1867                      .dwattr $C$DW$195, DW_AT_name("USER10")
    1868                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_USER10")
    1869                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1870                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$196       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$31)
    1874                      .dwattr $C$DW$196, DW_AT_name("USER11")
    1875                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_USER11")
    1876                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1877                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879              $C$DW$197       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$31)
    1881                      .dwattr $C$DW$197, DW_AT_name("USER12")
    1882                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_USER12")
    1883                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1884                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$198       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$31)
    1888                      .dwattr $C$DW$198, DW_AT_name("ADCINT1")
    1889                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_ADCINT1")
    1890                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1891                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893              $C$DW$199       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$31)
    1895                      .dwattr $C$DW$199, DW_AT_name("ADCINT2")
    1896                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_ADCINT2")
    1897                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1898                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$200       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
    1902                      .dwattr $C$DW$200, DW_AT_name("rsvd1_3")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   38

    1903                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd1_3")
    1904                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1905                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1906              
    1907              $C$DW$201       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$31)
    1909                      .dwattr $C$DW$201, DW_AT_name("XINT1")
    1910                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_XINT1")
    1911                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1912                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1913              
    1914              $C$DW$202       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
    1916                      .dwattr $C$DW$202, DW_AT_name("XINT2")
    1917                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_XINT2")
    1918                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1919                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1920              
    1921              $C$DW$203       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    1923                      .dwattr $C$DW$203, DW_AT_name("ADCINT9")
    1924                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ADCINT9")
    1925                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1926                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$204       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    1930                      .dwattr $C$DW$204, DW_AT_name("TINT0")
    1931                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_TINT0")
    1932                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1933                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1934              
    1935              $C$DW$205       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
    1937                      .dwattr $C$DW$205, DW_AT_name("WAKEINT")
    1938                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_WAKEINT")
    1939                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1940                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1941              
    1942              $C$DW$206       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    1944                      .dwattr $C$DW$206, DW_AT_name("EPWM1_TZINT")
    1945                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    1946                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1947                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$207       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
    1951                      .dwattr $C$DW$207, DW_AT_name("EPWM2_TZINT")
    1952                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    1953                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1954                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956              $C$DW$208       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   39

    1958                      .dwattr $C$DW$208, DW_AT_name("EPWM3_TZINT")
    1959                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    1960                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1961                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1962              
    1963              $C$DW$209       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    1965                      .dwattr $C$DW$209, DW_AT_name("EPWM4_TZINT")
    1966                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    1967                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1968                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1969              
    1970              $C$DW$210       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$31)
    1972                      .dwattr $C$DW$210, DW_AT_name("EPWM5_TZINT")
    1973                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    1974                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1975                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1976              
    1977              $C$DW$211       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1979                      .dwattr $C$DW$211, DW_AT_name("EPWM6_TZINT")
    1980                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    1981                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1982                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1983              
    1984              $C$DW$212       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    1986                      .dwattr $C$DW$212, DW_AT_name("EPWM7_TZINT")
    1987                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_EPWM7_TZINT")
    1988                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1989                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1990              
    1991              $C$DW$213       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
    1993                      .dwattr $C$DW$213, DW_AT_name("EPWM8_TZINT")
    1994                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_EPWM8_TZINT")
    1995                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1996                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1997              
    1998              $C$DW$214       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$31)
    2000                      .dwattr $C$DW$214, DW_AT_name("EPWM1_INT")
    2001                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_EPWM1_INT")
    2002                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2003                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$215       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
    2007                      .dwattr $C$DW$215, DW_AT_name("EPWM2_INT")
    2008                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_EPWM2_INT")
    2009                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2010                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$216       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   40

    2013                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
    2014                      .dwattr $C$DW$216, DW_AT_name("EPWM3_INT")
    2015                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_EPWM3_INT")
    2016                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2017                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$217       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$31)
    2021                      .dwattr $C$DW$217, DW_AT_name("EPWM4_INT")
    2022                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_EPWM4_INT")
    2023                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2024                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$218       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    2028                      .dwattr $C$DW$218, DW_AT_name("EPWM5_INT")
    2029                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_EPWM5_INT")
    2030                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2031                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$219       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$31)
    2035                      .dwattr $C$DW$219, DW_AT_name("EPWM6_INT")
    2036                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_EPWM6_INT")
    2037                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2038                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$220       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$31)
    2042                      .dwattr $C$DW$220, DW_AT_name("EPWM7_INT")
    2043                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_EPWM7_INT")
    2044                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2045                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047              $C$DW$221       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
    2049                      .dwattr $C$DW$221, DW_AT_name("EPWM8_INT")
    2050                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_EPWM8_INT")
    2051                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2052                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054              $C$DW$222       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    2056                      .dwattr $C$DW$222, DW_AT_name("ECAP1_INT")
    2057                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ECAP1_INT")
    2058                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2059                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$223       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
    2063                      .dwattr $C$DW$223, DW_AT_name("ECAP2_INT")
    2064                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_ECAP2_INT")
    2065                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2066                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2067              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   41

    2068              $C$DW$224       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    2070                      .dwattr $C$DW$224, DW_AT_name("ECAP3_INT")
    2071                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_ECAP3_INT")
    2072                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2073                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$225       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
    2077                      .dwattr $C$DW$225, DW_AT_name("rsvd4_4")
    2078                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd4_4")
    2079                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2080                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2081              
    2082              $C$DW$226       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$31)
    2084                      .dwattr $C$DW$226, DW_AT_name("rsvd4_5")
    2085                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd4_5")
    2086                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2087                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089              $C$DW$227       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
    2091                      .dwattr $C$DW$227, DW_AT_name("rsvd4_6")
    2092                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd4_6")
    2093                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2094                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2095              
    2096              $C$DW$228       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
    2098                      .dwattr $C$DW$228, DW_AT_name("HRCAP1_INT")
    2099                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_HRCAP1_INT")
    2100                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2101                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2102              
    2103              $C$DW$229       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
    2105                      .dwattr $C$DW$229, DW_AT_name("HRCAP2_INT")
    2106                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_HRCAP2_INT")
    2107                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2108                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$230       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
    2112                      .dwattr $C$DW$230, DW_AT_name("EQEP1_INT")
    2113                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_EQEP1_INT")
    2114                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2115                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2116              
    2117              $C$DW$231       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$31)
    2119                      .dwattr $C$DW$231, DW_AT_name("EQEP2_INT")
    2120                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_EQEP2_INT")
    2121                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2122                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   42

    2123              
    2124              $C$DW$232       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
    2126                      .dwattr $C$DW$232, DW_AT_name("rsvd5_3")
    2127                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd5_3")
    2128                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2129                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2130              
    2131              $C$DW$233       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    2133                      .dwattr $C$DW$233, DW_AT_name("HRCAP3_INT")
    2134                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_HRCAP3_INT")
    2135                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2136                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$234       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$31)
    2140                      .dwattr $C$DW$234, DW_AT_name("HRCAP4_INT")
    2141                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_HRCAP4_INT")
    2142                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2143                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2144              
    2145              $C$DW$235       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$31)
    2147                      .dwattr $C$DW$235, DW_AT_name("rsvd5_6")
    2148                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd5_6")
    2149                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2150                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2151              
    2152              $C$DW$236       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
    2154                      .dwattr $C$DW$236, DW_AT_name("rsvd5_7")
    2155                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd5_7")
    2156                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2157                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2158              
    2159              $C$DW$237       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$31)
    2161                      .dwattr $C$DW$237, DW_AT_name("USB0_INT")
    2162                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_USB0_INT")
    2163                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2164                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166              $C$DW$238       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$31)
    2168                      .dwattr $C$DW$238, DW_AT_name("SPIRXINTA")
    2169                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_SPIRXINTA")
    2170                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2171                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$239       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    2175                      .dwattr $C$DW$239, DW_AT_name("SPITXINTA")
    2176                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_SPITXINTA")
    2177                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   43

    2178                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2179              
    2180              $C$DW$240       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    2182                      .dwattr $C$DW$240, DW_AT_name("SPIRXINTB")
    2183                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_SPIRXINTB")
    2184                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2185                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2186              
    2187              $C$DW$241       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    2189                      .dwattr $C$DW$241, DW_AT_name("SPITXINTB")
    2190                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_SPITXINTB")
    2191                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2192                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$242       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    2196                      .dwattr $C$DW$242, DW_AT_name("MRINTA")
    2197                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_MRINTA")
    2198                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2199                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2200              
    2201              $C$DW$243       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    2203                      .dwattr $C$DW$243, DW_AT_name("MXINTA")
    2204                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_MXINTA")
    2205                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2206                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2207              
    2208              $C$DW$244       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
    2210                      .dwattr $C$DW$244, DW_AT_name("rsvd6_7")
    2211                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd6_7")
    2212                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2213                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$245       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
    2217                      .dwattr $C$DW$245, DW_AT_name("rsvd6_8")
    2218                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd6_8")
    2219                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2220                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$246       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$31)
    2224                      .dwattr $C$DW$246, DW_AT_name("DINTCH1")
    2225                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DINTCH1")
    2226                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2227                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229              $C$DW$247       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
    2231                      .dwattr $C$DW$247, DW_AT_name("DINTCH2")
    2232                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DINTCH2")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   44

    2233                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2234                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$248       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$31)
    2238                      .dwattr $C$DW$248, DW_AT_name("DINTCH3")
    2239                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DINTCH3")
    2240                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2241                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2242              
    2243              $C$DW$249       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$31)
    2245                      .dwattr $C$DW$249, DW_AT_name("DINTCH4")
    2246                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DINTCH4")
    2247                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2248                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250              $C$DW$250       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$31)
    2252                      .dwattr $C$DW$250, DW_AT_name("DINTCH5")
    2253                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DINTCH5")
    2254                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2255                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257              $C$DW$251       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$31)
    2259                      .dwattr $C$DW$251, DW_AT_name("DINTCH6")
    2260                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DINTCH6")
    2261                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2262                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2263              
    2264              $C$DW$252       .dwtag  DW_TAG_member
    2265                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$31)
    2266                      .dwattr $C$DW$252, DW_AT_name("rsvd7_7")
    2267                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd7_7")
    2268                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2269                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$253       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$31)
    2273                      .dwattr $C$DW$253, DW_AT_name("rsvd7_8")
    2274                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_rsvd7_8")
    2275                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2276                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2277              
    2278              $C$DW$254       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$31)
    2280                      .dwattr $C$DW$254, DW_AT_name("I2CINT1A")
    2281                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_I2CINT1A")
    2282                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2283                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2284              
    2285              $C$DW$255       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$31)
    2287                      .dwattr $C$DW$255, DW_AT_name("I2CINT2A")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:15 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
F2806x_PieVect.asm                                                   PAGE   45

    2288                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_I2CINT2A")
    2289                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2290                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2291              
    2292              $C$DW$256       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$31)
    2294                      .dwattr $C$DW$256, DW_AT_name("rsvd8_3")
    2295                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd8_3")
    2296                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2297                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2298              
    2299              $C$DW$257       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$31)
    2301                      .dwattr $C$DW$257, DW_AT_name("rsvd8_4")
    2302                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd8_4")
    2303                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2304                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2305              
    2306              $C$DW$258       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$31)
    2308                      .dwattr $C$DW$258, DW_AT_name("rsvd8_5")
    2309                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd8_5")
    2310                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2311                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2312              
    2313              $C$DW$259       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$31)
    2315                      .dwattr $C$DW$259, DW_AT_name("rsvd8_6")
    2316                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd8_6")
    2317                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2318                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2319              
    2320              $C$DW$260       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$31)
    2322                      .dwattr $C$DW$260, DW_AT_name("rsvd8_7")
    2323                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd8_7")
    2324                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2325                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2326              
    2327              $C$DW$261       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
