TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 22:15:12 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initEPWM.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SysCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SysCtrlRegs")

      69 00000008 DC0C          ADDB      XAR4,#12              ; [CPU_] |21| 
      70                      .dwpsn  file "../source/initEPWM.c",line 19,column 4,is_stmt,isa 0
      71 00000009 DD0D          ADDB      XAR5,#13              ; [CPU_] |19| 
      72 0000000a 1AC5          OR        *+XAR5[0],#0x0004     ; [CPU_] |19| 
         0000000b 0004 
      73                      .dwpsn  file "../source/initEPWM.c",line 21,column 4,is_stmt,isa 0
      74 0000000c 18C4          AND       *+XAR4[0],#0xfffb     ; [CPU_] |21| 
         0000000d FFFB 
      75                      .dwpsn  file "../source/initEPWM.c",line 23,column 4,is_stmt,isa 0
      76 0000000e CCC6          AND       AL,*+XAR6[0],#0xfcff  ; [CPU_] |23| 
         0000000f FCFF 
      77                      .dwpsn  file "../source/initEPWM.c",line 38,column 4,is_stmt,isa 0
      78 00000010 8AA6          MOVL      XAR4,XAR6             ; [CPU_] |38| 
      79                      .dwpsn  file "../source/initEPWM.c",line 23,column 4,is_stmt,isa 0
      80 00000011 5080          ORB       AL,#0x80              ; [CPU_] |23| 
      81 00000012 96C6          MOV       *+XAR6[0],AL          ; [CPU_] |23| 
      82                      .dwpsn  file "../source/initEPWM.c",line 24,column 4,is_stmt,isa 0
      83 00000013 18C6          AND       *+XAR6[0],#0xe3ff     ; [CPU_] |24| 
         00000014 E3FF 
      84                      .dwpsn  file "../source/initEPWM.c",line 38,column 4,is_stmt,isa 0
      85 00000015 DC0B          ADDB      XAR4,#11              ; [CPU_] |38| 
      86                      .dwpsn  file "../source/initEPWM.c",line 29,column 4,is_stmt,isa 0
      87 00000016 CCC6          AND       AL,*+XAR6[0],#0xefff  ; [CPU_] |29| 
         00000017 EFFF 
      88 00000018 1AA9          OR        AL,#0x0c00            ; [CPU_] |29| 
         00000019 0C00 
      89 0000001a 96C6          MOV       *+XAR6[0],AL          ; [CPU_] |29| 
      90                      .dwpsn  file "../source/initEPWM.c",line 30,column 4,is_stmt,isa 0
      91 0000001b CCC6          AND       AL,*+XAR6[0],#0xfdff  ; [CPU_] |30| 
         0000001c FDFF 
      92 0000001d 1AA9          OR        AL,#0x0180            ; [CPU_] |30| 
         0000001e 0180 
      93 0000001f 96C6          MOV       *+XAR6[0],AL          ; [CPU_] |30| 
      94                      .dwpsn  file "../source/initEPWM.c",line 32,column 4,is_stmt,isa 0
      95 00000020 2805!         MOV       @_EPwm3Regs+5,#60000  ; [CPU_] |32| 
         00000021 EA60 
      96                      .dwpsn  file "../source/initEPWM.c",line 35,column 4,is_stmt,isa 0
      97 00000022 2B04!         MOV       @_EPwm3Regs+4,#0      ; [CPU_] |35| 
      98 00000023 761F!         MOVW      DP,#_SysCtrlRegs+12   ; [CPU_U] 
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    3

         00000024 0000 
      99                      .dwpsn  file "../source/initEPWM.c",line 36,column 4,is_stmt,isa 0
     100 00000025 CCC6          AND       AL,*+XAR6[0],#0xfffe  ; [CPU_] |36| 
         00000026 FFFE 
     101 00000027 5002          ORB       AL,#0x02              ; [CPU_] |36| 
     102 00000028 96C6          MOV       *+XAR6[0],AL          ; [CPU_] |36| 
     103                      .dwpsn  file "../source/initEPWM.c",line 38,column 4,is_stmt,isa 0
     104 00000029 1AC4          OR        *+XAR4[0],#0x000c     ; [CPU_] |38| 
         0000002a 000C 
     105                      .dwpsn  file "../source/initEPWM.c",line 39,column 4,is_stmt,isa 0
     106 0000002b 1A0C!         OR        @_SysCtrlRegs+12,#0x0004 ; [CPU_] |39| 
         0000002c 0004 
     107                      .dwpsn  file "../source/initEPWM.c",line 45,column 4,is_stmt,isa 0
     108 0000002d 1A0C!         OR        @_SysCtrlRegs+12,#0x0004 ; [CPU_] |45| 
         0000002e 0004 
     109 0000002f 761A   EDIS
     110 00000030 FF69          SPM       #0                    ; [CPU_] 
     111              $C$DW$4 .dwtag  DW_TAG_TI_branch
     112                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
     113                      .dwattr $C$DW$4, DW_AT_TI_return
     114              
     115 00000031 0006          LRETR     ; [CPU_] 
     116                      ; return occurs ; [] 
     117                      .dwattr $C$DW$3, DW_AT_TI_end_file("../source/initEPWM.c")
     118                      .dwattr $C$DW$3, DW_AT_TI_end_line(0x31)
     119                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     120                      .dwendentry
     121                      .dwendtag $C$DW$3
     122              
     123              ;**************************************************************
     124              ;* UNDEFINED EXTERNAL REFERENCES                              *
     125              ;**************************************************************
     126                      .global _SysCtrlRegs
     127                      .global _EPwm3Regs
     128              
     129              ;***************************************************************
     130              ;* TYPE INFORMATION                                            *
     131              ;***************************************************************
     132              
     133              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     134                      .dwattr $C$DW$T$20, DW_AT_name("AQCSFRC_BITS")
     135                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     136              $C$DW$5 .dwtag  DW_TAG_member
     137                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     138                      .dwattr $C$DW$5, DW_AT_name("CSFA")
     139                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_CSFA")
     140                      .dwattr $C$DW$5, DW_AT_bit_offset(0x0e)
     141                      .dwattr $C$DW$5, DW_AT_bit_size(0x02)
     142                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     143                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     144              
     145              $C$DW$6 .dwtag  DW_TAG_member
     146                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     147                      .dwattr $C$DW$6, DW_AT_name("CSFB")
     148                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_CSFB")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    4

     149                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0c)
     150                      .dwattr $C$DW$6, DW_AT_bit_size(0x02)
     151                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     152                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     153              
     154              $C$DW$7 .dwtag  DW_TAG_member
     155                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     156                      .dwattr $C$DW$7, DW_AT_name("rsvd1")
     157                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_rsvd1")
     158                      .dwattr $C$DW$7, DW_AT_bit_offset(0x00)
     159                      .dwattr $C$DW$7, DW_AT_bit_size(0x0c)
     160                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     161                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     162              
     163                      .dwendtag $C$DW$T$20
     164              
     165              
     166              $C$DW$T$21      .dwtag  DW_TAG_union_type
     167                      .dwattr $C$DW$T$21, DW_AT_name("AQCSFRC_REG")
     168                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     169              $C$DW$8 .dwtag  DW_TAG_member
     170                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     171                      .dwattr $C$DW$8, DW_AT_name("all")
     172                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_all")
     173                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     174                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     175              
     176              $C$DW$9 .dwtag  DW_TAG_member
     177                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     178                      .dwattr $C$DW$9, DW_AT_name("bit")
     179                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_bit")
     180                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     181                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     182              
     183                      .dwendtag $C$DW$T$21
     184              
     185              
     186              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     187                      .dwattr $C$DW$T$22, DW_AT_name("AQCTL_BITS")
     188                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     189              $C$DW$10        .dwtag  DW_TAG_member
     190                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     191                      .dwattr $C$DW$10, DW_AT_name("ZRO")
     192                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_ZRO")
     193                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0e)
     194                      .dwattr $C$DW$10, DW_AT_bit_size(0x02)
     195                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     196                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     197              
     198              $C$DW$11        .dwtag  DW_TAG_member
     199                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     200                      .dwattr $C$DW$11, DW_AT_name("PRD")
     201                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_PRD")
     202                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0c)
     203                      .dwattr $C$DW$11, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    5

     204                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     205                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     206              
     207              $C$DW$12        .dwtag  DW_TAG_member
     208                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     209                      .dwattr $C$DW$12, DW_AT_name("CAU")
     210                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_CAU")
     211                      .dwattr $C$DW$12, DW_AT_bit_offset(0x0a)
     212                      .dwattr $C$DW$12, DW_AT_bit_size(0x02)
     213                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     214                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     215              
     216              $C$DW$13        .dwtag  DW_TAG_member
     217                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     218                      .dwattr $C$DW$13, DW_AT_name("CAD")
     219                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_CAD")
     220                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     221                      .dwattr $C$DW$13, DW_AT_bit_size(0x02)
     222                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     223                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     224              
     225              $C$DW$14        .dwtag  DW_TAG_member
     226                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     227                      .dwattr $C$DW$14, DW_AT_name("CBU")
     228                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_CBU")
     229                      .dwattr $C$DW$14, DW_AT_bit_offset(0x06)
     230                      .dwattr $C$DW$14, DW_AT_bit_size(0x02)
     231                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     232                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     233              
     234              $C$DW$15        .dwtag  DW_TAG_member
     235                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     236                      .dwattr $C$DW$15, DW_AT_name("CBD")
     237                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_CBD")
     238                      .dwattr $C$DW$15, DW_AT_bit_offset(0x04)
     239                      .dwattr $C$DW$15, DW_AT_bit_size(0x02)
     240                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     241                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     242              
     243              $C$DW$16        .dwtag  DW_TAG_member
     244                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     245                      .dwattr $C$DW$16, DW_AT_name("rsvd1")
     246                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_rsvd1")
     247                      .dwattr $C$DW$16, DW_AT_bit_offset(0x00)
     248                      .dwattr $C$DW$16, DW_AT_bit_size(0x04)
     249                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     250                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     251              
     252                      .dwendtag $C$DW$T$22
     253              
     254              
     255              $C$DW$T$23      .dwtag  DW_TAG_union_type
     256                      .dwattr $C$DW$T$23, DW_AT_name("AQCTL_REG")
     257                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     258              $C$DW$17        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    6

     259                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     260                      .dwattr $C$DW$17, DW_AT_name("all")
     261                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_all")
     262                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     263                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     264              
     265              $C$DW$18        .dwtag  DW_TAG_member
     266                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$22)
     267                      .dwattr $C$DW$18, DW_AT_name("bit")
     268                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_bit")
     269                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     270                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     271              
     272                      .dwendtag $C$DW$T$23
     273              
     274              
     275              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     276                      .dwattr $C$DW$T$24, DW_AT_name("AQSFRC_BITS")
     277                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     278              $C$DW$19        .dwtag  DW_TAG_member
     279                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     280                      .dwattr $C$DW$19, DW_AT_name("ACTSFA")
     281                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_ACTSFA")
     282                      .dwattr $C$DW$19, DW_AT_bit_offset(0x0e)
     283                      .dwattr $C$DW$19, DW_AT_bit_size(0x02)
     284                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     285                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     286              
     287              $C$DW$20        .dwtag  DW_TAG_member
     288                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     289                      .dwattr $C$DW$20, DW_AT_name("OTSFA")
     290                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_OTSFA")
     291                      .dwattr $C$DW$20, DW_AT_bit_offset(0x0d)
     292                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     293                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     294                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     295              
     296              $C$DW$21        .dwtag  DW_TAG_member
     297                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     298                      .dwattr $C$DW$21, DW_AT_name("ACTSFB")
     299                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_ACTSFB")
     300                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0b)
     301                      .dwattr $C$DW$21, DW_AT_bit_size(0x02)
     302                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     303                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     304              
     305              $C$DW$22        .dwtag  DW_TAG_member
     306                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     307                      .dwattr $C$DW$22, DW_AT_name("OTSFB")
     308                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_OTSFB")
     309                      .dwattr $C$DW$22, DW_AT_bit_offset(0x0a)
     310                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     311                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     312                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     313              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    7

     314              $C$DW$23        .dwtag  DW_TAG_member
     315                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     316                      .dwattr $C$DW$23, DW_AT_name("RLDCSF")
     317                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_RLDCSF")
     318                      .dwattr $C$DW$23, DW_AT_bit_offset(0x08)
     319                      .dwattr $C$DW$23, DW_AT_bit_size(0x02)
     320                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     321                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     322              
     323              $C$DW$24        .dwtag  DW_TAG_member
     324                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     325                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     326                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     327                      .dwattr $C$DW$24, DW_AT_bit_offset(0x00)
     328                      .dwattr $C$DW$24, DW_AT_bit_size(0x08)
     329                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     331              
     332                      .dwendtag $C$DW$T$24
     333              
     334              
     335              $C$DW$T$25      .dwtag  DW_TAG_union_type
     336                      .dwattr $C$DW$T$25, DW_AT_name("AQSFRC_REG")
     337                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     338              $C$DW$25        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     340                      .dwattr $C$DW$25, DW_AT_name("all")
     341                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_all")
     342                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     343                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     344              
     345              $C$DW$26        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$24)
     347                      .dwattr $C$DW$26, DW_AT_name("bit")
     348                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_bit")
     349                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     350                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     351              
     352                      .dwendtag $C$DW$T$25
     353              
     354              
     355              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     356                      .dwattr $C$DW$T$26, DW_AT_name("CLKCTL_BITS")
     357                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     358              $C$DW$27        .dwtag  DW_TAG_member
     359                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     360                      .dwattr $C$DW$27, DW_AT_name("OSCCLKSRCSEL")
     361                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     362                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0f)
     363                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     364                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     365                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     366              
     367              $C$DW$28        .dwtag  DW_TAG_member
     368                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    8

     369                      .dwattr $C$DW$28, DW_AT_name("OSCCLKSRC2SEL")
     370                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     371                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0e)
     372                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     373                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     374                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     375              
     376              $C$DW$29        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     378                      .dwattr $C$DW$29, DW_AT_name("WDCLKSRCSEL")
     379                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     380                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0d)
     381                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     382                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     384              
     385              $C$DW$30        .dwtag  DW_TAG_member
     386                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     387                      .dwattr $C$DW$30, DW_AT_name("TMR2CLKSRCSEL")
     388                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     389                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b)
     390                      .dwattr $C$DW$30, DW_AT_bit_size(0x02)
     391                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     392                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     393              
     394              $C$DW$31        .dwtag  DW_TAG_member
     395                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     396                      .dwattr $C$DW$31, DW_AT_name("TMR2CLKPRESCALE")
     397                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     398                      .dwattr $C$DW$31, DW_AT_bit_offset(0x08)
     399                      .dwattr $C$DW$31, DW_AT_bit_size(0x03)
     400                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     401                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     402              
     403              $C$DW$32        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     405                      .dwattr $C$DW$32, DW_AT_name("INTOSC1OFF")
     406                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_INTOSC1OFF")
     407                      .dwattr $C$DW$32, DW_AT_bit_offset(0x07)
     408                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     409                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     410                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     411              
     412              $C$DW$33        .dwtag  DW_TAG_member
     413                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     414                      .dwattr $C$DW$33, DW_AT_name("INTOSC1HALTI")
     415                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     416                      .dwattr $C$DW$33, DW_AT_bit_offset(0x06)
     417                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     418                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     419                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     420              
     421              $C$DW$34        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     423                      .dwattr $C$DW$34, DW_AT_name("INTOSC2OFF")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE    9

     424                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_INTOSC2OFF")
     425                      .dwattr $C$DW$34, DW_AT_bit_offset(0x05)
     426                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     427                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     428                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     429              
     430              $C$DW$35        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     432                      .dwattr $C$DW$35, DW_AT_name("INTOSC2HALTI")
     433                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     434                      .dwattr $C$DW$35, DW_AT_bit_offset(0x04)
     435                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     436                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     437                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     438              
     439              $C$DW$36        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     441                      .dwattr $C$DW$36, DW_AT_name("WDHALTI")
     442                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_WDHALTI")
     443                      .dwattr $C$DW$36, DW_AT_bit_offset(0x03)
     444                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     445                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     446                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     447              
     448              $C$DW$37        .dwtag  DW_TAG_member
     449                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     450                      .dwattr $C$DW$37, DW_AT_name("XCLKINOFF")
     451                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_XCLKINOFF")
     452                      .dwattr $C$DW$37, DW_AT_bit_offset(0x02)
     453                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     454                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     455                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     456              
     457              $C$DW$38        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$38, DW_AT_name("XTALOSCOFF")
     460                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_XTALOSCOFF")
     461                      .dwattr $C$DW$38, DW_AT_bit_offset(0x01)
     462                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     463                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     465              
     466              $C$DW$39        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     468                      .dwattr $C$DW$39, DW_AT_name("NMIRESETSEL")
     469                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_NMIRESETSEL")
     470                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
     471                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     472                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     473                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     474              
     475                      .dwendtag $C$DW$T$26
     476              
     477              
     478              $C$DW$T$27      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   10

     479                      .dwattr $C$DW$T$27, DW_AT_name("CLKCTL_REG")
     480                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     481              $C$DW$40        .dwtag  DW_TAG_member
     482                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     483                      .dwattr $C$DW$40, DW_AT_name("all")
     484                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
     485                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     486                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     487              
     488              $C$DW$41        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$26)
     490                      .dwattr $C$DW$41, DW_AT_name("bit")
     491                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
     492                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495                      .dwendtag $C$DW$T$27
     496              
     497              
     498              $C$DW$T$29      .dwtag  DW_TAG_union_type
     499                      .dwattr $C$DW$T$29, DW_AT_name("CMPA_HRPWM_GROUP")
     500                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     501              $C$DW$42        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$28)
     503                      .dwattr $C$DW$42, DW_AT_name("all")
     504                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     505                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     506                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     507              
     508              $C$DW$43        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$30)
     510                      .dwattr $C$DW$43, DW_AT_name("half")
     511                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_half")
     512                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     514              
     515                      .dwendtag $C$DW$T$29
     516              
     517              
     518              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     519                      .dwattr $C$DW$T$30, DW_AT_name("CMPA_HRPWM_REG")
     520                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     521              $C$DW$44        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     523                      .dwattr $C$DW$44, DW_AT_name("CMPAHR")
     524                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_CMPAHR")
     525                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     526                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     527              
     528              $C$DW$45        .dwtag  DW_TAG_member
     529                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     530                      .dwattr $C$DW$45, DW_AT_name("CMPA")
     531                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_CMPA")
     532                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     533                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   11

     534              
     535                      .dwendtag $C$DW$T$30
     536              
     537              
     538              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     539                      .dwattr $C$DW$T$31, DW_AT_name("CMPCTL_BITS")
     540                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     541              $C$DW$46        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$46, DW_AT_name("LOADAMODE")
     544                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_LOADAMODE")
     545                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0e)
     546                      .dwattr $C$DW$46, DW_AT_bit_size(0x02)
     547                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     548                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     549              
     550              $C$DW$47        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     552                      .dwattr $C$DW$47, DW_AT_name("LOADBMODE")
     553                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_LOADBMODE")
     554                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0c)
     555                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     556                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559              $C$DW$48        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     561                      .dwattr $C$DW$48, DW_AT_name("SHDWAMODE")
     562                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_SHDWAMODE")
     563                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0b)
     564                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     565                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568              $C$DW$49        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$49, DW_AT_name("rsvd1")
     571                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd1")
     572                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0a)
     573                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     574                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     576              
     577              $C$DW$50        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$50, DW_AT_name("SHDWBMODE")
     580                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_SHDWBMODE")
     581                      .dwattr $C$DW$50, DW_AT_bit_offset(0x09)
     582                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     583                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$51        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$51, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   12

     589                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd2")
     590                      .dwattr $C$DW$51, DW_AT_bit_offset(0x08)
     591                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     592                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     594              
     595              $C$DW$52        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$52, DW_AT_name("SHDWAFULL")
     598                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SHDWAFULL")
     599                      .dwattr $C$DW$52, DW_AT_bit_offset(0x07)
     600                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     603              
     604              $C$DW$53        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     606                      .dwattr $C$DW$53, DW_AT_name("SHDWBFULL")
     607                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_SHDWBFULL")
     608                      .dwattr $C$DW$53, DW_AT_bit_offset(0x06)
     609                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$54        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$54, DW_AT_name("rsvd3")
     616                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd3")
     617                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00)
     618                      .dwattr $C$DW$54, DW_AT_bit_size(0x06)
     619                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     621              
     622                      .dwendtag $C$DW$T$31
     623              
     624              
     625              $C$DW$T$32      .dwtag  DW_TAG_union_type
     626                      .dwattr $C$DW$T$32, DW_AT_name("CMPCTL_REG")
     627                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     628              $C$DW$55        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$55, DW_AT_name("all")
     631                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     632                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     634              
     635              $C$DW$56        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$31)
     637                      .dwattr $C$DW$56, DW_AT_name("bit")
     638                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     639                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     640                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     641              
     642                      .dwendtag $C$DW$T$32
     643              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   13

     644              
     645              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     646                      .dwattr $C$DW$T$33, DW_AT_name("DBCTL_BITS")
     647                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     648              $C$DW$57        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     650                      .dwattr $C$DW$57, DW_AT_name("OUT_MODE")
     651                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_OUT_MODE")
     652                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0e)
     653                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
     654                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657              $C$DW$58        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     659                      .dwattr $C$DW$58, DW_AT_name("POLSEL")
     660                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_POLSEL")
     661                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
     662                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
     663                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     665              
     666              $C$DW$59        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$59, DW_AT_name("IN_MODE")
     669                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_IN_MODE")
     670                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a)
     671                      .dwattr $C$DW$59, DW_AT_bit_size(0x02)
     672                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     674              
     675              $C$DW$60        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$60, DW_AT_name("rsvd1")
     678                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd1")
     679                      .dwattr $C$DW$60, DW_AT_bit_offset(0x01)
     680                      .dwattr $C$DW$60, DW_AT_bit_size(0x09)
     681                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     683              
     684              $C$DW$61        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$61, DW_AT_name("HALFCYCLE")
     687                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_HALFCYCLE")
     688                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     689                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     690                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693                      .dwendtag $C$DW$T$33
     694              
     695              
     696              $C$DW$T$34      .dwtag  DW_TAG_union_type
     697                      .dwattr $C$DW$T$34, DW_AT_name("DBCTL_REG")
     698                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   14

     699              $C$DW$62        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$62, DW_AT_name("all")
     702                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     703                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     705              
     706              $C$DW$63        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$33)
     708                      .dwattr $C$DW$63, DW_AT_name("bit")
     709                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     710                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     711                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     712              
     713                      .dwendtag $C$DW$T$34
     714              
     715              
     716              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     717                      .dwattr $C$DW$T$35, DW_AT_name("DCCAPCTL_BITS")
     718                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     719              $C$DW$64        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$64, DW_AT_name("CAPE")
     722                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CAPE")
     723                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0f)
     724                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     725                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728              $C$DW$65        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$65, DW_AT_name("SHDWMODE")
     731                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SHDWMODE")
     732                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0e)
     733                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     734                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     736              
     737              $C$DW$66        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$66, DW_AT_name("rsvd1")
     740                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd1")
     741                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
     742                      .dwattr $C$DW$66, DW_AT_bit_size(0x0e)
     743                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     745              
     746                      .dwendtag $C$DW$T$35
     747              
     748              
     749              $C$DW$T$36      .dwtag  DW_TAG_union_type
     750                      .dwattr $C$DW$T$36, DW_AT_name("DCCAPCTL_REG")
     751                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     752              $C$DW$67        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   15

     754                      .dwattr $C$DW$67, DW_AT_name("all")
     755                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
     756                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$68        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$35)
     761                      .dwattr $C$DW$68, DW_AT_name("bit")
     762                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
     763                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766                      .dwendtag $C$DW$T$36
     767              
     768              
     769              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     770                      .dwattr $C$DW$T$37, DW_AT_name("DCCTL_BITS")
     771                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     772              $C$DW$69        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$69, DW_AT_name("EVT1SRCSEL")
     775                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_EVT1SRCSEL")
     776                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0f)
     777                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     778                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$70        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$70, DW_AT_name("EVT1FRCSYNCSEL")
     784                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_EVT1FRCSYNCSEL")
     785                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0e)
     786                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     787                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     789              
     790              $C$DW$71        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$71, DW_AT_name("EVT1SOCE")
     793                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_EVT1SOCE")
     794                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0d)
     795                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     796                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     798              
     799              $C$DW$72        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$72, DW_AT_name("EVT1SYNCE")
     802                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_EVT1SYNCE")
     803                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0c)
     804                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     805                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     807              
     808              $C$DW$73        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   16

     809                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
     811                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
     812                      .dwattr $C$DW$73, DW_AT_bit_offset(0x08)
     813                      .dwattr $C$DW$73, DW_AT_bit_size(0x04)
     814                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$74        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$74, DW_AT_name("EVT2SRCSEL")
     820                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_EVT2SRCSEL")
     821                      .dwattr $C$DW$74, DW_AT_bit_offset(0x07)
     822                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     823                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     825              
     826              $C$DW$75        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$75, DW_AT_name("EVT2FRCSYNCSEL")
     829                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_EVT2FRCSYNCSEL")
     830                      .dwattr $C$DW$75, DW_AT_bit_offset(0x06)
     831                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     832                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     834              
     835              $C$DW$76        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     837                      .dwattr $C$DW$76, DW_AT_name("rsvd2")
     838                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd2")
     839                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     840                      .dwattr $C$DW$76, DW_AT_bit_size(0x06)
     841                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     843              
     844                      .dwendtag $C$DW$T$37
     845              
     846              
     847              $C$DW$T$38      .dwtag  DW_TAG_union_type
     848                      .dwattr $C$DW$T$38, DW_AT_name("DCCTL_REG")
     849                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     850              $C$DW$77        .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     852                      .dwattr $C$DW$77, DW_AT_name("all")
     853                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     854                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     856              
     857              $C$DW$78        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$37)
     859                      .dwattr $C$DW$78, DW_AT_name("bit")
     860                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     861                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     863              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   17

     864                      .dwendtag $C$DW$T$38
     865              
     866              
     867              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     868                      .dwattr $C$DW$T$39, DW_AT_name("DCFCTL_BITS")
     869                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     870              $C$DW$79        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$79, DW_AT_name("SRCSEL")
     873                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SRCSEL")
     874                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0e)
     875                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
     876                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     878              
     879              $C$DW$80        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$80, DW_AT_name("BLANKE")
     882                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_BLANKE")
     883                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0d)
     884                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     885                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     887              
     888              $C$DW$81        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$81, DW_AT_name("BLANKINV")
     891                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_BLANKINV")
     892                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0c)
     893                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     894                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     896              
     897              $C$DW$82        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     899                      .dwattr $C$DW$82, DW_AT_name("PULSESEL")
     900                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PULSESEL")
     901                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0a)
     902                      .dwattr $C$DW$82, DW_AT_bit_size(0x02)
     903                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$83        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
     909                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
     910                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
     911                      .dwattr $C$DW$83, DW_AT_bit_size(0x0a)
     912                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915                      .dwendtag $C$DW$T$39
     916              
     917              
     918              $C$DW$T$40      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   18

     919                      .dwattr $C$DW$T$40, DW_AT_name("DCFCTL_REG")
     920                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     921              $C$DW$84        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$84, DW_AT_name("all")
     924                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
     925                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     927              
     928              $C$DW$85        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$39)
     930                      .dwattr $C$DW$85, DW_AT_name("bit")
     931                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
     932                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     934              
     935                      .dwendtag $C$DW$T$40
     936              
     937              
     938              $C$DW$T$41      .dwtag  DW_TAG_structure_type
     939                      .dwattr $C$DW$T$41, DW_AT_name("DCTRIPSEL_BITS")
     940                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
     941              $C$DW$86        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$86, DW_AT_name("DCAHCOMPSEL")
     944                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_DCAHCOMPSEL")
     945                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c)
     946                      .dwattr $C$DW$86, DW_AT_bit_size(0x04)
     947                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$87        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$87, DW_AT_name("DCALCOMPSEL")
     953                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_DCALCOMPSEL")
     954                      .dwattr $C$DW$87, DW_AT_bit_offset(0x08)
     955                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
     956                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     958              
     959              $C$DW$88        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$88, DW_AT_name("DCBHCOMPSEL")
     962                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_DCBHCOMPSEL")
     963                      .dwattr $C$DW$88, DW_AT_bit_offset(0x04)
     964                      .dwattr $C$DW$88, DW_AT_bit_size(0x04)
     965                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968              $C$DW$89        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$89, DW_AT_name("DCBLCOMPSEL")
     971                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_DCBLCOMPSEL")
     972                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
     973                      .dwattr $C$DW$89, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   19

     974                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977                      .dwendtag $C$DW$T$41
     978              
     979              
     980              $C$DW$T$42      .dwtag  DW_TAG_union_type
     981                      .dwattr $C$DW$T$42, DW_AT_name("DCTRIPSEL_REG")
     982                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
     983              $C$DW$90        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$90, DW_AT_name("all")
     986                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     987                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990              $C$DW$91        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$41)
     992                      .dwattr $C$DW$91, DW_AT_name("bit")
     993                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
     994                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     996              
     997                      .dwendtag $C$DW$T$42
     998              
     999              
    1000              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1001                      .dwattr $C$DW$T$43, DW_AT_name("EPWMCFG_BITS")
    1002                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1003              $C$DW$92        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$92, DW_AT_name("CONFIG")
    1006                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CONFIG")
    1007                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0f)
    1008                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1009                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1011              
    1012              $C$DW$93        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    1015                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1016                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
    1017                      .dwattr $C$DW$93, DW_AT_bit_size(0x0f)
    1018                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1020              
    1021                      .dwendtag $C$DW$T$43
    1022              
    1023              
    1024              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1025                      .dwattr $C$DW$T$44, DW_AT_name("EPWMCFG_REG")
    1026                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1027              $C$DW$94        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   20

    1029                      .dwattr $C$DW$94, DW_AT_name("all")
    1030                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    1031                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1033              
    1034              $C$DW$95        .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$43)
    1036                      .dwattr $C$DW$95, DW_AT_name("bit")
    1037                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    1038                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1040              
    1041                      .dwendtag $C$DW$T$44
    1042              
    1043              
    1044              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1045                      .dwattr $C$DW$T$47, DW_AT_name("EPWM_REGS")
    1046                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x40)
    1047              $C$DW$96        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$98)
    1049                      .dwattr $C$DW$96, DW_AT_name("TBCTL")
    1050                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_TBCTL")
    1051                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$97        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$104)
    1056                      .dwattr $C$DW$97, DW_AT_name("TBSTS")
    1057                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_TBSTS")
    1058                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1059                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$98        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$99)
    1063                      .dwattr $C$DW$98, DW_AT_name("TBPHS")
    1064                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_TBPHS")
    1065                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1066                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068              $C$DW$99        .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$99, DW_AT_name("TBCTR")
    1071                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_TBCTR")
    1072                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1073                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$100       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$100, DW_AT_name("TBPRD")
    1078                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_TBPRD")
    1079                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1080                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$101       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   21

    1084                      .dwattr $C$DW$101, DW_AT_name("TBPRDHR")
    1085                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_TBPRDHR")
    1086                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1087                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$102       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$32)
    1091                      .dwattr $C$DW$102, DW_AT_name("CMPCTL")
    1092                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_CMPCTL")
    1093                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1094                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096              $C$DW$103       .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$29)
    1098                      .dwattr $C$DW$103, DW_AT_name("CMPA")
    1099                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CMPA")
    1100                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1101                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1102              
    1103              $C$DW$104       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$104, DW_AT_name("CMPB")
    1106                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CMPB")
    1107                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1108                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$105       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$23)
    1112                      .dwattr $C$DW$105, DW_AT_name("AQCTLA")
    1113                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_AQCTLA")
    1114                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1115                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1116              
    1117              $C$DW$106       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$23)
    1119                      .dwattr $C$DW$106, DW_AT_name("AQCTLB")
    1120                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_AQCTLB")
    1121                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1122                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$107       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1126                      .dwattr $C$DW$107, DW_AT_name("AQSFRC")
    1127                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_AQSFRC")
    1128                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1129                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$108       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1133                      .dwattr $C$DW$108, DW_AT_name("AQCSFRC")
    1134                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_AQCSFRC")
    1135                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1136                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   22

    1139                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$34)
    1140                      .dwattr $C$DW$109, DW_AT_name("DBCTL")
    1141                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DBCTL")
    1142                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1143                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$110       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$110, DW_AT_name("DBRED")
    1148                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_DBRED")
    1149                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1150                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1151              
    1152              $C$DW$111       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$111, DW_AT_name("DBFED")
    1155                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_DBFED")
    1156                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1157                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$112       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$118)
    1161                      .dwattr $C$DW$112, DW_AT_name("TZSEL")
    1162                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_TZSEL")
    1163                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1164                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166              $C$DW$113       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$110)
    1168                      .dwattr $C$DW$113, DW_AT_name("TZDCSEL")
    1169                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_TZDCSEL")
    1170                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1171                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$114       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$108)
    1175                      .dwattr $C$DW$114, DW_AT_name("TZCTL")
    1176                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_TZCTL")
    1177                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1178                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$115       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$112)
    1182                      .dwattr $C$DW$115, DW_AT_name("TZEINT")
    1183                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_TZEINT")
    1184                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1185                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187              $C$DW$116       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$114)
    1189                      .dwattr $C$DW$116, DW_AT_name("TZFLG")
    1190                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_TZFLG")
    1191                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1192                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1193              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   23

    1194              $C$DW$117       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$106)
    1196                      .dwattr $C$DW$117, DW_AT_name("TZCLR")
    1197                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_TZCLR")
    1198                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1199                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201              $C$DW$118       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$116)
    1203                      .dwattr $C$DW$118, DW_AT_name("TZFRC")
    1204                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_TZFRC")
    1205                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1206                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1207              
    1208              $C$DW$119       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$57)
    1210                      .dwattr $C$DW$119, DW_AT_name("ETSEL")
    1211                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ETSEL")
    1212                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1213                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1214              
    1215              $C$DW$120       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$55)
    1217                      .dwattr $C$DW$120, DW_AT_name("ETPS")
    1218                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ETPS")
    1219                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1220                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1221              
    1222              $C$DW$121       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$51)
    1224                      .dwattr $C$DW$121, DW_AT_name("ETFLG")
    1225                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ETFLG")
    1226                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1227                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229              $C$DW$122       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$49)
    1231                      .dwattr $C$DW$122, DW_AT_name("ETCLR")
    1232                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ETCLR")
    1233                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1234                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$123       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$53)
    1238                      .dwattr $C$DW$123, DW_AT_name("ETFRC")
    1239                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ETFRC")
    1240                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1241                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1242              
    1243              $C$DW$124       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$75)
    1245                      .dwattr $C$DW$124, DW_AT_name("PCCTL")
    1246                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PCCTL")
    1247                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1248                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   24

    1249              
    1250              $C$DW$125       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1253                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1254                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1255                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$126       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$59)
    1259                      .dwattr $C$DW$126, DW_AT_name("HRCNFG")
    1260                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_HRCNFG")
    1261                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1262                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1263              
    1264              $C$DW$127       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$63)
    1266                      .dwattr $C$DW$127, DW_AT_name("HRPWR")
    1267                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_HRPWR")
    1268                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1269                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$128       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$128, DW_AT_name("rsvd2")
    1274                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd2")
    1275                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1276                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$129       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$129, DW_AT_name("rsvd3")
    1281                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd3")
    1282                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1283                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285              $C$DW$130       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$130, DW_AT_name("rsvd4")
    1288                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd4")
    1289                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1290                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1291              
    1292              $C$DW$131       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$131, DW_AT_name("rsvd5")
    1295                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd5")
    1296                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1297                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1298              
    1299              $C$DW$132       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$132, DW_AT_name("HRMSTEP")
    1302                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_HRMSTEP")
    1303                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   25

    1304                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$133       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$133, DW_AT_name("rsvd6")
    1309                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd6")
    1310                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1311                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313              $C$DW$134       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$61)
    1315                      .dwattr $C$DW$134, DW_AT_name("HRPCTL")
    1316                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_HRPCTL")
    1317                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1318                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$135       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$135, DW_AT_name("rsvd7")
    1323                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd7")
    1324                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1325                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327              $C$DW$136       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$101)
    1329                      .dwattr $C$DW$136, DW_AT_name("TBPRDM")
    1330                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_TBPRDM")
    1331                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1332                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1333              
    1334              $C$DW$137       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$29)
    1336                      .dwattr $C$DW$137, DW_AT_name("CMPAM")
    1337                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_CMPAM")
    1338                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1339                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1340              
    1341              $C$DW$138       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$45)
    1343                      .dwattr $C$DW$138, DW_AT_name("rsvd8")
    1344                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd8")
    1345                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1346                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$139       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$42)
    1350                      .dwattr $C$DW$139, DW_AT_name("DCTRIPSEL")
    1351                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_DCTRIPSEL")
    1352                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1353                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355              $C$DW$140       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$38)
    1357                      .dwattr $C$DW$140, DW_AT_name("DCACTL")
    1358                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_DCACTL")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   26

    1359                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1360                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362              $C$DW$141       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$38)
    1364                      .dwattr $C$DW$141, DW_AT_name("DCBCTL")
    1365                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_DCBCTL")
    1366                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1367                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1368              
    1369              $C$DW$142       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$40)
    1371                      .dwattr $C$DW$142, DW_AT_name("DCFCTL")
    1372                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DCFCTL")
    1373                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1374                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$143       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$36)
    1378                      .dwattr $C$DW$143, DW_AT_name("DCCAPCTL")
    1379                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_DCCAPCTL")
    1380                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1381                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$144       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$144, DW_AT_name("DCFOFFSET")
    1386                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DCFOFFSET")
    1387                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1388                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1389              
    1390              $C$DW$145       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$145, DW_AT_name("DCFOFFSETCNT")
    1393                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_DCFOFFSETCNT")
    1394                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1395                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$146       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$146, DW_AT_name("DCFWINDOW")
    1400                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_DCFWINDOW")
    1401                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1402                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$147       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$147, DW_AT_name("DCFWINDOWCNT")
    1407                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_DCFWINDOWCNT")
    1408                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1409                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$148       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$148, DW_AT_name("DCCAP")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 22:15:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initEPWM.asm                                                         PAGE   27

    1414                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_DCCAP")
    1415                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1416                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418              $C$DW$149       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$46)
    1420                      .dwattr $C$DW$149, DW_AT_name("rsvd9")
    1421                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd9")
    1422                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1423                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1424              
    1425                      .dwendtag $C$DW$T$47
    1426              
    1427              $C$DW$150       .dwtag  DW_TAG_TI_far_type
    1428                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$47)
    1429              
    1430              $C$DW$T$123     .dwtag  DW_TAG_volatile_type
    1431                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$150)
    1432              
    1433              
    1434              $C$DW$T$48      .dwtag  DW_TAG_structure_type
