TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Apr 10 14:49:15 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initClock.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("DevEmuRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DevEmuRegs")

      61                      .dwpsn  file "../source/initClock.c",line 13,column 5,is_stmt,isa 0
      62 00000001 8F40!         MOVL      XAR5,#_SysCtrlRegs    ; [CPU_U] |13| 
         00000002 0000 
      63 00000003 8AA5          MOVL      XAR4,XAR5             ; [CPU_] |13| 
      64                      .dwpsn  file "../source/initClock.c",line 14,column 5,is_stmt,isa 0
      65 00000004 D011          MOVB      XAR0,#17              ; [CPU_] |14| 
      66 00000005 761F!         MOVW      DP,#_SysCtrlRegs+17   ; [CPU_U] 
         00000006 0000 
      67                      .dwpsn  file "../source/initClock.c",line 13,column 5,is_stmt,isa 0
      68 00000007 DC01          ADDB      XAR4,#1               ; [CPU_] |13| 
      69 00000008 1AC4          OR        *+XAR4[0],#0x0040     ; [CPU_] |13| 
         00000009 0040 
      70                      .dwpsn  file "../source/initClock.c",line 14,column 5,is_stmt,isa 0
      71 0000000a CC95          AND       AL,*+XAR5[AR0],#0xffe0 ; [CPU_] |14| 
         0000000b FFE0 
      72 0000000c 5004          ORB       AL,#0x04              ; [CPU_] |14| 
      73 0000000d 9611!         MOV       @_SysCtrlRegs+17,AL   ; [CPU_] |14| 
      74 0000000e       $C$L1:    
      75                      .dwpsn  file "../source/initClock.c",line 15,column 11,is_stmt,isa 0
      76 0000000e 4001!         TBIT      @_SysCtrlRegs+1,#0    ; [CPU_] |15| 
      77 0000000f 6CFF          B         $C$L1,NTC             ; [CPU_] |15| 
      78                      ; branchcc occurs ; [] |15| 
      79                      .dwpsn  file "../source/initClock.c",line 16,column 5,is_stmt,isa 0
      80 00000010 1801!         AND       @_SysCtrlRegs+1,#0xffbf ; [CPU_] |16| 
         00000011 FFBF 
      81                      .dwpsn  file "../source/initClock.c",line 17,column 5,is_stmt,isa 0
      82 00000012 1A01!         OR        @_SysCtrlRegs+1,#0x0180 ; [CPU_] |17| 
         00000013 0180 
      83                      .dwpsn  file "../source/initClock.c",line 18,column 5,is_stmt,isa 0
      84 00000014 CC00!         AND       AL,@_SysCtrlRegs,#0xfffe ; [CPU_] |18| 
         00000015 FFFE 
      85 00000016 5002          ORB       AL,#0x02              ; [CPU_] |18| 
      86 00000017 9600!         MOV       @_SysCtrlRegs,AL      ; [CPU_] |18| 
      87 00000018 761F!         MOVW      DP,#_DevEmuRegs+1     ; [CPU_U] 
         00000019 0000 
      88                      .dwpsn  file "../source/initClock.c",line 22,column 5,is_stmt,isa 0
      89 0000001a 4E01!         TBIT      @_DevEmuRegs+1,#14    ; [CPU_] |22| 
      90 0000001b 6C03          B         $C$L2,NTC             ; [CPU_] |22| 
      91                      ; branchcc occurs ; [] |22| 
      92                      .dwpsn  file "../source/initClock.c",line 24,column 7,is_stmt,isa 0
      93 0000001c 1801!         AND       @_DevEmuRegs+1,#0xbfff ; [CPU_] |24| 
         0000001d BFFF 
      94 0000001e       $C$L2:    
      95 0000001e 761F!         MOVW      DP,#_SysCtrlRegs+32   ; [CPU_U] 
         0000001f 0000 
      96                      .dwpsn  file "../source/initClock.c",line 27,column 5,is_stmt,isa 0
      97 00000020 1820!         AND       @_SysCtrlRegs+32,#0xfffb ; [CPU_] |27| 
         00000021 FFFB 
      98                      .dwpsn  file "../source/initClock.c",line 28,column 5,is_stmt,isa 0
      99 00000022 1820!         AND       @_SysCtrlRegs+32,#0xfffc ; [CPU_] |28| 
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    3

         00000023 FFFC 
     100 00000024 761F!         MOVW      DP,#_DevEmuRegs+1     ; [CPU_U] 
         00000025 0000 
     101                      .dwpsn  file "../source/initClock.c",line 32,column 5,is_stmt,isa 0
     102 00000026 1801!         AND       @_DevEmuRegs+1,#0xbfff ; [CPU_] |32| 
         00000027 BFFF 
     103 00000028 761A   EDIS
     104 00000029 FF69          SPM       #0                    ; [CPU_] 
     105              $C$DW$4 .dwtag  DW_TAG_TI_branch
     106                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
     107                      .dwattr $C$DW$4, DW_AT_TI_return
     108              
     109 0000002a 0006          LRETR     ; [CPU_] 
     110                      ; return occurs ; [] 
     111                      .dwattr $C$DW$3, DW_AT_TI_end_file("../source/initClock.c")
     112                      .dwattr $C$DW$3, DW_AT_TI_end_line(0x22)
     113                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     114                      .dwendentry
     115                      .dwendtag $C$DW$3
     116              
     117              ;**************************************************************
     118              ;* UNDEFINED EXTERNAL REFERENCES                              *
     119              ;**************************************************************
     120                      .global _DevEmuRegs
     121                      .global _SysCtrlRegs
     122              
     123              ;***************************************************************
     124              ;* TYPE INFORMATION                                            *
     125              ;***************************************************************
     126              
     127              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     128                      .dwattr $C$DW$T$20, DW_AT_name("CLASSID_BITS")
     129                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     130              $C$DW$5 .dwtag  DW_TAG_member
     131                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     132                      .dwattr $C$DW$5, DW_AT_name("CLASSNO")
     133                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_CLASSNO")
     134                      .dwattr $C$DW$5, DW_AT_bit_offset(0x08)
     135                      .dwattr $C$DW$5, DW_AT_bit_size(0x08)
     136                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     137                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     138              
     139              $C$DW$6 .dwtag  DW_TAG_member
     140                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     141                      .dwattr $C$DW$6, DW_AT_name("PARTTYPE")
     142                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_PARTTYPE")
     143                      .dwattr $C$DW$6, DW_AT_bit_offset(0x00)
     144                      .dwattr $C$DW$6, DW_AT_bit_size(0x08)
     145                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     146                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     147              
     148                      .dwendtag $C$DW$T$20
     149              
     150              
     151              $C$DW$T$21      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    4

     152                      .dwattr $C$DW$T$21, DW_AT_name("CLASSID_REG")
     153                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     154              $C$DW$7 .dwtag  DW_TAG_member
     155                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     156                      .dwattr $C$DW$7, DW_AT_name("all")
     157                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_all")
     158                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     159                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     160              
     161              $C$DW$8 .dwtag  DW_TAG_member
     162                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$20)
     163                      .dwattr $C$DW$8, DW_AT_name("bit")
     164                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_bit")
     165                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     166                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     167              
     168                      .dwendtag $C$DW$T$21
     169              
     170              
     171              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     172                      .dwattr $C$DW$T$22, DW_AT_name("CLKCTL_BITS")
     173                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     174              $C$DW$9 .dwtag  DW_TAG_member
     175                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     176                      .dwattr $C$DW$9, DW_AT_name("OSCCLKSRCSEL")
     177                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     178                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0f)
     179                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     180                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     181                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     182              
     183              $C$DW$10        .dwtag  DW_TAG_member
     184                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     185                      .dwattr $C$DW$10, DW_AT_name("OSCCLKSRC2SEL")
     186                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     187                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0e)
     188                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     189                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     190                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     191              
     192              $C$DW$11        .dwtag  DW_TAG_member
     193                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     194                      .dwattr $C$DW$11, DW_AT_name("WDCLKSRCSEL")
     195                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     196                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0d)
     197                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     198                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     199                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     200              
     201              $C$DW$12        .dwtag  DW_TAG_member
     202                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     203                      .dwattr $C$DW$12, DW_AT_name("TMR2CLKSRCSEL")
     204                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     205                      .dwattr $C$DW$12, DW_AT_bit_offset(0x0b)
     206                      .dwattr $C$DW$12, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    5

     207                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     208                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     209              
     210              $C$DW$13        .dwtag  DW_TAG_member
     211                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     212                      .dwattr $C$DW$13, DW_AT_name("TMR2CLKPRESCALE")
     213                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     214                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     215                      .dwattr $C$DW$13, DW_AT_bit_size(0x03)
     216                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     217                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     218              
     219              $C$DW$14        .dwtag  DW_TAG_member
     220                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     221                      .dwattr $C$DW$14, DW_AT_name("INTOSC1OFF")
     222                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_INTOSC1OFF")
     223                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07)
     224                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     225                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     226                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     227              
     228              $C$DW$15        .dwtag  DW_TAG_member
     229                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     230                      .dwattr $C$DW$15, DW_AT_name("INTOSC1HALTI")
     231                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     232                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06)
     233                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     234                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     235                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     236              
     237              $C$DW$16        .dwtag  DW_TAG_member
     238                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     239                      .dwattr $C$DW$16, DW_AT_name("INTOSC2OFF")
     240                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_INTOSC2OFF")
     241                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05)
     242                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     243                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     244                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     245              
     246              $C$DW$17        .dwtag  DW_TAG_member
     247                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     248                      .dwattr $C$DW$17, DW_AT_name("INTOSC2HALTI")
     249                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     250                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     251                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     252                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     253                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     254              
     255              $C$DW$18        .dwtag  DW_TAG_member
     256                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     257                      .dwattr $C$DW$18, DW_AT_name("WDHALTI")
     258                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_WDHALTI")
     259                      .dwattr $C$DW$18, DW_AT_bit_offset(0x03)
     260                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     261                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    6

     262                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     263              
     264              $C$DW$19        .dwtag  DW_TAG_member
     265                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     266                      .dwattr $C$DW$19, DW_AT_name("XCLKINOFF")
     267                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_XCLKINOFF")
     268                      .dwattr $C$DW$19, DW_AT_bit_offset(0x02)
     269                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     270                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     271                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     272              
     273              $C$DW$20        .dwtag  DW_TAG_member
     274                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     275                      .dwattr $C$DW$20, DW_AT_name("XTALOSCOFF")
     276                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_XTALOSCOFF")
     277                      .dwattr $C$DW$20, DW_AT_bit_offset(0x01)
     278                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     279                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     281              
     282              $C$DW$21        .dwtag  DW_TAG_member
     283                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     284                      .dwattr $C$DW$21, DW_AT_name("NMIRESETSEL")
     285                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_NMIRESETSEL")
     286                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00)
     287                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     288                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     289                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     290              
     291                      .dwendtag $C$DW$T$22
     292              
     293              
     294              $C$DW$T$23      .dwtag  DW_TAG_union_type
     295                      .dwattr $C$DW$T$23, DW_AT_name("CLKCTL_REG")
     296                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     297              $C$DW$22        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     299                      .dwattr $C$DW$22, DW_AT_name("all")
     300                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_all")
     301                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     303              
     304              $C$DW$23        .dwtag  DW_TAG_member
     305                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     306                      .dwattr $C$DW$23, DW_AT_name("bit")
     307                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_bit")
     308                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311                      .dwendtag $C$DW$T$23
     312              
     313              
     314              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     315                      .dwattr $C$DW$T$24, DW_AT_name("DEVICECNF_BITS")
     316                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    7

     317              $C$DW$24        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     320                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     321                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0d)
     322                      .dwattr $C$DW$24, DW_AT_bit_size(0x03)
     323                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     324                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     325              
     326              $C$DW$25        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     328                      .dwattr $C$DW$25, DW_AT_name("VMAPS")
     329                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_VMAPS")
     330                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0c)
     331                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     332                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     334              
     335              $C$DW$26        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     338                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     339                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0b)
     340                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     341                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     342                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     343              
     344              $C$DW$27        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$27, DW_AT_name("XRSn")
     347                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_XRSn")
     348                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0a)
     349                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     350                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     351                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     352              
     353              $C$DW$28        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     355                      .dwattr $C$DW$28, DW_AT_name("rsvd3")
     356                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd3")
     357                      .dwattr $C$DW$28, DW_AT_bit_offset(0x00)
     358                      .dwattr $C$DW$28, DW_AT_bit_size(0x0a)
     359                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$29        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$29, DW_AT_name("rsvd4")
     365                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd4")
     366                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0d)
     367                      .dwattr $C$DW$29, DW_AT_bit_size(0x03)
     368                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     369                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     370              
     371              $C$DW$30        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    8

     372                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     373                      .dwattr $C$DW$30, DW_AT_name("ENPROT")
     374                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_ENPROT")
     375                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0c)
     376                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     377                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     378                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     379              
     380              $C$DW$31        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     382                      .dwattr $C$DW$31, DW_AT_name("rsvd5")
     383                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd5")
     384                      .dwattr $C$DW$31, DW_AT_bit_offset(0x05)
     385                      .dwattr $C$DW$31, DW_AT_bit_size(0x07)
     386                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     387                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389              $C$DW$32        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     391                      .dwattr $C$DW$32, DW_AT_name("TRSTn")
     392                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_TRSTn")
     393                      .dwattr $C$DW$32, DW_AT_bit_offset(0x04)
     394                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     395                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     396                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     397              
     398              $C$DW$33        .dwtag  DW_TAG_member
     399                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     400                      .dwattr $C$DW$33, DW_AT_name("rsvd6")
     401                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd6")
     402                      .dwattr $C$DW$33, DW_AT_bit_offset(0x02)
     403                      .dwattr $C$DW$33, DW_AT_bit_size(0x02)
     404                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     405                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     406              
     407              $C$DW$34        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     409                      .dwattr $C$DW$34, DW_AT_name("SYSCLK2DIV2DIS")
     410                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_SYSCLK2DIV2DIS")
     411                      .dwattr $C$DW$34, DW_AT_bit_offset(0x01)
     412                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     413                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     414                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     415              
     416              $C$DW$35        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     418                      .dwattr $C$DW$35, DW_AT_name("rsvd8")
     419                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd8")
     420                      .dwattr $C$DW$35, DW_AT_bit_offset(0x00)
     421                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     422                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     423                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     424              
     425                      .dwendtag $C$DW$T$24
     426              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE    9

     427              
     428              $C$DW$T$26      .dwtag  DW_TAG_union_type
     429                      .dwattr $C$DW$T$26, DW_AT_name("DEVICECNF_REG")
     430                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     431              $C$DW$36        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
     433                      .dwattr $C$DW$36, DW_AT_name("all")
     434                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_all")
     435                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     436                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     437              
     438              $C$DW$37        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$24)
     440                      .dwattr $C$DW$37, DW_AT_name("bit")
     441                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_bit")
     442                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445                      .dwendtag $C$DW$T$26
     446              
     447              
     448              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     449                      .dwattr $C$DW$T$27, DW_AT_name("DEV_EMU_REGS")
     450                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     451              $C$DW$38        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$26)
     453                      .dwattr $C$DW$38, DW_AT_name("DEVICECNF")
     454                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_DEVICECNF")
     455                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     456                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$39        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$21)
     460                      .dwattr $C$DW$39, DW_AT_name("CLASSID")
     461                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_CLASSID")
     462                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     463                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     464              
     465              $C$DW$40        .dwtag  DW_TAG_member
     466                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     467                      .dwattr $C$DW$40, DW_AT_name("REVID")
     468                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_REVID")
     469                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     470                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     471              
     472                      .dwendtag $C$DW$T$27
     473              
     474              $C$DW$41        .dwtag  DW_TAG_TI_far_type
     475                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$27)
     476              
     477              $C$DW$T$64      .dwtag  DW_TAG_volatile_type
     478                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$41)
     479              
     480              
     481              $C$DW$T$28      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   10

     482                      .dwattr $C$DW$T$28, DW_AT_name("EPWMCFG_BITS")
     483                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     484              $C$DW$42        .dwtag  DW_TAG_member
     485                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     486                      .dwattr $C$DW$42, DW_AT_name("CONFIG")
     487                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_CONFIG")
     488                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0f)
     489                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     490                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     491                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     492              
     493              $C$DW$43        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$43, DW_AT_name("rsvd1")
     496                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd1")
     497                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00)
     498                      .dwattr $C$DW$43, DW_AT_bit_size(0x0f)
     499                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502                      .dwendtag $C$DW$T$28
     503              
     504              
     505              $C$DW$T$29      .dwtag  DW_TAG_union_type
     506                      .dwattr $C$DW$T$29, DW_AT_name("EPWMCFG_REG")
     507                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     508              $C$DW$44        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     510                      .dwattr $C$DW$44, DW_AT_name("all")
     511                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     512                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     514              
     515              $C$DW$45        .dwtag  DW_TAG_member
     516                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$28)
     517                      .dwattr $C$DW$45, DW_AT_name("bit")
     518                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bit")
     519                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     520                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     521              
     522                      .dwendtag $C$DW$T$29
     523              
     524              
     525              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     526                      .dwattr $C$DW$T$30, DW_AT_name("INTOSC1TRIM_BITS")
     527                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     528              $C$DW$46        .dwtag  DW_TAG_member
     529                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     530                      .dwattr $C$DW$46, DW_AT_name("COARSETRIM")
     531                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_COARSETRIM")
     532                      .dwattr $C$DW$46, DW_AT_bit_offset(0x08)
     533                      .dwattr $C$DW$46, DW_AT_bit_size(0x08)
     534                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     536              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   11

     537              $C$DW$47        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     539                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     540                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     541                      .dwattr $C$DW$47, DW_AT_bit_offset(0x07)
     542                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     543                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     544                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     545              
     546              $C$DW$48        .dwtag  DW_TAG_member
     547                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     548                      .dwattr $C$DW$48, DW_AT_name("FINETRIM")
     549                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_FINETRIM")
     550                      .dwattr $C$DW$48, DW_AT_bit_offset(0x01)
     551                      .dwattr $C$DW$48, DW_AT_bit_size(0x06)
     552                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     554              
     555              $C$DW$49        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$49, DW_AT_name("rsvd2")
     558                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd2")
     559                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     560                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     561                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     563              
     564                      .dwendtag $C$DW$T$30
     565              
     566              
     567              $C$DW$T$31      .dwtag  DW_TAG_union_type
     568                      .dwattr $C$DW$T$31, DW_AT_name("INTOSC1TRIM_REG")
     569                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     570              $C$DW$50        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$50, DW_AT_name("all")
     573                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     574                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     576              
     577              $C$DW$51        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$30)
     579                      .dwattr $C$DW$51, DW_AT_name("bit")
     580                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     581                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     583              
     584                      .dwendtag $C$DW$T$31
     585              
     586              
     587              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     588                      .dwattr $C$DW$T$32, DW_AT_name("INTOSC2TRIM_BITS")
     589                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     590              $C$DW$52        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   12

     592                      .dwattr $C$DW$52, DW_AT_name("COARSETRIM")
     593                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_COARSETRIM")
     594                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     595                      .dwattr $C$DW$52, DW_AT_bit_size(0x08)
     596                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     598              
     599              $C$DW$53        .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     601                      .dwattr $C$DW$53, DW_AT_name("rsvd1")
     602                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd1")
     603                      .dwattr $C$DW$53, DW_AT_bit_offset(0x07)
     604                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     605                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     606                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     607              
     608              $C$DW$54        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$54, DW_AT_name("FINETRIM")
     611                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_FINETRIM")
     612                      .dwattr $C$DW$54, DW_AT_bit_offset(0x01)
     613                      .dwattr $C$DW$54, DW_AT_bit_size(0x06)
     614                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$55        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     620                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     621                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     622                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     623                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     624                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     625              
     626                      .dwendtag $C$DW$T$32
     627              
     628              
     629              $C$DW$T$33      .dwtag  DW_TAG_union_type
     630                      .dwattr $C$DW$T$33, DW_AT_name("INTOSC2TRIM_REG")
     631                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     632              $C$DW$56        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$56, DW_AT_name("all")
     635                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     636                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     638              
     639              $C$DW$57        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$32)
     641                      .dwattr $C$DW$57, DW_AT_name("bit")
     642                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     643                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     645              
     646                      .dwendtag $C$DW$T$33
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   13

     647              
     648              
     649              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     650                      .dwattr $C$DW$T$34, DW_AT_name("JTAGDEBUG_BITS")
     651                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     652              $C$DW$58        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$58, DW_AT_name("JTAGDIS")
     655                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_JTAGDIS")
     656                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0f)
     657                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     658                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661              $C$DW$59        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$59, DW_AT_name("rsvd1")
     664                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd1")
     665                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00)
     666                      .dwattr $C$DW$59, DW_AT_bit_size(0x0f)
     667                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670                      .dwendtag $C$DW$T$34
     671              
     672              
     673              $C$DW$T$35      .dwtag  DW_TAG_union_type
     674                      .dwattr $C$DW$T$35, DW_AT_name("JTAGDEBUG_REG")
     675                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     676              $C$DW$60        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$60, DW_AT_name("all")
     679                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_all")
     680                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$61        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$34)
     685                      .dwattr $C$DW$61, DW_AT_name("bit")
     686                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_bit")
     687                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     689              
     690                      .dwendtag $C$DW$T$35
     691              
     692              
     693              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     694                      .dwattr $C$DW$T$36, DW_AT_name("LOSPCP_BITS")
     695                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     696              $C$DW$62        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$62, DW_AT_name("LSPCLK")
     699                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_LSPCLK")
     700                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0d)
     701                      .dwattr $C$DW$62, DW_AT_bit_size(0x03)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   14

     702                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     704              
     705              $C$DW$63        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$63, DW_AT_name("rsvd1")
     708                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd1")
     709                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
     710                      .dwattr $C$DW$63, DW_AT_bit_size(0x0d)
     711                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714                      .dwendtag $C$DW$T$36
     715              
     716              
     717              $C$DW$T$37      .dwtag  DW_TAG_union_type
     718                      .dwattr $C$DW$T$37, DW_AT_name("LOSPCP_REG")
     719                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     720              $C$DW$64        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$64, DW_AT_name("all")
     723                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
     724                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     725                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     726              
     727              $C$DW$65        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$36)
     729                      .dwattr $C$DW$65, DW_AT_name("bit")
     730                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
     731                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     733              
     734                      .dwendtag $C$DW$T$37
     735              
     736              
     737              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     738                      .dwattr $C$DW$T$38, DW_AT_name("LPMCR0_BITS")
     739                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     740              $C$DW$66        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$66, DW_AT_name("LPM")
     743                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_LPM")
     744                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0e)
     745                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     746                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     748              
     749              $C$DW$67        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     751                      .dwattr $C$DW$67, DW_AT_name("QUALSTDBY")
     752                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_QUALSTDBY")
     753                      .dwattr $C$DW$67, DW_AT_bit_offset(0x08)
     754                      .dwattr $C$DW$67, DW_AT_bit_size(0x06)
     755                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   15

     757              
     758              $C$DW$68        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$68, DW_AT_name("rsvd1")
     761                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd1")
     762                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01)
     763                      .dwattr $C$DW$68, DW_AT_bit_size(0x07)
     764                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     766              
     767              $C$DW$69        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$69, DW_AT_name("WDINTE")
     770                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_WDINTE")
     771                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     772                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     773                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     775              
     776                      .dwendtag $C$DW$T$38
     777              
     778              
     779              $C$DW$T$39      .dwtag  DW_TAG_union_type
     780                      .dwattr $C$DW$T$39, DW_AT_name("LPMCR0_REG")
     781                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     782              $C$DW$70        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$70, DW_AT_name("all")
     785                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     786                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     788              
     789              $C$DW$71        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$38)
     791                      .dwattr $C$DW$71, DW_AT_name("bit")
     792                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
     793                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     795              
     796                      .dwendtag $C$DW$T$39
     797              
     798              
     799              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     800                      .dwattr $C$DW$T$40, DW_AT_name("PCLKCR0_BITS")
     801                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     802              $C$DW$72        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$72, DW_AT_name("HRPWMENCLK")
     805                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_HRPWMENCLK")
     806                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f)
     807                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     808                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$73        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   16

     812                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
     814                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
     815                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e)
     816                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     819              
     820              $C$DW$74        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$74, DW_AT_name("TBCLKSYNC")
     823                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_TBCLKSYNC")
     824                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d)
     825                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     826                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829              $C$DW$75        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$75, DW_AT_name("ADCENCLK")
     832                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_ADCENCLK")
     833                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c)
     834                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$76        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$76, DW_AT_name("I2CAENCLK")
     841                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_I2CAENCLK")
     842                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b)
     843                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     846              
     847              $C$DW$77        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
     850                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
     851                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a)
     852                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$78        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$78, DW_AT_name("rsvd3")
     859                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd3")
     860                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08)
     861                      .dwattr $C$DW$78, DW_AT_bit_size(0x02)
     862                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$79        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   17

     867                      .dwattr $C$DW$79, DW_AT_name("SPIAENCLK")
     868                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SPIAENCLK")
     869                      .dwattr $C$DW$79, DW_AT_bit_offset(0x07)
     870                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874              $C$DW$80        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$80, DW_AT_name("SPIBENCLK")
     877                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SPIBENCLK")
     878                      .dwattr $C$DW$80, DW_AT_bit_offset(0x06)
     879                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$81        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$81, DW_AT_name("SCIAENCLK")
     886                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SCIAENCLK")
     887                      .dwattr $C$DW$81, DW_AT_bit_offset(0x05)
     888                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     889                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$82        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$82, DW_AT_name("SCIBENCLK")
     895                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SCIBENCLK")
     896                      .dwattr $C$DW$82, DW_AT_bit_offset(0x04)
     897                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     898                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     900              
     901              $C$DW$83        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$83, DW_AT_name("MCBSPAENCLK")
     904                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_MCBSPAENCLK")
     905                      .dwattr $C$DW$83, DW_AT_bit_offset(0x03)
     906                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     907                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910              $C$DW$84        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$84, DW_AT_name("rsvd4")
     913                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd4")
     914                      .dwattr $C$DW$84, DW_AT_bit_offset(0x02)
     915                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     916                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     918              
     919              $C$DW$85        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$85, DW_AT_name("ECANAENCLK")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   18

     922                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ECANAENCLK")
     923                      .dwattr $C$DW$85, DW_AT_bit_offset(0x01)
     924                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     925                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     927              
     928              $C$DW$86        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$86, DW_AT_name("rsvd5")
     931                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd5")
     932                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
     933                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     934                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     936              
     937                      .dwendtag $C$DW$T$40
     938              
     939              
     940              $C$DW$T$41      .dwtag  DW_TAG_union_type
     941                      .dwattr $C$DW$T$41, DW_AT_name("PCLKCR0_REG")
     942                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
     943              $C$DW$87        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$87, DW_AT_name("all")
     946                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
     947                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$88        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$40)
     952                      .dwattr $C$DW$88, DW_AT_name("bit")
     953                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
     954                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957                      .dwendtag $C$DW$T$41
     958              
     959              
     960              $C$DW$T$42      .dwtag  DW_TAG_structure_type
     961                      .dwattr $C$DW$T$42, DW_AT_name("PCLKCR1_BITS")
     962                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
     963              $C$DW$89        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$89, DW_AT_name("EPWM1ENCLK")
     966                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_EPWM1ENCLK")
     967                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0f)
     968                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     969                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$90        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$90, DW_AT_name("EPWM2ENCLK")
     975                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_EPWM2ENCLK")
     976                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   19

     977                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     978                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981              $C$DW$91        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$91, DW_AT_name("EPWM3ENCLK")
     984                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_EPWM3ENCLK")
     985                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0d)
     986                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990              $C$DW$92        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$92, DW_AT_name("EPWM4ENCLK")
     993                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_EPWM4ENCLK")
     994                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0c)
     995                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     996                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     998              
     999              $C$DW$93        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$93, DW_AT_name("EPWM5ENCLK")
    1002                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_EPWM5ENCLK")
    1003                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0b)
    1004                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1005                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$94        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$94, DW_AT_name("EPWM6ENCLK")
    1011                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EPWM6ENCLK")
    1012                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
    1013                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$95        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$95, DW_AT_name("EPWM7ENCLK")
    1020                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_EPWM7ENCLK")
    1021                      .dwattr $C$DW$95, DW_AT_bit_offset(0x09)
    1022                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$96        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$96, DW_AT_name("EPWM8ENCLK")
    1029                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_EPWM8ENCLK")
    1030                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08)
    1031                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   20

    1032                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$97        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$97, DW_AT_name("ECAP1ENCLK")
    1038                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ECAP1ENCLK")
    1039                      .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1040                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044              $C$DW$98        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1046                      .dwattr $C$DW$98, DW_AT_name("ECAP2ENCLK")
    1047                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ECAP2ENCLK")
    1048                      .dwattr $C$DW$98, DW_AT_bit_offset(0x06)
    1049                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$99        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$99, DW_AT_name("ECAP3ENCLK")
    1056                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ECAP3ENCLK")
    1057                      .dwattr $C$DW$99, DW_AT_bit_offset(0x05)
    1058                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$100       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1065                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    1066                      .dwattr $C$DW$100, DW_AT_bit_offset(0x02)
    1067                      .dwattr $C$DW$100, DW_AT_bit_size(0x03)
    1068                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1070              
    1071              $C$DW$101       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$101, DW_AT_name("EQEP1ENCLK")
    1074                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_EQEP1ENCLK")
    1075                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    1076                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$102       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$102, DW_AT_name("EQEP2ENCLK")
    1083                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_EQEP2ENCLK")
    1084                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1085                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1086                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   21

    1087                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089                      .dwendtag $C$DW$T$42
    1090              
    1091              
    1092              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1093                      .dwattr $C$DW$T$43, DW_AT_name("PCLKCR1_REG")
    1094                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1095              $C$DW$103       .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$103, DW_AT_name("all")
    1098                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1099                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$104       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$42)
    1104                      .dwattr $C$DW$104, DW_AT_name("bit")
    1105                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1106                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109                      .dwendtag $C$DW$T$43
    1110              
    1111              
    1112              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1113                      .dwattr $C$DW$T$44, DW_AT_name("PCLKCR2_BITS")
    1114                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1115              $C$DW$105       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    1118                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    1119                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1120                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    1121                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$106       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$106, DW_AT_name("HRCAP1ENCLK")
    1127                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_HRCAP1ENCLK")
    1128                      .dwattr $C$DW$106, DW_AT_bit_offset(0x07)
    1129                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1130                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$107       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$107, DW_AT_name("HRCAP2ENCLK")
    1136                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_HRCAP2ENCLK")
    1137                      .dwattr $C$DW$107, DW_AT_bit_offset(0x06)
    1138                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1139                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1141              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   22

    1142              $C$DW$108       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$108, DW_AT_name("HRCAP3ENCLK")
    1145                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_HRCAP3ENCLK")
    1146                      .dwattr $C$DW$108, DW_AT_bit_offset(0x05)
    1147                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1148                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$109       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$109, DW_AT_name("HRCAP4ENCLK")
    1154                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_HRCAP4ENCLK")
    1155                      .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    1156                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$110       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1163                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1164                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1165                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1166                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169                      .dwendtag $C$DW$T$44
    1170              
    1171              
    1172              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1173                      .dwattr $C$DW$T$45, DW_AT_name("PCLKCR2_REG")
    1174                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1175              $C$DW$111       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$111, DW_AT_name("all")
    1178                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1179                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$112       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$44)
    1184                      .dwattr $C$DW$112, DW_AT_name("bit")
    1185                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1186                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1188              
    1189                      .dwendtag $C$DW$T$45
    1190              
    1191              
    1192              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1193                      .dwattr $C$DW$T$46, DW_AT_name("PCLKCR3_BITS")
    1194                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1195              $C$DW$113       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   23

    1197                      .dwattr $C$DW$113, DW_AT_name("COMP1ENCLK")
    1198                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_COMP1ENCLK")
    1199                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1200                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1201                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204              $C$DW$114       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$114, DW_AT_name("COMP2ENCLK")
    1207                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_COMP2ENCLK")
    1208                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e)
    1209                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1210                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1211                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213              $C$DW$115       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$115, DW_AT_name("COMP3ENCLK")
    1216                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_COMP3ENCLK")
    1217                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d)
    1218                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1219                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1221              
    1222              $C$DW$116       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1225                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1226                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1227                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    1228                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1230              
    1231              $C$DW$117       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$117, DW_AT_name("CPUTIMER0ENCLK")
    1234                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CPUTIMER0ENCLK")
    1235                      .dwattr $C$DW$117, DW_AT_bit_offset(0x07)
    1236                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1237                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1239              
    1240              $C$DW$118       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$118, DW_AT_name("CPUTIMER1ENCLK")
    1243                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CPUTIMER1ENCLK")
    1244                      .dwattr $C$DW$118, DW_AT_bit_offset(0x06)
    1245                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1246                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1248              
    1249              $C$DW$119       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$119, DW_AT_name("CPUTIMER2ENCLK")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   24

    1252                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CPUTIMER2ENCLK")
    1253                      .dwattr $C$DW$119, DW_AT_bit_offset(0x05)
    1254                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1255                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258              $C$DW$120       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$120, DW_AT_name("DMAENCLK")
    1261                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_DMAENCLK")
    1262                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1263                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1264                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1266              
    1267              $C$DW$121       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1270                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1271                      .dwattr $C$DW$121, DW_AT_bit_offset(0x03)
    1272                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1273                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$122       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$122, DW_AT_name("rsvd3")
    1279                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd3")
    1280                      .dwattr $C$DW$122, DW_AT_bit_offset(0x02)
    1281                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1282                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285              $C$DW$123       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$123, DW_AT_name("CLA1ENCLK")
    1288                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CLA1ENCLK")
    1289                      .dwattr $C$DW$123, DW_AT_bit_offset(0x01)
    1290                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1291                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1293              
    1294              $C$DW$124       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$124, DW_AT_name("USB0ENCLK")
    1297                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_USB0ENCLK")
    1298                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1299                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1300                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303                      .dwendtag $C$DW$T$46
    1304              
    1305              
    1306              $C$DW$T$47      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   25

    1307                      .dwattr $C$DW$T$47, DW_AT_name("PCLKCR3_REG")
    1308                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1309              $C$DW$125       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$125, DW_AT_name("all")
    1312                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1313                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1315              
    1316              $C$DW$126       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$46)
    1318                      .dwattr $C$DW$126, DW_AT_name("bit")
    1319                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1320                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1322              
    1323                      .dwendtag $C$DW$T$47
    1324              
    1325              
    1326              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1327                      .dwattr $C$DW$T$48, DW_AT_name("PLL2CTL_BITS")
    1328                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1329              $C$DW$127       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$127, DW_AT_name("PLL2CLKSRCSEL")
    1332                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PLL2CLKSRCSEL")
    1333                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e)
    1334                      .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    1335                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$128       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$128, DW_AT_name("PLL2EN")
    1341                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PLL2EN")
    1342                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d)
    1343                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1344                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1346              
    1347              $C$DW$129       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    1350                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    1351                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    1352                      .dwattr $C$DW$129, DW_AT_bit_size(0x0d)
    1353                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356                      .dwendtag $C$DW$T$48
    1357              
    1358              
    1359              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1360                      .dwattr $C$DW$T$49, DW_AT_name("PLL2CTL_REG")
    1361                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   26

    1362              $C$DW$130       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$130, DW_AT_name("all")
    1365                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_all")
    1366                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1368              
    1369              $C$DW$131       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$48)
    1371                      .dwattr $C$DW$131, DW_AT_name("bit")
    1372                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_bit")
    1373                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376                      .dwendtag $C$DW$T$49
    1377              
    1378              
    1379              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1380                      .dwattr $C$DW$T$50, DW_AT_name("PLL2MULT_BITS")
    1381                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1382              $C$DW$132       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1384                      .dwattr $C$DW$132, DW_AT_name("PLL2MULT")
    1385                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PLL2MULT")
    1386                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c)
    1387                      .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    1388                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1390              
    1391              $C$DW$133       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    1394                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    1395                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    1396                      .dwattr $C$DW$133, DW_AT_bit_size(0x0c)
    1397                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1399              
    1400                      .dwendtag $C$DW$T$50
    1401              
    1402              
    1403              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1404                      .dwattr $C$DW$T$51, DW_AT_name("PLL2MULT_REG")
    1405                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1406              $C$DW$134       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$134, DW_AT_name("all")
    1409                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    1410                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$135       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$50)
    1415                      .dwattr $C$DW$135, DW_AT_name("bit")
    1416                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initClock.asm                                                        PAGE   27

    1417                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420                      .dwendtag $C$DW$T$51
    1421              
    1422              
    1423              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1424                      .dwattr $C$DW$T$52, DW_AT_name("PLL2STS_BITS")
    1425                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1426              $C$DW$136       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1428                      .dwattr $C$DW$136, DW_AT_name("PLL2LOCKS")
    1429                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PLL2LOCKS")
    1430                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
    1431                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1432                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1434              
