TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 20:54:16 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initTimer.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("CpuTimer1Regs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CpuTimer1Regs")

      47              ;***************************************************************
      48              ;* FNAME: _initTimer                    FR SIZE:   0           *
      49              ;*                                                             *
      50              ;* FUNCTION ENVIRONMENT                                        *
      51              ;*                                                             *
      52              ;* FUNCTION PROPERTIES                                         *
      53              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      54              ;***************************************************************
      55              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    2

      56 00000000       _initTimer:
      57              ;* AR5   assigned to $O$C1
      58                      .dwcfi  cfa_offset, -2
      59                      .dwcfi  save_reg_to_mem, 26, 0
      60 00000000 761F!         MOVW      DP,#_SysCtrlRegs+16   ; [CPU_U] 
         00000001 0000 
      61                      .dwpsn  file "../source/initTimer.c",line 18,column 5,is_stmt,isa 0
      62 00000002 8F40!         MOVL      XAR5,#_CpuTimer1Regs  ; [CPU_U] |18| 
         00000003 0000 
      63                      .dwpsn  file "../source/initTimer.c",line 11,column 5,is_stmt,isa 0
      64 00000004 1A10!         OR        @_SysCtrlRegs+16,#0x0200 ; [CPU_] |11| 
         00000005 0200 
      65                      .dwpsn  file "../source/initTimer.c",line 18,column 5,is_stmt,isa 0
      66 00000006 8AA5          MOVL      XAR4,XAR5             ; [CPU_] |18| 
      67 00000007 761F!         MOVW      DP,#_CpuTimer1Regs+3  ; [CPU_U] 
         00000008 0000 
      68                      .dwpsn  file "../source/initTimer.c",line 14,column 5,is_stmt,isa 0
      69 00000009 56BF!         MOVB      @_CpuTimer1Regs+3,#32,UNC ; [CPU_] |14| 
         0000000a 2003 
      70                      .dwpsn  file "../source/initTimer.c",line 15,column 5,is_stmt,isa 0
      71 0000000b 2802!         MOV       @_CpuTimer1Regs+2,#23039 ; [CPU_] |15| 
         0000000c 59FF 
      72                      .dwpsn  file "../source/initTimer.c",line 18,column 5,is_stmt,isa 0
      73 0000000d DC07          ADDB      XAR4,#7               ; [CPU_] |18| 
      74 0000000e 18C4          AND       *+XAR4[0],#0xff00     ; [CPU_] |18| 
         0000000f FF00 
      75                      .dwpsn  file "../source/initTimer.c",line 19,column 5,is_stmt,isa 0
      76 00000010 18F5          AND       *+XAR5[6],#0xff00     ; [CPU_] |19| 
         00000011 FF00 
      77                      .dwpsn  file "../source/initTimer.c",line 22,column 5,is_stmt,isa 0
      78 00000012 1AE5          OR        *+XAR5[4],#0x0010     ; [CPU_] |22| 
         00000013 0010 
      79                      .dwpsn  file "../source/initTimer.c",line 23,column 5,is_stmt,isa 0
      80 00000014 1A04!         OR        @_CpuTimer1Regs+4,#0x0020 ; [CPU_] |23| 
         00000015 0020 
      81                      .dwpsn  file "../source/initTimer.c",line 24,column 5,is_stmt,isa 0
      82 00000016 1804!         AND       @_CpuTimer1Regs+4,#0xfbff ; [CPU_] |24| 
         00000017 FBFF 
      83                      .dwpsn  file "../source/initTimer.c",line 25,column 5,is_stmt,isa 0
      84 00000018 1A04!         OR        @_CpuTimer1Regs+4,#0x0800 ; [CPU_] |25| 
         00000019 0800 
      85                      .dwpsn  file "../source/initTimer.c",line 26,column 5,is_stmt,isa 0
      86 0000001a 1A04!         OR        @_CpuTimer1Regs+4,#0x4000 ; [CPU_] |26| 
         0000001b 4000 
      87              $C$DW$4 .dwtag  DW_TAG_TI_branch
      88                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
      89                      .dwattr $C$DW$4, DW_AT_TI_return
      90              
      91 0000001c 0006          LRETR     ; [CPU_] 
      92                      ; return occurs ; [] 
      93                      .dwattr $C$DW$3, DW_AT_TI_end_file("../source/initTimer.c")
      94                      .dwattr $C$DW$3, DW_AT_TI_end_line(0x1e)
      95                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
      96                      .dwendentry
      97                      .dwendtag $C$DW$3
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    3

      98              
      99              ;**************************************************************
     100              ;* UNDEFINED EXTERNAL REFERENCES                              *
     101              ;**************************************************************
     102                      .global _CpuTimer1Regs
     103                      .global _SysCtrlRegs
     104              
     105              ;***************************************************************
     106              ;* TYPE INFORMATION                                            *
     107              ;***************************************************************
     108              
     109              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     110                      .dwattr $C$DW$T$20, DW_AT_name("CLKCTL_BITS")
     111                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     112              $C$DW$5 .dwtag  DW_TAG_member
     113                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     114                      .dwattr $C$DW$5, DW_AT_name("OSCCLKSRCSEL")
     115                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     116                      .dwattr $C$DW$5, DW_AT_bit_offset(0x0f)
     117                      .dwattr $C$DW$5, DW_AT_bit_size(0x01)
     118                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     119                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     120              
     121              $C$DW$6 .dwtag  DW_TAG_member
     122                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     123                      .dwattr $C$DW$6, DW_AT_name("OSCCLKSRC2SEL")
     124                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     125                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0e)
     126                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     127                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     128                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     129              
     130              $C$DW$7 .dwtag  DW_TAG_member
     131                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     132                      .dwattr $C$DW$7, DW_AT_name("WDCLKSRCSEL")
     133                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     134                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0d)
     135                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     136                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     137                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     138              
     139              $C$DW$8 .dwtag  DW_TAG_member
     140                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     141                      .dwattr $C$DW$8, DW_AT_name("TMR2CLKSRCSEL")
     142                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     143                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0b)
     144                      .dwattr $C$DW$8, DW_AT_bit_size(0x02)
     145                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     146                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     147              
     148              $C$DW$9 .dwtag  DW_TAG_member
     149                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     150                      .dwattr $C$DW$9, DW_AT_name("TMR2CLKPRESCALE")
     151                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     152                      .dwattr $C$DW$9, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    4

     153                      .dwattr $C$DW$9, DW_AT_bit_size(0x03)
     154                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     155                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     156              
     157              $C$DW$10        .dwtag  DW_TAG_member
     158                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     159                      .dwattr $C$DW$10, DW_AT_name("INTOSC1OFF")
     160                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_INTOSC1OFF")
     161                      .dwattr $C$DW$10, DW_AT_bit_offset(0x07)
     162                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     163                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     164                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     165              
     166              $C$DW$11        .dwtag  DW_TAG_member
     167                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     168                      .dwattr $C$DW$11, DW_AT_name("INTOSC1HALTI")
     169                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     170                      .dwattr $C$DW$11, DW_AT_bit_offset(0x06)
     171                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     172                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     173                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     174              
     175              $C$DW$12        .dwtag  DW_TAG_member
     176                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     177                      .dwattr $C$DW$12, DW_AT_name("INTOSC2OFF")
     178                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_INTOSC2OFF")
     179                      .dwattr $C$DW$12, DW_AT_bit_offset(0x05)
     180                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     181                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     182                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     183              
     184              $C$DW$13        .dwtag  DW_TAG_member
     185                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     186                      .dwattr $C$DW$13, DW_AT_name("INTOSC2HALTI")
     187                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     188                      .dwattr $C$DW$13, DW_AT_bit_offset(0x04)
     189                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     190                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     191                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     192              
     193              $C$DW$14        .dwtag  DW_TAG_member
     194                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     195                      .dwattr $C$DW$14, DW_AT_name("WDHALTI")
     196                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_WDHALTI")
     197                      .dwattr $C$DW$14, DW_AT_bit_offset(0x03)
     198                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     199                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     200                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     201              
     202              $C$DW$15        .dwtag  DW_TAG_member
     203                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     204                      .dwattr $C$DW$15, DW_AT_name("XCLKINOFF")
     205                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_XCLKINOFF")
     206                      .dwattr $C$DW$15, DW_AT_bit_offset(0x02)
     207                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    5

     208                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     209                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     210              
     211              $C$DW$16        .dwtag  DW_TAG_member
     212                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     213                      .dwattr $C$DW$16, DW_AT_name("XTALOSCOFF")
     214                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_XTALOSCOFF")
     215                      .dwattr $C$DW$16, DW_AT_bit_offset(0x01)
     216                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     217                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     218                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     219              
     220              $C$DW$17        .dwtag  DW_TAG_member
     221                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     222                      .dwattr $C$DW$17, DW_AT_name("NMIRESETSEL")
     223                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_NMIRESETSEL")
     224                      .dwattr $C$DW$17, DW_AT_bit_offset(0x00)
     225                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     226                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     227                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     228              
     229                      .dwendtag $C$DW$T$20
     230              
     231              
     232              $C$DW$T$21      .dwtag  DW_TAG_union_type
     233                      .dwattr $C$DW$T$21, DW_AT_name("CLKCTL_REG")
     234                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     235              $C$DW$18        .dwtag  DW_TAG_member
     236                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     237                      .dwattr $C$DW$18, DW_AT_name("all")
     238                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_all")
     239                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     240                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     241              
     242              $C$DW$19        .dwtag  DW_TAG_member
     243                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     244                      .dwattr $C$DW$19, DW_AT_name("bit")
     245                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_bit")
     246                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     247                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     248              
     249                      .dwendtag $C$DW$T$21
     250              
     251              
     252              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     253                      .dwattr $C$DW$T$22, DW_AT_name("CPUTIMER_REGS")
     254                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     255              $C$DW$20        .dwtag  DW_TAG_member
     256                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$62)
     257                      .dwattr $C$DW$20, DW_AT_name("TIM")
     258                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_TIM")
     259                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     261              
     262              $C$DW$21        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    6

     263                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$54)
     264                      .dwattr $C$DW$21, DW_AT_name("PRD")
     265                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_PRD")
     266                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     267                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     268              
     269              $C$DW$22        .dwtag  DW_TAG_member
     270                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$61)
     271                      .dwattr $C$DW$22, DW_AT_name("TCR")
     272                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_TCR")
     273                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     274                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     275              
     276              $C$DW$23        .dwtag  DW_TAG_member
     277                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     278                      .dwattr $C$DW$23, DW_AT_name("rsvd1")
     279                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd1")
     280                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     281                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     282              
     283              $C$DW$24        .dwtag  DW_TAG_member
     284                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$67)
     285                      .dwattr $C$DW$24, DW_AT_name("TPR")
     286                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_TPR")
     287                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     288                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     289              
     290              $C$DW$25        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$65)
     292                      .dwattr $C$DW$25, DW_AT_name("TPRH")
     293                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_TPRH")
     294                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     295                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     296              
     297                      .dwendtag $C$DW$T$22
     298              
     299              $C$DW$26        .dwtag  DW_TAG_TI_far_type
     300                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     301              
     302              $C$DW$T$70      .dwtag  DW_TAG_volatile_type
     303                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$26)
     304              
     305              
     306              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     307                      .dwattr $C$DW$T$23, DW_AT_name("EPWMCFG_BITS")
     308                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     309              $C$DW$27        .dwtag  DW_TAG_member
     310                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     311                      .dwattr $C$DW$27, DW_AT_name("CONFIG")
     312                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_CONFIG")
     313                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0f)
     314                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     315                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     317              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    7

     318              $C$DW$28        .dwtag  DW_TAG_member
     319                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     320                      .dwattr $C$DW$28, DW_AT_name("rsvd1")
     321                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd1")
     322                      .dwattr $C$DW$28, DW_AT_bit_offset(0x00)
     323                      .dwattr $C$DW$28, DW_AT_bit_size(0x0f)
     324                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     325                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     326              
     327                      .dwendtag $C$DW$T$23
     328              
     329              
     330              $C$DW$T$24      .dwtag  DW_TAG_union_type
     331                      .dwattr $C$DW$T$24, DW_AT_name("EPWMCFG_REG")
     332                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     333              $C$DW$29        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     335                      .dwattr $C$DW$29, DW_AT_name("all")
     336                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_all")
     337                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     338                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     339              
     340              $C$DW$30        .dwtag  DW_TAG_member
     341                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$23)
     342                      .dwattr $C$DW$30, DW_AT_name("bit")
     343                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_bit")
     344                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     345                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     346              
     347                      .dwendtag $C$DW$T$24
     348              
     349              
     350              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     351                      .dwattr $C$DW$T$25, DW_AT_name("INTOSC1TRIM_BITS")
     352                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     353              $C$DW$31        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     355                      .dwattr $C$DW$31, DW_AT_name("COARSETRIM")
     356                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_COARSETRIM")
     357                      .dwattr $C$DW$31, DW_AT_bit_offset(0x08)
     358                      .dwattr $C$DW$31, DW_AT_bit_size(0x08)
     359                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$32        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$32, DW_AT_name("rsvd1")
     365                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd1")
     366                      .dwattr $C$DW$32, DW_AT_bit_offset(0x07)
     367                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     368                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     370              
     371              $C$DW$33        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    8

     373                      .dwattr $C$DW$33, DW_AT_name("FINETRIM")
     374                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_FINETRIM")
     375                      .dwattr $C$DW$33, DW_AT_bit_offset(0x01)
     376                      .dwattr $C$DW$33, DW_AT_bit_size(0x06)
     377                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     378                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     379              
     380              $C$DW$34        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     382                      .dwattr $C$DW$34, DW_AT_name("rsvd2")
     383                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd2")
     384                      .dwattr $C$DW$34, DW_AT_bit_offset(0x00)
     385                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     386                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     387                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389                      .dwendtag $C$DW$T$25
     390              
     391              
     392              $C$DW$T$26      .dwtag  DW_TAG_union_type
     393                      .dwattr $C$DW$T$26, DW_AT_name("INTOSC1TRIM_REG")
     394                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     395              $C$DW$35        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     397                      .dwattr $C$DW$35, DW_AT_name("all")
     398                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_all")
     399                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     400                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     401              
     402              $C$DW$36        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
     404                      .dwattr $C$DW$36, DW_AT_name("bit")
     405                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_bit")
     406                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     407                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     408              
     409                      .dwendtag $C$DW$T$26
     410              
     411              
     412              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     413                      .dwattr $C$DW$T$27, DW_AT_name("INTOSC2TRIM_BITS")
     414                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     415              $C$DW$37        .dwtag  DW_TAG_member
     416                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     417                      .dwattr $C$DW$37, DW_AT_name("COARSETRIM")
     418                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_COARSETRIM")
     419                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08)
     420                      .dwattr $C$DW$37, DW_AT_bit_size(0x08)
     421                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     422                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     423              
     424              $C$DW$38        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     426                      .dwattr $C$DW$38, DW_AT_name("rsvd1")
     427                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE    9

     428                      .dwattr $C$DW$38, DW_AT_bit_offset(0x07)
     429                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     430                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     432              
     433              $C$DW$39        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$39, DW_AT_name("FINETRIM")
     436                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_FINETRIM")
     437                      .dwattr $C$DW$39, DW_AT_bit_offset(0x01)
     438                      .dwattr $C$DW$39, DW_AT_bit_size(0x06)
     439                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     440                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     441              
     442              $C$DW$40        .dwtag  DW_TAG_member
     443                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     444                      .dwattr $C$DW$40, DW_AT_name("rsvd2")
     445                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd2")
     446                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     447                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     448                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     449                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     450              
     451                      .dwendtag $C$DW$T$27
     452              
     453              
     454              $C$DW$T$28      .dwtag  DW_TAG_union_type
     455                      .dwattr $C$DW$T$28, DW_AT_name("INTOSC2TRIM_REG")
     456                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     457              $C$DW$41        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$41, DW_AT_name("all")
     460                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     461                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     463              
     464              $C$DW$42        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$27)
     466                      .dwattr $C$DW$42, DW_AT_name("bit")
     467                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     468                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471                      .dwendtag $C$DW$T$28
     472              
     473              
     474              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     475                      .dwattr $C$DW$T$29, DW_AT_name("JTAGDEBUG_BITS")
     476                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     477              $C$DW$43        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     479                      .dwattr $C$DW$43, DW_AT_name("JTAGDIS")
     480                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_JTAGDIS")
     481                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f)
     482                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   10

     483                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     485              
     486              $C$DW$44        .dwtag  DW_TAG_member
     487                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     488                      .dwattr $C$DW$44, DW_AT_name("rsvd1")
     489                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd1")
     490                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     491                      .dwattr $C$DW$44, DW_AT_bit_size(0x0f)
     492                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495                      .dwendtag $C$DW$T$29
     496              
     497              
     498              $C$DW$T$30      .dwtag  DW_TAG_union_type
     499                      .dwattr $C$DW$T$30, DW_AT_name("JTAGDEBUG_REG")
     500                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     501              $C$DW$45        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     503                      .dwattr $C$DW$45, DW_AT_name("all")
     504                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_all")
     505                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     506                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     507              
     508              $C$DW$46        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$29)
     510                      .dwattr $C$DW$46, DW_AT_name("bit")
     511                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_bit")
     512                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     514              
     515                      .dwendtag $C$DW$T$30
     516              
     517              
     518              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     519                      .dwattr $C$DW$T$31, DW_AT_name("LOSPCP_BITS")
     520                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     521              $C$DW$47        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     523                      .dwattr $C$DW$47, DW_AT_name("LSPCLK")
     524                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_LSPCLK")
     525                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0d)
     526                      .dwattr $C$DW$47, DW_AT_bit_size(0x03)
     527                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$48        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$48, DW_AT_name("rsvd1")
     533                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd1")
     534                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00)
     535                      .dwattr $C$DW$48, DW_AT_bit_size(0x0d)
     536                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   11

     538              
     539                      .dwendtag $C$DW$T$31
     540              
     541              
     542              $C$DW$T$32      .dwtag  DW_TAG_union_type
     543                      .dwattr $C$DW$T$32, DW_AT_name("LOSPCP_REG")
     544                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     545              $C$DW$49        .dwtag  DW_TAG_member
     546                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     547                      .dwattr $C$DW$49, DW_AT_name("all")
     548                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     549                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     551              
     552              $C$DW$50        .dwtag  DW_TAG_member
     553                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$31)
     554                      .dwattr $C$DW$50, DW_AT_name("bit")
     555                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     556                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559                      .dwendtag $C$DW$T$32
     560              
     561              
     562              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     563                      .dwattr $C$DW$T$33, DW_AT_name("LPMCR0_BITS")
     564                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     565              $C$DW$51        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$51, DW_AT_name("LPM")
     568                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_LPM")
     569                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0e)
     570                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
     571                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$52        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$52, DW_AT_name("QUALSTDBY")
     577                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_QUALSTDBY")
     578                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     579                      .dwattr $C$DW$52, DW_AT_bit_size(0x06)
     580                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583              $C$DW$53        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$53, DW_AT_name("rsvd1")
     586                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd1")
     587                      .dwattr $C$DW$53, DW_AT_bit_offset(0x01)
     588                      .dwattr $C$DW$53, DW_AT_bit_size(0x07)
     589                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     591              
     592              $C$DW$54        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   12

     593                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     594                      .dwattr $C$DW$54, DW_AT_name("WDINTE")
     595                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_WDINTE")
     596                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00)
     597                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     598                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     600              
     601                      .dwendtag $C$DW$T$33
     602              
     603              
     604              $C$DW$T$34      .dwtag  DW_TAG_union_type
     605                      .dwattr $C$DW$T$34, DW_AT_name("LPMCR0_REG")
     606                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     607              $C$DW$55        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$55, DW_AT_name("all")
     610                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     611                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     613              
     614              $C$DW$56        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$33)
     616                      .dwattr $C$DW$56, DW_AT_name("bit")
     617                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     618                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     620              
     621                      .dwendtag $C$DW$T$34
     622              
     623              
     624              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     625                      .dwattr $C$DW$T$35, DW_AT_name("PCLKCR0_BITS")
     626                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     627              $C$DW$57        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     629                      .dwattr $C$DW$57, DW_AT_name("HRPWMENCLK")
     630                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_HRPWMENCLK")
     631                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0f)
     632                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     633                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     635              
     636              $C$DW$58        .dwtag  DW_TAG_member
     637                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     638                      .dwattr $C$DW$58, DW_AT_name("rsvd1")
     639                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd1")
     640                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0e)
     641                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     642                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645              $C$DW$59        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$59, DW_AT_name("TBCLKSYNC")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   13

     648                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_TBCLKSYNC")
     649                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0d)
     650                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     651                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$60        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     656                      .dwattr $C$DW$60, DW_AT_name("ADCENCLK")
     657                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_ADCENCLK")
     658                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0c)
     659                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     660                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     661                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     662              
     663              $C$DW$61        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$61, DW_AT_name("I2CAENCLK")
     666                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_I2CAENCLK")
     667                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0b)
     668                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     669                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     671              
     672              $C$DW$62        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$62, DW_AT_name("rsvd2")
     675                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd2")
     676                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0a)
     677                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     678                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     680              
     681              $C$DW$63        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     683                      .dwattr $C$DW$63, DW_AT_name("rsvd3")
     684                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd3")
     685                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
     686                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     687                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     689              
     690              $C$DW$64        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$64, DW_AT_name("SPIAENCLK")
     693                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_SPIAENCLK")
     694                      .dwattr $C$DW$64, DW_AT_bit_offset(0x07)
     695                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699              $C$DW$65        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$65, DW_AT_name("SPIBENCLK")
     702                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SPIBENCLK")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   14

     703                      .dwattr $C$DW$65, DW_AT_bit_offset(0x06)
     704                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     705                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     707              
     708              $C$DW$66        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$66, DW_AT_name("SCIAENCLK")
     711                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SCIAENCLK")
     712                      .dwattr $C$DW$66, DW_AT_bit_offset(0x05)
     713                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     714                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     716              
     717              $C$DW$67        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     719                      .dwattr $C$DW$67, DW_AT_name("SCIBENCLK")
     720                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_SCIBENCLK")
     721                      .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
     722                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     723                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     725              
     726              $C$DW$68        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$68, DW_AT_name("MCBSPAENCLK")
     729                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_MCBSPAENCLK")
     730                      .dwattr $C$DW$68, DW_AT_bit_offset(0x03)
     731                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     732                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735              $C$DW$69        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$69, DW_AT_name("rsvd4")
     738                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd4")
     739                      .dwattr $C$DW$69, DW_AT_bit_offset(0x02)
     740                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     741                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     743              
     744              $C$DW$70        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$70, DW_AT_name("ECANAENCLK")
     747                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ECANAENCLK")
     748                      .dwattr $C$DW$70, DW_AT_bit_offset(0x01)
     749                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     750                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     752              
     753              $C$DW$71        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     755                      .dwattr $C$DW$71, DW_AT_name("rsvd5")
     756                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd5")
     757                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   15

     758                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     759                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     761              
     762                      .dwendtag $C$DW$T$35
     763              
     764              
     765              $C$DW$T$36      .dwtag  DW_TAG_union_type
     766                      .dwattr $C$DW$T$36, DW_AT_name("PCLKCR0_REG")
     767                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     768              $C$DW$72        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$72, DW_AT_name("all")
     771                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
     772                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     774              
     775              $C$DW$73        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$35)
     777                      .dwattr $C$DW$73, DW_AT_name("bit")
     778                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
     779                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     780                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     781              
     782                      .dwendtag $C$DW$T$36
     783              
     784              
     785              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     786                      .dwattr $C$DW$T$37, DW_AT_name("PCLKCR1_BITS")
     787                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     788              $C$DW$74        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$74, DW_AT_name("EPWM1ENCLK")
     791                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_EPWM1ENCLK")
     792                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0f)
     793                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     794                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$75        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$75, DW_AT_name("EPWM2ENCLK")
     800                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_EPWM2ENCLK")
     801                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0e)
     802                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     803                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     805              
     806              $C$DW$76        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     808                      .dwattr $C$DW$76, DW_AT_name("EPWM3ENCLK")
     809                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_EPWM3ENCLK")
     810                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0d)
     811                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     812                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   16

     813                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     814              
     815              $C$DW$77        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$77, DW_AT_name("EPWM4ENCLK")
     818                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_EPWM4ENCLK")
     819                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c)
     820                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     821                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$78        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$78, DW_AT_name("EPWM5ENCLK")
     827                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_EPWM5ENCLK")
     828                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0b)
     829                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     830                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     832              
     833              $C$DW$79        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$79, DW_AT_name("EPWM6ENCLK")
     836                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_EPWM6ENCLK")
     837                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0a)
     838                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     839                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     841              
     842              $C$DW$80        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$80, DW_AT_name("EPWM7ENCLK")
     845                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_EPWM7ENCLK")
     846                      .dwattr $C$DW$80, DW_AT_bit_offset(0x09)
     847                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     848                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     850              
     851              $C$DW$81        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$81, DW_AT_name("EPWM8ENCLK")
     854                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_EPWM8ENCLK")
     855                      .dwattr $C$DW$81, DW_AT_bit_offset(0x08)
     856                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     857                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860              $C$DW$82        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$82, DW_AT_name("ECAP1ENCLK")
     863                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ECAP1ENCLK")
     864                      .dwattr $C$DW$82, DW_AT_bit_offset(0x07)
     865                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     866                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   17

     868              
     869              $C$DW$83        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$83, DW_AT_name("ECAP2ENCLK")
     872                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ECAP2ENCLK")
     873                      .dwattr $C$DW$83, DW_AT_bit_offset(0x06)
     874                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     875                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     877              
     878              $C$DW$84        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$84, DW_AT_name("ECAP3ENCLK")
     881                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ECAP3ENCLK")
     882                      .dwattr $C$DW$84, DW_AT_bit_offset(0x05)
     883                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     884                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     886              
     887              $C$DW$85        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
     890                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
     891                      .dwattr $C$DW$85, DW_AT_bit_offset(0x02)
     892                      .dwattr $C$DW$85, DW_AT_bit_size(0x03)
     893                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     895              
     896              $C$DW$86        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$86, DW_AT_name("EQEP1ENCLK")
     899                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_EQEP1ENCLK")
     900                      .dwattr $C$DW$86, DW_AT_bit_offset(0x01)
     901                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     902                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     904              
     905              $C$DW$87        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$87, DW_AT_name("EQEP2ENCLK")
     908                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_EQEP2ENCLK")
     909                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
     910                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     911                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     913              
     914                      .dwendtag $C$DW$T$37
     915              
     916              
     917              $C$DW$T$38      .dwtag  DW_TAG_union_type
     918                      .dwattr $C$DW$T$38, DW_AT_name("PCLKCR1_REG")
     919                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     920              $C$DW$88        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$88, DW_AT_name("all")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   18

     923                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
     924                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     925                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$89        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$37)
     929                      .dwattr $C$DW$89, DW_AT_name("bit")
     930                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
     931                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934                      .dwendtag $C$DW$T$38
     935              
     936              
     937              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     938                      .dwattr $C$DW$T$39, DW_AT_name("PCLKCR2_BITS")
     939                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     940              $C$DW$90        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$90, DW_AT_name("rsvd1")
     943                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd1")
     944                      .dwattr $C$DW$90, DW_AT_bit_offset(0x08)
     945                      .dwattr $C$DW$90, DW_AT_bit_size(0x08)
     946                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$91        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$91, DW_AT_name("HRCAP1ENCLK")
     952                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_HRCAP1ENCLK")
     953                      .dwattr $C$DW$91, DW_AT_bit_offset(0x07)
     954                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     955                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$92        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$92, DW_AT_name("HRCAP2ENCLK")
     961                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_HRCAP2ENCLK")
     962                      .dwattr $C$DW$92, DW_AT_bit_offset(0x06)
     963                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     964                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     966              
     967              $C$DW$93        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$93, DW_AT_name("HRCAP3ENCLK")
     970                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_HRCAP3ENCLK")
     971                      .dwattr $C$DW$93, DW_AT_bit_offset(0x05)
     972                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
     973                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$94        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   19

     978                      .dwattr $C$DW$94, DW_AT_name("HRCAP4ENCLK")
     979                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_HRCAP4ENCLK")
     980                      .dwattr $C$DW$94, DW_AT_bit_offset(0x04)
     981                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
     982                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     984              
     985              $C$DW$95        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     987                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
     988                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
     989                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
     990                      .dwattr $C$DW$95, DW_AT_bit_size(0x04)
     991                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994                      .dwendtag $C$DW$T$39
     995              
     996              
     997              $C$DW$T$40      .dwtag  DW_TAG_union_type
     998                      .dwattr $C$DW$T$40, DW_AT_name("PCLKCR2_REG")
     999                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1000              $C$DW$96        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$96, DW_AT_name("all")
    1003                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1004                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1006              
    1007              $C$DW$97        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$39)
    1009                      .dwattr $C$DW$97, DW_AT_name("bit")
    1010                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1011                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1013              
    1014                      .dwendtag $C$DW$T$40
    1015              
    1016              
    1017              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1018                      .dwattr $C$DW$T$41, DW_AT_name("PCLKCR3_BITS")
    1019                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1020              $C$DW$98        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1022                      .dwattr $C$DW$98, DW_AT_name("COMP1ENCLK")
    1023                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_COMP1ENCLK")
    1024                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0f)
    1025                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1026                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$99        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$99, DW_AT_name("COMP2ENCLK")
    1032                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_COMP2ENCLK")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   20

    1033                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e)
    1034                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1035                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038              $C$DW$100       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$100, DW_AT_name("COMP3ENCLK")
    1041                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_COMP3ENCLK")
    1042                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0d)
    1043                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1044                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$101       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1050                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    1051                      .dwattr $C$DW$101, DW_AT_bit_offset(0x08)
    1052                      .dwattr $C$DW$101, DW_AT_bit_size(0x05)
    1053                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1055              
    1056              $C$DW$102       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$102, DW_AT_name("CPUTIMER0ENCLK")
    1059                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_CPUTIMER0ENCLK")
    1060                      .dwattr $C$DW$102, DW_AT_bit_offset(0x07)
    1061                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1064              
    1065              $C$DW$103       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$103, DW_AT_name("CPUTIMER1ENCLK")
    1068                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CPUTIMER1ENCLK")
    1069                      .dwattr $C$DW$103, DW_AT_bit_offset(0x06)
    1070                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1071                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1073              
    1074              $C$DW$104       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$104, DW_AT_name("CPUTIMER2ENCLK")
    1077                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CPUTIMER2ENCLK")
    1078                      .dwattr $C$DW$104, DW_AT_bit_offset(0x05)
    1079                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1080                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083              $C$DW$105       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$105, DW_AT_name("DMAENCLK")
    1086                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_DMAENCLK")
    1087                      .dwattr $C$DW$105, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   21

    1088                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$106       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
    1095                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    1096                      .dwattr $C$DW$106, DW_AT_bit_offset(0x03)
    1097                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$107       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$107, DW_AT_name("rsvd3")
    1104                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd3")
    1105                      .dwattr $C$DW$107, DW_AT_bit_offset(0x02)
    1106                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$108       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$108, DW_AT_name("CLA1ENCLK")
    1113                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CLA1ENCLK")
    1114                      .dwattr $C$DW$108, DW_AT_bit_offset(0x01)
    1115                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$109       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$109, DW_AT_name("USB0ENCLK")
    1122                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_USB0ENCLK")
    1123                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    1124                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128                      .dwendtag $C$DW$T$41
    1129              
    1130              
    1131              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1132                      .dwattr $C$DW$T$42, DW_AT_name("PCLKCR3_REG")
    1133                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1134              $C$DW$110       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1136                      .dwattr $C$DW$110, DW_AT_name("all")
    1137                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    1138                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141              $C$DW$111       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   22

    1143                      .dwattr $C$DW$111, DW_AT_name("bit")
    1144                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    1145                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1147              
    1148                      .dwendtag $C$DW$T$42
    1149              
    1150              
    1151              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1152                      .dwattr $C$DW$T$43, DW_AT_name("PLL2CTL_BITS")
    1153                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1154              $C$DW$112       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$112, DW_AT_name("PLL2CLKSRCSEL")
    1157                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PLL2CLKSRCSEL")
    1158                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0e)
    1159                      .dwattr $C$DW$112, DW_AT_bit_size(0x02)
    1160                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$113       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$113, DW_AT_name("PLL2EN")
    1166                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PLL2EN")
    1167                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0d)
    1168                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1169                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$114       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1175                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    1176                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1177                      .dwattr $C$DW$114, DW_AT_bit_size(0x0d)
    1178                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181                      .dwendtag $C$DW$T$43
    1182              
    1183              
    1184              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1185                      .dwattr $C$DW$T$44, DW_AT_name("PLL2CTL_REG")
    1186                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1187              $C$DW$115       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$115, DW_AT_name("all")
    1190                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1191                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194              $C$DW$116       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$43)
    1196                      .dwattr $C$DW$116, DW_AT_name("bit")
    1197                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   23

    1198                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1200              
    1201                      .dwendtag $C$DW$T$44
    1202              
    1203              
    1204              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1205                      .dwattr $C$DW$T$45, DW_AT_name("PLL2MULT_BITS")
    1206                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1207              $C$DW$117       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$117, DW_AT_name("PLL2MULT")
    1210                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PLL2MULT")
    1211                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    1212                      .dwattr $C$DW$117, DW_AT_bit_size(0x04)
    1213                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$118       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1219                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1220                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1221                      .dwattr $C$DW$118, DW_AT_bit_size(0x0c)
    1222                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225                      .dwendtag $C$DW$T$45
    1226              
    1227              
    1228              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1229                      .dwattr $C$DW$T$46, DW_AT_name("PLL2MULT_REG")
    1230                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1231              $C$DW$119       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$119, DW_AT_name("all")
    1234                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1235                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$120       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$45)
    1240                      .dwattr $C$DW$120, DW_AT_name("bit")
    1241                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1242                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1244              
    1245                      .dwendtag $C$DW$T$46
    1246              
    1247              
    1248              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1249                      .dwattr $C$DW$T$47, DW_AT_name("PLL2STS_BITS")
    1250                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1251              $C$DW$121       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   24

    1253                      .dwattr $C$DW$121, DW_AT_name("PLL2LOCKS")
    1254                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PLL2LOCKS")
    1255                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    1256                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1257                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$122       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1263                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    1264                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1265                      .dwattr $C$DW$122, DW_AT_bit_size(0x0f)
    1266                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269                      .dwendtag $C$DW$T$47
    1270              
    1271              
    1272              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1273                      .dwattr $C$DW$T$48, DW_AT_name("PLL2STS_REG")
    1274                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1275              $C$DW$123       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$123, DW_AT_name("all")
    1278                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    1279                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282              $C$DW$124       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$47)
    1284                      .dwattr $C$DW$124, DW_AT_name("bit")
    1285                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1286                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289                      .dwendtag $C$DW$T$48
    1290              
    1291              
    1292              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1293                      .dwattr $C$DW$T$49, DW_AT_name("PLLCR_BITS")
    1294                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1295              $C$DW$125       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1297                      .dwattr $C$DW$125, DW_AT_name("DIV")
    1298                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_DIV")
    1299                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b)
    1300                      .dwattr $C$DW$125, DW_AT_bit_size(0x05)
    1301                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$126       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1307                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   25

    1308                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    1309                      .dwattr $C$DW$126, DW_AT_bit_size(0x0b)
    1310                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313                      .dwendtag $C$DW$T$49
    1314              
    1315              
    1316              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1317                      .dwattr $C$DW$T$50, DW_AT_name("PLLCR_REG")
    1318                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1319              $C$DW$127       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$127, DW_AT_name("all")
    1322                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1323                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$128       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$49)
    1328                      .dwattr $C$DW$128, DW_AT_name("bit")
    1329                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1330                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333                      .dwendtag $C$DW$T$50
    1334              
    1335              
    1336              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1337                      .dwattr $C$DW$T$51, DW_AT_name("PLLSTS_BITS")
    1338                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1339              $C$DW$129       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$129, DW_AT_name("PLLLOCKS")
    1342                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PLLLOCKS")
    1343                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0f)
    1344                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$130       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1351                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1352                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0e)
    1353                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$131       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$131, DW_AT_name("PLLOFF")
    1360                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PLLOFF")
    1361                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0d)
    1362                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   26

    1363                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366              $C$DW$132       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$132, DW_AT_name("MCLKSTS")
    1369                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_MCLKSTS")
    1370                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c)
    1371                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$133       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$133, DW_AT_name("MCLKCLR")
    1378                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MCLKCLR")
    1379                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0b)
    1380                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$134       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$134, DW_AT_name("OSCOFF")
    1387                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSCOFF")
    1388                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0a)
    1389                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1392              
    1393              $C$DW$135       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$135, DW_AT_name("MCLKOFF")
    1396                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_MCLKOFF")
    1397                      .dwattr $C$DW$135, DW_AT_bit_offset(0x09)
    1398                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$136       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$136, DW_AT_name("DIVSEL")
    1405                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_DIVSEL")
    1406                      .dwattr $C$DW$136, DW_AT_bit_offset(0x07)
    1407                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1408                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$137       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$137, DW_AT_name("rsvd2")
    1414                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd2")
    1415                      .dwattr $C$DW$137, DW_AT_bit_offset(0x01)
    1416                      .dwattr $C$DW$137, DW_AT_bit_size(0x06)
    1417                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:54:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initTimer.asm                                                        PAGE   27

