TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 23:31:12 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("disableDog")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_disableDog")

     453                      ; branchcc occurs ; [] |108| 
     454 00000089       $C$L3:    
     455                      .dwpsn  file "../source/main.c",line 110,column 9,is_stmt,isa 0
     456 00000089 7623          OR        IER,#0x0001           ; [CPU_] |110| 
         0000008a 0001 
     457                      .dwpsn  file "../source/main.c",line 111,column 9,is_stmt,isa 0
     458 0000008b 7626          AND       IER,#0xfff7           ; [CPU_] |111| 
         0000008c FFF7 
     459 0000008d 761F!         MOVW      DP,#_ECap1Period      ; [CPU_U] 
         0000008e 0000 
     460                      .dwpsn  file "../source/main.c",line 118,column 9,is_stmt,isa 0
     461 0000008f E802          MOVIZ     R1H,#17844            ; [CPU_] |118| 
         00000090 2DA1 
     462 00000091 FF69          SPM       #0                    ; [CPU_] 
     463 00000092 E284!         UI32TOF32 R0H,@_ECap1Period     ; [CPU_] |118| 
         00000093 0000 
     464 00000094 E80A          MOVXI     R1H,#22528            ; [CPU_] |118| 
         00000095 C001 
     465              $C$DW$38        .dwtag  DW_TAG_TI_branch
     466                      .dwattr $C$DW$38, DW_AT_low_pc(0x00)
     467                      .dwattr $C$DW$38, DW_AT_name("FS$$DIV")
     468                      .dwattr $C$DW$38, DW_AT_TI_call
     469              
     470 00000096 7640!         LCR       #FS$$DIV              ; [CPU_] |118| 
         00000097 0000 
     471                      ; call occurs [#FS$$DIV] ; [] |118| 
     472 00000098 761F-         MOVW      DP,#_distance         ; [CPU_U] 
         00000099 0000 
     473 0000009a E203-         MOV32     @_distance,R0H        ; [CPU_] |118| 
         0000009b 0004 
     474                      .dwpsn  file "../source/main.c",line 120,column 9,is_stmt,isa 0
     475              $C$DW$39        .dwtag  DW_TAG_TI_branch
     476                      .dwattr $C$DW$39, DW_AT_low_pc(0x00)
     477                      .dwattr $C$DW$39, DW_AT_name("_setOutputs")
     478                      .dwattr $C$DW$39, DW_AT_TI_call
     479              
     480 0000009c 7640!         LCR       #_setOutputs          ; [CPU_] |120| 
         0000009d 0000 
     481                      ; call occurs [#_setOutputs] ; [] |120| 
     482 0000009e 761A   EDIS
     483                      .dwpsn  file "../source/main.c",line 123,column 9,is_stmt,isa 0
     484 0000009f 8F0F          MOVL      XAR4,#1000000         ; [CPU_U] |123| 
         000000a0 4240 
     485 000000a1 FF69          SPM       #0                    ; [CPU_] 
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   11

     486 000000a2 A8A9          MOVL      ACC,XAR4              ; [CPU_] |123| 
     487              $C$DW$40        .dwtag  DW_TAG_TI_branch
     488                      .dwattr $C$DW$40, DW_AT_low_pc(0x00)
     489                      .dwattr $C$DW$40, DW_AT_name("_wait")
     490                      .dwattr $C$DW$40, DW_AT_TI_call
     491              
     492 000000a3 7640!         LCR       #_wait                ; [CPU_] |123| 
         000000a4 0000 
     493                      ; call occurs [#_wait] ; [] |123| 
     494                      .dwpsn  file "../source/main.c",line 65,column 11,is_stmt,isa 0
     495 000000a5 6F84          B         $C$L1,UNC             ; [CPU_] |65| 
     496                      ; branch occurs ; [] |65| 
     497                      .dwattr $C$DW$24, DW_AT_TI_end_file("../source/main.c")
     498                      .dwattr $C$DW$24, DW_AT_TI_end_line(0x7f)
     499                      .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     500                      .dwendentry
     501                      .dwendtag $C$DW$24
     502              
     503              ;**************************************************************
     504              ;* UNDEFINED EXTERNAL REFERENCES                              *
     505              ;**************************************************************
     506                      .global _disableDog
     507                      .global _initExtInt
     508                      .global _wait
     509                      .global _initGPIO
     510                      .global _initClock
     511                      .global _initECapture
     512                      .global _initInterrupt
     513                      .global _initTimer
     514                      .global _setOutputs
     515                      .global _initFSM
     516                      .global _ECap1FallingEdge
     517                      .global _ECap1Period
     518                      .global _CpuTimer1Regs
     519                      .global _PieCtrlRegs
     520                      .global _ECap1Regs
     521                      .global _GpioDataRegs
     522                      .global _GpioCtrlRegs
     523                      .global FS$$DIV
     524              
     525              ;***************************************************************
     526              ;* TYPE INFORMATION                                            *
     527              ;***************************************************************
     528              
     529              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     530                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     531                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     532              $C$DW$41        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$41, DW_AT_name("rsvd1")
     535                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd1")
     536                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0f)
     537                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     538                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   12

     540              
     541              $C$DW$42        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$42, DW_AT_name("rsvd2")
     544                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd2")
     545                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0e)
     546                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     547                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     548                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     549              
     550              $C$DW$43        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     552                      .dwattr $C$DW$43, DW_AT_name("AIO2")
     553                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_AIO2")
     554                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0d)
     555                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     556                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559              $C$DW$44        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     561                      .dwattr $C$DW$44, DW_AT_name("rsvd3")
     562                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd3")
     563                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
     564                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     565                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568              $C$DW$45        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$45, DW_AT_name("AIO4")
     571                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_AIO4")
     572                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0b)
     573                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     574                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     576              
     577              $C$DW$46        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$46, DW_AT_name("rsvd4")
     580                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd4")
     581                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0a)
     582                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     583                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$47        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$47, DW_AT_name("AIO6")
     589                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_AIO6")
     590                      .dwattr $C$DW$47, DW_AT_bit_offset(0x09)
     591                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     592                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     594              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   13

     595              $C$DW$48        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$48, DW_AT_name("rsvd5")
     598                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd5")
     599                      .dwattr $C$DW$48, DW_AT_bit_offset(0x08)
     600                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     603              
     604              $C$DW$49        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     606                      .dwattr $C$DW$49, DW_AT_name("rsvd6")
     607                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd6")
     608                      .dwattr $C$DW$49, DW_AT_bit_offset(0x07)
     609                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$50        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$50, DW_AT_name("rsvd7")
     616                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd7")
     617                      .dwattr $C$DW$50, DW_AT_bit_offset(0x06)
     618                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     619                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     621              
     622              $C$DW$51        .dwtag  DW_TAG_member
     623                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     624                      .dwattr $C$DW$51, DW_AT_name("AIO10")
     625                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_AIO10")
     626                      .dwattr $C$DW$51, DW_AT_bit_offset(0x05)
     627                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     628                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     630              
     631              $C$DW$52        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$52, DW_AT_name("rsvd8")
     634                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd8")
     635                      .dwattr $C$DW$52, DW_AT_bit_offset(0x04)
     636                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     637                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$53        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$53, DW_AT_name("AIO12")
     643                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_AIO12")
     644                      .dwattr $C$DW$53, DW_AT_bit_offset(0x03)
     645                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     646                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     647                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     648              
     649              $C$DW$54        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   14

     650                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     651                      .dwattr $C$DW$54, DW_AT_name("rsvd9")
     652                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd9")
     653                      .dwattr $C$DW$54, DW_AT_bit_offset(0x02)
     654                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     655                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     656                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     657              
     658              $C$DW$55        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     660                      .dwattr $C$DW$55, DW_AT_name("AIO14")
     661                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_AIO14")
     662                      .dwattr $C$DW$55, DW_AT_bit_offset(0x01)
     663                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     664                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     666              
     667              $C$DW$56        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$56, DW_AT_name("rsvd10")
     670                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd10")
     671                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00)
     672                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     673                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$57        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$57, DW_AT_name("rsvd11")
     679                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd11")
     680                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     681                      .dwattr $C$DW$57, DW_AT_bit_size(0x10)
     682                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     683                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685                      .dwendtag $C$DW$T$20
     686              
     687              
     688              $C$DW$T$22      .dwtag  DW_TAG_union_type
     689                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     690                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     691              $C$DW$58        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     693                      .dwattr $C$DW$58, DW_AT_name("all")
     694                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     695                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     697              
     698              $C$DW$59        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     700                      .dwattr $C$DW$59, DW_AT_name("bit")
     701                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     702                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     704              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   15

     705                      .dwendtag $C$DW$T$22
     706              
     707              
     708              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     709                      .dwattr $C$DW$T$23, DW_AT_name("AIO_BITS")
     710                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     711              $C$DW$60        .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     713                      .dwattr $C$DW$60, DW_AT_name("rsvd1")
     714                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd1")
     715                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e)
     716                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
     717                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     719              
     720              $C$DW$61        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$61, DW_AT_name("rsvd2")
     723                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd2")
     724                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
     725                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
     726                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     728              
     729              $C$DW$62        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$62, DW_AT_name("AIO2")
     732                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_AIO2")
     733                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0a)
     734                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
     735                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$63        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$63, DW_AT_name("rsvd3")
     741                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd3")
     742                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
     743                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     744                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     746              
     747              $C$DW$64        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$64, DW_AT_name("AIO4")
     750                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_AIO4")
     751                      .dwattr $C$DW$64, DW_AT_bit_offset(0x06)
     752                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
     753                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     755              
     756              $C$DW$65        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$65, DW_AT_name("rsvd4")
     759                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   16

     760                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04)
     761                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
     762                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765              $C$DW$66        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$66, DW_AT_name("AIO6")
     768                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_AIO6")
     769                      .dwattr $C$DW$66, DW_AT_bit_offset(0x02)
     770                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     771                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     773              
     774              $C$DW$67        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$67, DW_AT_name("rsvd5")
     777                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd5")
     778                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     779                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
     780                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     782              
     783              $C$DW$68        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$68, DW_AT_name("rsvd6")
     786                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd6")
     787                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e)
     788                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     789                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     790                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     791              
     792              $C$DW$69        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$69, DW_AT_name("rsvd7")
     795                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd7")
     796                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c)
     797                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
     798                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     799                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801              $C$DW$70        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$70, DW_AT_name("AIO10")
     804                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_AIO10")
     805                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0a)
     806                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     807                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     808                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$71        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$71, DW_AT_name("rsvd8")
     813                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd8")
     814                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     815                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     816                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     817                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819              $C$DW$72        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$72, DW_AT_name("AIO12")
     822                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_AIO12")
     823                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06)
     824                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
     825                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     826                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     827              
     828              $C$DW$73        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$73, DW_AT_name("rsvd9")
     831                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd9")
     832                      .dwattr $C$DW$73, DW_AT_bit_offset(0x04)
     833                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
     834                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     835                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$74        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$74, DW_AT_name("AIO14")
     840                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_AIO14")
     841                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02)
     842                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
     843                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     844                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$75        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$75, DW_AT_name("rsvd10")
     849                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd10")
     850                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00)
     851                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
     852                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     853                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855                      .dwendtag $C$DW$T$23
     856              
     857              
     858              $C$DW$T$24      .dwtag  DW_TAG_union_type
     859                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
     860                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     861              $C$DW$76        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     863                      .dwattr $C$DW$76, DW_AT_name("all")
     864                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     865                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     867              
     868              $C$DW$77        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     870                      .dwattr $C$DW$77, DW_AT_name("bit")
     871                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     872                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875                      .dwendtag $C$DW$T$24
     876              
     877              
     878              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     879                      .dwattr $C$DW$T$25, DW_AT_name("CPUTIMER_REGS")
     880                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
     881              $C$DW$78        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$73)
     883                      .dwattr $C$DW$78, DW_AT_name("TIM")
     884                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_TIM")
     885                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     887              
     888              $C$DW$79        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$69)
     890                      .dwattr $C$DW$79, DW_AT_name("PRD")
     891                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PRD")
     892                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     893                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     894              
     895              $C$DW$80        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$72)
     897                      .dwattr $C$DW$80, DW_AT_name("TCR")
     898                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_TCR")
     899                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     900                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     901              
     902              $C$DW$81        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
     905                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
     906                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     907                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$82        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$78)
     911                      .dwattr $C$DW$82, DW_AT_name("TPR")
     912                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_TPR")
     913                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     914                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$83        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$76)
     918                      .dwattr $C$DW$83, DW_AT_name("TPRH")
     919                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_TPRH")
     920                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     921                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923                      .dwendtag $C$DW$T$25
     924              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     925              $C$DW$84        .dwtag  DW_TAG_TI_far_type
     926                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
     927              
     928              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
     929                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$84)
     930              
     931              
     932              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     933                      .dwattr $C$DW$T$28, DW_AT_name("ECAP_REGS")
     934                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
     935              $C$DW$85        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     937                      .dwattr $C$DW$85, DW_AT_name("TSCTR")
     938                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_TSCTR")
     939                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     941              
     942              $C$DW$86        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
     944                      .dwattr $C$DW$86, DW_AT_name("CTRPHS")
     945                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CTRPHS")
     946                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     947                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     948              
     949              $C$DW$87        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
     951                      .dwattr $C$DW$87, DW_AT_name("CAP1")
     952                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CAP1")
     953                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     954                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$88        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
     958                      .dwattr $C$DW$88, DW_AT_name("CAP2")
     959                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CAP2")
     960                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     961                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$89        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
     965                      .dwattr $C$DW$89, DW_AT_name("CAP3")
     966                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_CAP3")
     967                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     968                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     969              
     970              $C$DW$90        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
     972                      .dwattr $C$DW$90, DW_AT_name("CAP4")
     973                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_CAP4")
     974                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     975                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977              $C$DW$91        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
     979                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   20

     980                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
     981                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     982                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     983              
     984              $C$DW$92        .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$30)
     986                      .dwattr $C$DW$92, DW_AT_name("ECCTL1")
     987                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ECCTL1")
     988                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     989                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     990              
     991              $C$DW$93        .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$32)
     993                      .dwattr $C$DW$93, DW_AT_name("ECCTL2")
     994                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ECCTL2")
     995                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     996                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     997              
     998              $C$DW$94        .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$34)
    1000                      .dwattr $C$DW$94, DW_AT_name("ECEINT")
    1001                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_ECEINT")
    1002                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1003                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1004              
    1005              $C$DW$95        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$36)
    1007                      .dwattr $C$DW$95, DW_AT_name("ECFLG")
    1008                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ECFLG")
    1009                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1010                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1011              
    1012              $C$DW$96        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$36)
    1014                      .dwattr $C$DW$96, DW_AT_name("ECCLR")
    1015                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ECCLR")
    1016                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1017                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$97        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$34)
    1021                      .dwattr $C$DW$97, DW_AT_name("ECFRC")
    1022                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ECFRC")
    1023                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1024                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$98        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$27)
    1028                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    1029                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    1030                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1031                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033                      .dwendtag $C$DW$T$28
    1034              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1035              $C$DW$99        .dwtag  DW_TAG_TI_far_type
    1036                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1037              
    1038              $C$DW$T$81      .dwtag  DW_TAG_volatile_type
    1039                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$99)
    1040              
    1041              
    1042              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1043                      .dwattr $C$DW$T$29, DW_AT_name("ECCTL1_BITS")
    1044                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1045              $C$DW$100       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$100, DW_AT_name("CAP1POL")
    1048                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_CAP1POL")
    1049                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f)
    1050                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1051                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$101       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$101, DW_AT_name("CTRRST1")
    1057                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_CTRRST1")
    1058                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e)
    1059                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1060                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1062              
    1063              $C$DW$102       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$102, DW_AT_name("CAP2POL")
    1066                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_CAP2POL")
    1067                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0d)
    1068                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1071              
    1072              $C$DW$103       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$103, DW_AT_name("CTRRST2")
    1075                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CTRRST2")
    1076                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c)
    1077                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$104       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$104, DW_AT_name("CAP3POL")
    1084                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CAP3POL")
    1085                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0b)
    1086                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1087                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1089              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1090              $C$DW$105       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$105, DW_AT_name("CTRRST3")
    1093                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CTRRST3")
    1094                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a)
    1095                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1098              
    1099              $C$DW$106       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$106, DW_AT_name("CAP4POL")
    1102                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CAP4POL")
    1103                      .dwattr $C$DW$106, DW_AT_bit_offset(0x09)
    1104                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$107       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$107, DW_AT_name("CTRRST4")
    1111                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CTRRST4")
    1112                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08)
    1113                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1116              
    1117              $C$DW$108       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$108, DW_AT_name("CAPLDEN")
    1120                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CAPLDEN")
    1121                      .dwattr $C$DW$108, DW_AT_bit_offset(0x07)
    1122                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1123                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1125              
    1126              $C$DW$109       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$109, DW_AT_name("PRESCALE")
    1129                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PRESCALE")
    1130                      .dwattr $C$DW$109, DW_AT_bit_offset(0x02)
    1131                      .dwattr $C$DW$109, DW_AT_bit_size(0x05)
    1132                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$110       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$110, DW_AT_name("FREE_SOFT")
    1138                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_FREE_SOFT")
    1139                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1140                      .dwattr $C$DW$110, DW_AT_bit_size(0x02)
    1141                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144                      .dwendtag $C$DW$T$29
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1145              
    1146              
    1147              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1148                      .dwattr $C$DW$T$30, DW_AT_name("ECCTL1_REG")
    1149                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1150              $C$DW$111       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$111, DW_AT_name("all")
    1153                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1154                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157              $C$DW$112       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$29)
    1159                      .dwattr $C$DW$112, DW_AT_name("bit")
    1160                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1161                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164                      .dwendtag $C$DW$T$30
    1165              
    1166              
    1167              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1168                      .dwattr $C$DW$T$31, DW_AT_name("ECCTL2_BITS")
    1169                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1170              $C$DW$113       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$113, DW_AT_name("CONT_ONESHT")
    1173                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_CONT_ONESHT")
    1174                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1175                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1176                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$114       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$114, DW_AT_name("STOP_WRAP")
    1182                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_STOP_WRAP")
    1183                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0d)
    1184                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1185                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1187              
    1188              $C$DW$115       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$115, DW_AT_name("REARM")
    1191                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_REARM")
    1192                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0c)
    1193                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1194                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1196              
    1197              $C$DW$116       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$116, DW_AT_name("TSCTRSTOP")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1200                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_TSCTRSTOP")
    1201                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0b)
    1202                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1203                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$117       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$117, DW_AT_name("SYNCI_EN")
    1209                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SYNCI_EN")
    1210                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a)
    1211                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1212                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1214              
    1215              $C$DW$118       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$118, DW_AT_name("SYNCO_SEL")
    1218                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SYNCO_SEL")
    1219                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08)
    1220                      .dwattr $C$DW$118, DW_AT_bit_size(0x02)
    1221                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$119       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$119, DW_AT_name("SWSYNC")
    1227                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SWSYNC")
    1228                      .dwattr $C$DW$119, DW_AT_bit_offset(0x07)
    1229                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1230                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1232              
    1233              $C$DW$120       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$120, DW_AT_name("CAP_APWM")
    1236                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CAP_APWM")
    1237                      .dwattr $C$DW$120, DW_AT_bit_offset(0x06)
    1238                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1239                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242              $C$DW$121       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$121, DW_AT_name("APWMPOL")
    1245                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_APWMPOL")
    1246                      .dwattr $C$DW$121, DW_AT_bit_offset(0x05)
    1247                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1248                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$122       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1254                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1255                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1256                      .dwattr $C$DW$122, DW_AT_bit_size(0x05)
    1257                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260                      .dwendtag $C$DW$T$31
    1261              
    1262              
    1263              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1264                      .dwattr $C$DW$T$32, DW_AT_name("ECCTL2_REG")
    1265                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1266              $C$DW$123       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$123, DW_AT_name("all")
    1269                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    1270                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273              $C$DW$124       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$31)
    1275                      .dwattr $C$DW$124, DW_AT_name("bit")
    1276                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1277                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280                      .dwendtag $C$DW$T$32
    1281              
    1282              
    1283              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1284                      .dwattr $C$DW$T$33, DW_AT_name("ECEINT_BITS")
    1285                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1286              $C$DW$125       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1289                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1290                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0f)
    1291                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1292                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1294              
    1295              $C$DW$126       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1297                      .dwattr $C$DW$126, DW_AT_name("CEVT1")
    1298                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_CEVT1")
    1299                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e)
    1300                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1301                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$127       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$127, DW_AT_name("CEVT2")
    1307                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CEVT2")
    1308                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d)
    1309                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1310                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1312              
    1313              $C$DW$128       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$128, DW_AT_name("CEVT3")
    1316                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CEVT3")
    1317                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1318                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1319                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1321              
    1322              $C$DW$129       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$129, DW_AT_name("CEVT4")
    1325                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CEVT4")
    1326                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0b)
    1327                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1328                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1330              
    1331              $C$DW$130       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$130, DW_AT_name("CTROVF")
    1334                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CTROVF")
    1335                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    1336                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1337                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1339              
    1340              $C$DW$131       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$131, DW_AT_name("CTR_EQ_PRD")
    1343                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
    1344                      .dwattr $C$DW$131, DW_AT_bit_offset(0x09)
    1345                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1346                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1348              
    1349              $C$DW$132       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$132, DW_AT_name("CTR_EQ_CMP")
    1352                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
    1353                      .dwattr $C$DW$132, DW_AT_bit_offset(0x08)
    1354                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1355                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1357              
    1358              $C$DW$133       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1360                      .dwattr $C$DW$133, DW_AT_name("rsvd2")
    1361                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd2")
    1362                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    1363                      .dwattr $C$DW$133, DW_AT_bit_size(0x08)
    1364                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1365                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367                      .dwendtag $C$DW$T$33
    1368              
    1369              
    1370              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1371                      .dwattr $C$DW$T$34, DW_AT_name("ECEINT_REG")
    1372                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1373              $C$DW$134       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1375                      .dwattr $C$DW$134, DW_AT_name("all")
    1376                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    1377                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380              $C$DW$135       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
    1382                      .dwattr $C$DW$135, DW_AT_name("bit")
    1383                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    1384                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1386              
    1387                      .dwendtag $C$DW$T$34
    1388              
    1389              
    1390              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1391                      .dwattr $C$DW$T$35, DW_AT_name("ECFLG_BITS")
    1392                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1393              $C$DW$136       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$136, DW_AT_name("INT")
    1396                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_INT")
    1397                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
    1398                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$137       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$137, DW_AT_name("CEVT1")
    1405                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_CEVT1")
    1406                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e)
    1407                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$138       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$138, DW_AT_name("CEVT2")
    1414                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CEVT2")
    1415                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0d)
    1416                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1419              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1420              $C$DW$139       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$139, DW_AT_name("CEVT3")
    1423                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CEVT3")
    1424                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0c)
    1425                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$140       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$140, DW_AT_name("CEVT4")
    1432                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CEVT4")
    1433                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0b)
    1434                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1435                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1437              
    1438              $C$DW$141       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$141, DW_AT_name("CTROVF")
    1441                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CTROVF")
    1442                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0a)
    1443                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1444                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$142       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$142, DW_AT_name("CTR_EQ_PRD")
    1450                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
    1451                      .dwattr $C$DW$142, DW_AT_bit_offset(0x09)
    1452                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1453                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1455              
    1456              $C$DW$143       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$143, DW_AT_name("CTR_EQ_CMP")
    1459                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
    1460                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08)
    1461                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1462                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1464              
    1465              $C$DW$144       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1468                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1469                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    1470                      .dwattr $C$DW$144, DW_AT_bit_size(0x08)
    1471                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474                      .dwendtag $C$DW$T$35
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1475              
    1476              
    1477              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1478                      .dwattr $C$DW$T$36, DW_AT_name("ECFLG_REG")
    1479                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1480              $C$DW$145       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$145, DW_AT_name("all")
    1483                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    1484                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1486              
    1487              $C$DW$146       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$35)
    1489                      .dwattr $C$DW$146, DW_AT_name("bit")
    1490                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    1491                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1493              
    1494                      .dwendtag $C$DW$T$36
    1495              
    1496              
    1497              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1498                      .dwattr $C$DW$T$37, DW_AT_name("GPA1_BITS")
    1499                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1500              $C$DW$147       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$147, DW_AT_name("GPIO0")
    1503                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO0")
    1504                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0e)
    1505                      .dwattr $C$DW$147, DW_AT_bit_size(0x02)
    1506                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509              $C$DW$148       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$148, DW_AT_name("GPIO1")
    1512                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO1")
    1513                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1514                      .dwattr $C$DW$148, DW_AT_bit_size(0x02)
    1515                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$149       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$149, DW_AT_name("GPIO2")
    1521                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO2")
    1522                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0a)
    1523                      .dwattr $C$DW$149, DW_AT_bit_size(0x02)
    1524                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1526              
    1527              $C$DW$150       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$150, DW_AT_name("GPIO3")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1530                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO3")
    1531                      .dwattr $C$DW$150, DW_AT_bit_offset(0x08)
    1532                      .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    1533                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536              $C$DW$151       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$151, DW_AT_name("GPIO4")
    1539                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO4")
    1540                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06)
    1541                      .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    1542                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$152       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$152, DW_AT_name("GPIO5")
    1548                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO5")
    1549                      .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    1550                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    1551                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1553              
    1554              $C$DW$153       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1556                      .dwattr $C$DW$153, DW_AT_name("GPIO6")
    1557                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO6")
    1558                      .dwattr $C$DW$153, DW_AT_bit_offset(0x02)
    1559                      .dwattr $C$DW$153, DW_AT_bit_size(0x02)
    1560                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1562              
    1563              $C$DW$154       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1565                      .dwattr $C$DW$154, DW_AT_name("GPIO7")
    1566                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO7")
    1567                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    1568                      .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    1569                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1571              
    1572              $C$DW$155       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1574                      .dwattr $C$DW$155, DW_AT_name("GPIO8")
    1575                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO8")
    1576                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e)
    1577                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    1578                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1579                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1580              
    1581              $C$DW$156       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1583                      .dwattr $C$DW$156, DW_AT_name("GPIO9")
    1584                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO9")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1585                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0c)
    1586                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    1587                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1588                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$157       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$157, DW_AT_name("GPIO10")
    1593                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO10")
    1594                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0a)
    1595                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    1596                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1597                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1598              
    1599              $C$DW$158       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1601                      .dwattr $C$DW$158, DW_AT_name("GPIO11")
    1602                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO11")
    1603                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08)
    1604                      .dwattr $C$DW$158, DW_AT_bit_size(0x02)
    1605                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1606                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1607              
    1608              $C$DW$159       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$159, DW_AT_name("GPIO12")
    1611                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO12")
    1612                      .dwattr $C$DW$159, DW_AT_bit_offset(0x06)
    1613                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    1614                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1615                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1616              
    1617              $C$DW$160       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1619                      .dwattr $C$DW$160, DW_AT_name("GPIO13")
    1620                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO13")
    1621                      .dwattr $C$DW$160, DW_AT_bit_offset(0x04)
    1622                      .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    1623                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1624                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$161       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$161, DW_AT_name("GPIO14")
    1629                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO14")
    1630                      .dwattr $C$DW$161, DW_AT_bit_offset(0x02)
    1631                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    1632                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1633                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$162       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$162, DW_AT_name("GPIO15")
    1638                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO15")
    1639                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1640                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    1641                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1642                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644                      .dwendtag $C$DW$T$37
    1645              
    1646              
    1647              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1648                      .dwattr $C$DW$T$38, DW_AT_name("GPA1_REG")
    1649                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1650              $C$DW$163       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    1652                      .dwattr $C$DW$163, DW_AT_name("all")
    1653                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    1654                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657              $C$DW$164       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$37)
    1659                      .dwattr $C$DW$164, DW_AT_name("bit")
    1660                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    1661                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664                      .dwendtag $C$DW$T$38
    1665              
    1666              
    1667              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1668                      .dwattr $C$DW$T$39, DW_AT_name("GPA2_BITS")
    1669                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1670              $C$DW$165       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$165, DW_AT_name("GPIO16")
    1673                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO16")
    1674                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    1675                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    1676                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1678              
    1679              $C$DW$166       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$166, DW_AT_name("GPIO17")
    1682                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO17")
    1683                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c)
    1684                      .dwattr $C$DW$166, DW_AT_bit_size(0x02)
    1685                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$167       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1690                      .dwattr $C$DW$167, DW_AT_name("GPIO18")
    1691                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO18")
    1692                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a)
    1693                      .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    1694                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1695                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697              $C$DW$168       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1699                      .dwattr $C$DW$168, DW_AT_name("GPIO19")
    1700                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO19")
    1701                      .dwattr $C$DW$168, DW_AT_bit_offset(0x08)
    1702                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    1703                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706              $C$DW$169       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$169, DW_AT_name("GPIO20")
    1709                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO20")
    1710                      .dwattr $C$DW$169, DW_AT_bit_offset(0x06)
    1711                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    1712                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1714              
    1715              $C$DW$170       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1717                      .dwattr $C$DW$170, DW_AT_name("GPIO21")
    1718                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO21")
    1719                      .dwattr $C$DW$170, DW_AT_bit_offset(0x04)
    1720                      .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    1721                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724              $C$DW$171       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$171, DW_AT_name("GPIO22")
    1727                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO22")
    1728                      .dwattr $C$DW$171, DW_AT_bit_offset(0x02)
    1729                      .dwattr $C$DW$171, DW_AT_bit_size(0x02)
    1730                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$172       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$172, DW_AT_name("GPIO23")
    1736                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO23")
    1737                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00)
    1738                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    1739                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742              $C$DW$173       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$173, DW_AT_name("GPIO24")
    1745                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO24")
    1746                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e)
    1747                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    1748                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1749                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1750              
    1751              $C$DW$174       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$174, DW_AT_name("GPIO25")
    1754                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO25")
    1755                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0c)
    1756                      .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    1757                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1758                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$175       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$175, DW_AT_name("GPIO26")
    1763                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO26")
    1764                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0a)
    1765                      .dwattr $C$DW$175, DW_AT_bit_size(0x02)
    1766                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1767                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769              $C$DW$176       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$176, DW_AT_name("GPIO27")
    1772                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO27")
    1773                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08)
    1774                      .dwattr $C$DW$176, DW_AT_bit_size(0x02)
    1775                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1776                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778              $C$DW$177       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$177, DW_AT_name("GPIO28")
    1781                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO28")
    1782                      .dwattr $C$DW$177, DW_AT_bit_offset(0x06)
    1783                      .dwattr $C$DW$177, DW_AT_bit_size(0x02)
    1784                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1785                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$178       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$178, DW_AT_name("GPIO29")
    1790                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO29")
    1791                      .dwattr $C$DW$178, DW_AT_bit_offset(0x04)
    1792                      .dwattr $C$DW$178, DW_AT_bit_size(0x02)
    1793                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1794                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$179       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$179, DW_AT_name("GPIO30")
    1799                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO30")
    1800                      .dwattr $C$DW$179, DW_AT_bit_offset(0x02)
    1801                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    1802                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1803                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1804              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1805              $C$DW$180       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1807                      .dwattr $C$DW$180, DW_AT_name("GPIO31")
    1808                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO31")
    1809                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00)
    1810                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    1811                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1812                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814                      .dwendtag $C$DW$T$39
    1815              
    1816              
    1817              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1818                      .dwattr $C$DW$T$40, DW_AT_name("GPA2_REG")
