TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 20:56:02 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initGPIO.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioDataRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioDataRegs")

     139                      .dwpsn  file "../source/initGPIO.c",line 29,column 5,is_stmt,isa 0
     140 0000002e 1AE2          OR        *+XAR2[4],#0x0010     ; [CPU_] |29| 
         0000002f 0010 
     141                      .dwpsn  file "../source/initGPIO.c",line 30,column 5,is_stmt,isa 0
     142 00000030 18F4          AND       *+XAR4[6],#0xfcff     ; [CPU_] |30| 
         00000031 FCFF 
     143                      .dwpsn  file "../source/initGPIO.c",line 31,column 5,is_stmt,isa 0
     144 00000032 1AC5          OR        *+XAR5[0],#0x0010     ; [CPU_] |31| 
         00000033 0010 
     145                      .dwpsn  file "../source/initGPIO.c",line 35,column 5,is_stmt,isa 0
     146 00000034 1A0D!         OR        @_GpioCtrlRegs+13,#0x0400 ; [CPU_] |35| 
         00000035 0400 
     147                      .dwpsn  file "../source/initGPIO.c",line 36,column 5,is_stmt,isa 0
     148 00000036 1AEA          OR        *+XAR2[5],#0x0400     ; [CPU_] |36| 
         00000037 0400 
     149                      .dwpsn  file "../source/initGPIO.c",line 37,column 5,is_stmt,isa 0
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    4

     150 00000038 18C7          AND       *+XAR7[0],#0xffcf     ; [CPU_] |37| 
         00000039 FFCF 
     151                      .dwpsn  file "../source/initGPIO.c",line 38,column 5,is_stmt,isa 0
     152 0000003a 180B!         AND       @_GpioCtrlRegs+11,#0xfbff ; [CPU_] |38| 
         0000003b FBFF 
     153 0000003c 761F!         MOVW      DP,#_GpioIntRegs      ; [CPU_U] 
         0000003d 0000 
     154                      .dwpsn  file "../source/initGPIO.c",line 39,column 5,is_stmt,isa 0
     155 0000003e CC00!         AND       AL,@_GpioIntRegs,#0xfff8 ; [CPU_] |39| 
         0000003f FFF8 
     156 00000040 501A          ORB       AL,#0x1a              ; [CPU_] |39| 
     157 00000041 9600!         MOV       @_GpioIntRegs,AL      ; [CPU_] |39| 
     158 00000042 761F!         MOVW      DP,#_GpioCtrlRegs+13  ; [CPU_U] 
         00000043 0000 
     159                      .dwpsn  file "../source/initGPIO.c",line 44,column 5,is_stmt,isa 0
     160 00000044 1A0D!         OR        @_GpioCtrlRegs+13,#0x0008 ; [CPU_] |44| 
         00000045 0008 
     161 00000046 761F!         MOVW      DP,#_GpioDataRegs+5   ; [CPU_U] 
         00000047 0000 
     162                      .dwpsn  file "../source/initGPIO.c",line 45,column 5,is_stmt,isa 0
     163 00000048 1A05!         OR        @_GpioDataRegs+5,#0x0008 ; [CPU_] |45| 
         00000049 0008 
     164 0000004a 761F!         MOVW      DP,#_GpioCtrlRegs+8   ; [CPU_U] 
         0000004b 0000 
     165                      .dwpsn  file "../source/initGPIO.c",line 46,column 5,is_stmt,isa 0
     166 0000004c 1808!         AND       @_GpioCtrlRegs+8,#0xff3f ; [CPU_] |46| 
         0000004d FF3F 
     167                      .dwpsn  file "../source/initGPIO.c",line 47,column 5,is_stmt,isa 0
     168 0000004e 1A0B!         OR        @_GpioCtrlRegs+11,#0x0008 ; [CPU_] |47| 
         0000004f 0008 
     169 00000050 761A   EDIS
     170 00000051 FF69          SPM       #0                    ; [CPU_] 
     171 00000052 82BE          MOVL      XAR3,*--SP            ; [CPU_] 
     172                      .dwcfi  cfa_offset, -6
     173                      .dwcfi  restore_reg, 11
     174 00000053 86BE          MOVL      XAR2,*--SP            ; [CPU_] 
     175                      .dwcfi  cfa_offset, -4
     176                      .dwcfi  restore_reg, 9
     177 00000054 8BBE          MOVL      XAR1,*--SP            ; [CPU_] 
     178                      .dwcfi  cfa_offset, -2
     179                      .dwcfi  restore_reg, 7
     180              $C$DW$5 .dwtag  DW_TAG_TI_branch
     181                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     182                      .dwattr $C$DW$5, DW_AT_TI_return
     183              
     184 00000055 0006          LRETR     ; [CPU_] 
     185                      ; return occurs ; [] 
     186                      .dwattr $C$DW$4, DW_AT_TI_end_file("../source/initGPIO.c")
     187                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x38)
     188                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     189                      .dwendentry
     190                      .dwendtag $C$DW$4
     191              
     192              ;**************************************************************
     193              ;* UNDEFINED EXTERNAL REFERENCES                              *
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    5

     194              ;**************************************************************
     195                      .global _GpioDataRegs
     196                      .global _GpioIntRegs
     197                      .global _GpioCtrlRegs
     198              
     199              ;***************************************************************
     200              ;* TYPE INFORMATION                                            *
     201              ;***************************************************************
     202              
     203              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     204                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     205                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     206              $C$DW$6 .dwtag  DW_TAG_member
     207                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     208                      .dwattr $C$DW$6, DW_AT_name("rsvd1")
     209                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_rsvd1")
     210                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     211                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     212                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     213                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     214              
     215              $C$DW$7 .dwtag  DW_TAG_member
     216                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     217                      .dwattr $C$DW$7, DW_AT_name("rsvd2")
     218                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_rsvd2")
     219                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     220                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     221                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     222                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     223              
     224              $C$DW$8 .dwtag  DW_TAG_member
     225                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     226                      .dwattr $C$DW$8, DW_AT_name("AIO2")
     227                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_AIO2")
     228                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     229                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     230                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     231                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     232              
     233              $C$DW$9 .dwtag  DW_TAG_member
     234                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     235                      .dwattr $C$DW$9, DW_AT_name("rsvd3")
     236                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_rsvd3")
     237                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c)
     238                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     239                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     240                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     241              
     242              $C$DW$10        .dwtag  DW_TAG_member
     243                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     244                      .dwattr $C$DW$10, DW_AT_name("AIO4")
     245                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_AIO4")
     246                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b)
     247                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     248                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    6

     249                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     250              
     251              $C$DW$11        .dwtag  DW_TAG_member
     252                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     253                      .dwattr $C$DW$11, DW_AT_name("rsvd4")
     254                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_rsvd4")
     255                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a)
     256                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     257                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     258                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     259              
     260              $C$DW$12        .dwtag  DW_TAG_member
     261                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     262                      .dwattr $C$DW$12, DW_AT_name("AIO6")
     263                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_AIO6")
     264                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09)
     265                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     266                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     267                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     268              
     269              $C$DW$13        .dwtag  DW_TAG_member
     270                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     271                      .dwattr $C$DW$13, DW_AT_name("rsvd5")
     272                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_rsvd5")
     273                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     274                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     275                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     276                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     277              
     278              $C$DW$14        .dwtag  DW_TAG_member
     279                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     280                      .dwattr $C$DW$14, DW_AT_name("rsvd6")
     281                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_rsvd6")
     282                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07)
     283                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     284                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     285                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     286              
     287              $C$DW$15        .dwtag  DW_TAG_member
     288                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     289                      .dwattr $C$DW$15, DW_AT_name("rsvd7")
     290                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd7")
     291                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06)
     292                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     293                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     294                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     295              
     296              $C$DW$16        .dwtag  DW_TAG_member
     297                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     298                      .dwattr $C$DW$16, DW_AT_name("AIO10")
     299                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_AIO10")
     300                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05)
     301                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     302                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     303                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    7

     304              
     305              $C$DW$17        .dwtag  DW_TAG_member
     306                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     307                      .dwattr $C$DW$17, DW_AT_name("rsvd8")
     308                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd8")
     309                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     310                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     311                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     312                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     313              
     314              $C$DW$18        .dwtag  DW_TAG_member
     315                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     316                      .dwattr $C$DW$18, DW_AT_name("AIO12")
     317                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_AIO12")
     318                      .dwattr $C$DW$18, DW_AT_bit_offset(0x03)
     319                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     320                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     321                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     322              
     323              $C$DW$19        .dwtag  DW_TAG_member
     324                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     325                      .dwattr $C$DW$19, DW_AT_name("rsvd9")
     326                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd9")
     327                      .dwattr $C$DW$19, DW_AT_bit_offset(0x02)
     328                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     329                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     331              
     332              $C$DW$20        .dwtag  DW_TAG_member
     333                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     334                      .dwattr $C$DW$20, DW_AT_name("AIO14")
     335                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_AIO14")
     336                      .dwattr $C$DW$20, DW_AT_bit_offset(0x01)
     337                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     338                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     339                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     340              
     341              $C$DW$21        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     343                      .dwattr $C$DW$21, DW_AT_name("rsvd10")
     344                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd10")
     345                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00)
     346                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     347                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     348                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     349              
     350              $C$DW$22        .dwtag  DW_TAG_member
     351                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     352                      .dwattr $C$DW$22, DW_AT_name("rsvd11")
     353                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd11")
     354                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     355                      .dwattr $C$DW$22, DW_AT_bit_size(0x10)
     356                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     357                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     358              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    8

     359                      .dwendtag $C$DW$T$20
     360              
     361              
     362              $C$DW$T$22      .dwtag  DW_TAG_union_type
     363                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     364                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     365              $C$DW$23        .dwtag  DW_TAG_member
     366                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     367                      .dwattr $C$DW$23, DW_AT_name("all")
     368                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     369                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     370                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     371              
     372              $C$DW$24        .dwtag  DW_TAG_member
     373                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     374                      .dwattr $C$DW$24, DW_AT_name("bit")
     375                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     376                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     377                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     378              
     379                      .dwendtag $C$DW$T$22
     380              
     381              
     382              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     383                      .dwattr $C$DW$T$23, DW_AT_name("AIO_BITS")
     384                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     385              $C$DW$25        .dwtag  DW_TAG_member
     386                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     387                      .dwattr $C$DW$25, DW_AT_name("rsvd1")
     388                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd1")
     389                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0e)
     390                      .dwattr $C$DW$25, DW_AT_bit_size(0x02)
     391                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     392                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     393              
     394              $C$DW$26        .dwtag  DW_TAG_member
     395                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     396                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     397                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     398                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0c)
     399                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     400                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     401                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     402              
     403              $C$DW$27        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     405                      .dwattr $C$DW$27, DW_AT_name("AIO2")
     406                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_AIO2")
     407                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0a)
     408                      .dwattr $C$DW$27, DW_AT_bit_size(0x02)
     409                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     410                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     411              
     412              $C$DW$28        .dwtag  DW_TAG_member
     413                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    9

     414                      .dwattr $C$DW$28, DW_AT_name("rsvd3")
     415                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd3")
     416                      .dwattr $C$DW$28, DW_AT_bit_offset(0x08)
     417                      .dwattr $C$DW$28, DW_AT_bit_size(0x02)
     418                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     419                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     420              
     421              $C$DW$29        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     423                      .dwattr $C$DW$29, DW_AT_name("AIO4")
     424                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_AIO4")
     425                      .dwattr $C$DW$29, DW_AT_bit_offset(0x06)
     426                      .dwattr $C$DW$29, DW_AT_bit_size(0x02)
     427                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     428                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     429              
     430              $C$DW$30        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     432                      .dwattr $C$DW$30, DW_AT_name("rsvd4")
     433                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd4")
     434                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     435                      .dwattr $C$DW$30, DW_AT_bit_size(0x02)
     436                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     437                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     438              
     439              $C$DW$31        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     441                      .dwattr $C$DW$31, DW_AT_name("AIO6")
     442                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_AIO6")
     443                      .dwattr $C$DW$31, DW_AT_bit_offset(0x02)
     444                      .dwattr $C$DW$31, DW_AT_bit_size(0x02)
     445                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     446                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     447              
     448              $C$DW$32        .dwtag  DW_TAG_member
     449                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     450                      .dwattr $C$DW$32, DW_AT_name("rsvd5")
     451                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd5")
     452                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     453                      .dwattr $C$DW$32, DW_AT_bit_size(0x02)
     454                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     455                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     456              
     457              $C$DW$33        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$33, DW_AT_name("rsvd6")
     460                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd6")
     461                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0e)
     462                      .dwattr $C$DW$33, DW_AT_bit_size(0x02)
     463                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     464                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     465              
     466              $C$DW$34        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     468                      .dwattr $C$DW$34, DW_AT_name("rsvd7")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   10

     469                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd7")
     470                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c)
     471                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     472                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     473                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     474              
     475              $C$DW$35        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     477                      .dwattr $C$DW$35, DW_AT_name("AIO10")
     478                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_AIO10")
     479                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
     480                      .dwattr $C$DW$35, DW_AT_bit_size(0x02)
     481                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     482                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     483              
     484              $C$DW$36        .dwtag  DW_TAG_member
     485                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     486                      .dwattr $C$DW$36, DW_AT_name("rsvd8")
     487                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd8")
     488                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08)
     489                      .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     490                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     491                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     492              
     493              $C$DW$37        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$37, DW_AT_name("AIO12")
     496                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_AIO12")
     497                      .dwattr $C$DW$37, DW_AT_bit_offset(0x06)
     498                      .dwattr $C$DW$37, DW_AT_bit_size(0x02)
     499                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     500                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$38        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$38, DW_AT_name("rsvd9")
     505                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd9")
     506                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     507                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
     508                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     509                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     510              
     511              $C$DW$39        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$39, DW_AT_name("AIO14")
     514                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_AIO14")
     515                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     516                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     517                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     518                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$40        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$40, DW_AT_name("rsvd10")
     523                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd10")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   11

     524                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     525                      .dwattr $C$DW$40, DW_AT_bit_size(0x02)
     526                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     527                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529                      .dwendtag $C$DW$T$23
     530              
     531              
     532              $C$DW$T$24      .dwtag  DW_TAG_union_type
     533                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
     534                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     535              $C$DW$41        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     537                      .dwattr $C$DW$41, DW_AT_name("all")
     538                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     539                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     541              
     542              $C$DW$42        .dwtag  DW_TAG_member
     543                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     544                      .dwattr $C$DW$42, DW_AT_name("bit")
     545                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     546                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     548              
     549                      .dwendtag $C$DW$T$24
     550              
     551              
     552              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     553                      .dwattr $C$DW$T$25, DW_AT_name("GPA1_BITS")
     554                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     555              $C$DW$43        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$43, DW_AT_name("GPIO0")
     558                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO0")
     559                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0e)
     560                      .dwattr $C$DW$43, DW_AT_bit_size(0x02)
     561                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     563              
     564              $C$DW$44        .dwtag  DW_TAG_member
     565                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     566                      .dwattr $C$DW$44, DW_AT_name("GPIO1")
     567                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO1")
     568                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
     569                      .dwattr $C$DW$44, DW_AT_bit_size(0x02)
     570                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     571                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     572              
     573              $C$DW$45        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     575                      .dwattr $C$DW$45, DW_AT_name("GPIO2")
     576                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO2")
     577                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a)
     578                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   12

     579                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     581              
     582              $C$DW$46        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$46, DW_AT_name("GPIO3")
     585                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO3")
     586                      .dwattr $C$DW$46, DW_AT_bit_offset(0x08)
     587                      .dwattr $C$DW$46, DW_AT_bit_size(0x02)
     588                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     590              
     591              $C$DW$47        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$47, DW_AT_name("GPIO4")
     594                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO4")
     595                      .dwattr $C$DW$47, DW_AT_bit_offset(0x06)
     596                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     597                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     599              
     600              $C$DW$48        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$48, DW_AT_name("GPIO5")
     603                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO5")
     604                      .dwattr $C$DW$48, DW_AT_bit_offset(0x04)
     605                      .dwattr $C$DW$48, DW_AT_bit_size(0x02)
     606                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     608              
     609              $C$DW$49        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$49, DW_AT_name("GPIO6")
     612                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO6")
     613                      .dwattr $C$DW$49, DW_AT_bit_offset(0x02)
     614                      .dwattr $C$DW$49, DW_AT_bit_size(0x02)
     615                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618              $C$DW$50        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$50, DW_AT_name("GPIO7")
     621                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO7")
     622                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00)
     623                      .dwattr $C$DW$50, DW_AT_bit_size(0x02)
     624                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627              $C$DW$51        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     629                      .dwattr $C$DW$51, DW_AT_name("GPIO8")
     630                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO8")
     631                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0e)
     632                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
     633                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   13

     634                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     635              
     636              $C$DW$52        .dwtag  DW_TAG_member
     637                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     638                      .dwattr $C$DW$52, DW_AT_name("GPIO9")
     639                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO9")
     640                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     641                      .dwattr $C$DW$52, DW_AT_bit_size(0x02)
     642                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     643                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645              $C$DW$53        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$53, DW_AT_name("GPIO10")
     648                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO10")
     649                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0a)
     650                      .dwattr $C$DW$53, DW_AT_bit_size(0x02)
     651                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     652                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$54        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     656                      .dwattr $C$DW$54, DW_AT_name("GPIO11")
     657                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO11")
     658                      .dwattr $C$DW$54, DW_AT_bit_offset(0x08)
     659                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
     660                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     661                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     662              
     663              $C$DW$55        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$55, DW_AT_name("GPIO12")
     666                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO12")
     667                      .dwattr $C$DW$55, DW_AT_bit_offset(0x06)
     668                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     669                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     670                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     671              
     672              $C$DW$56        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$56, DW_AT_name("GPIO13")
     675                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO13")
     676                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
     677                      .dwattr $C$DW$56, DW_AT_bit_size(0x02)
     678                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     679                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     680              
     681              $C$DW$57        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     683                      .dwattr $C$DW$57, DW_AT_name("GPIO14")
     684                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO14")
     685                      .dwattr $C$DW$57, DW_AT_bit_offset(0x02)
     686                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
     687                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     688                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   14

     689              
     690              $C$DW$58        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$58, DW_AT_name("GPIO15")
     693                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO15")
     694                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
     695                      .dwattr $C$DW$58, DW_AT_bit_size(0x02)
     696                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     697                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699                      .dwendtag $C$DW$T$25
     700              
     701              
     702              $C$DW$T$26      .dwtag  DW_TAG_union_type
     703                      .dwattr $C$DW$T$26, DW_AT_name("GPA1_REG")
     704                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     705              $C$DW$59        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     707                      .dwattr $C$DW$59, DW_AT_name("all")
     708                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     709                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712              $C$DW$60        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
     714                      .dwattr $C$DW$60, DW_AT_name("bit")
     715                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     716                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     718              
     719                      .dwendtag $C$DW$T$26
     720              
     721              
     722              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     723                      .dwattr $C$DW$T$27, DW_AT_name("GPA2_BITS")
     724                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     725              $C$DW$61        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$61, DW_AT_name("GPIO16")
     728                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO16")
     729                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0e)
     730                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
     731                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     733              
     734              $C$DW$62        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$62, DW_AT_name("GPIO17")
     737                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO17")
     738                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0c)
     739                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
     740                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     741                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     742              
     743              $C$DW$63        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   15

     744                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$63, DW_AT_name("GPIO18")
     746                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO18")
     747                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0a)
     748                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     749                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$64        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$64, DW_AT_name("GPIO19")
     755                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO19")
     756                      .dwattr $C$DW$64, DW_AT_bit_offset(0x08)
     757                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
     758                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     760              
     761              $C$DW$65        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$65, DW_AT_name("GPIO20")
     764                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO20")
     765                      .dwattr $C$DW$65, DW_AT_bit_offset(0x06)
     766                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
     767                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     768                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     769              
     770              $C$DW$66        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$66, DW_AT_name("GPIO21")
     773                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO21")
     774                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04)
     775                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     776                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     778              
     779              $C$DW$67        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$67, DW_AT_name("GPIO22")
     782                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO22")
     783                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02)
     784                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
     785                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     786                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     787              
     788              $C$DW$68        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$68, DW_AT_name("GPIO23")
     791                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO23")
     792                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00)
     793                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     794                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$69        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   16

     799                      .dwattr $C$DW$69, DW_AT_name("GPIO24")
     800                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO24")
     801                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0e)
     802                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
     803                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     804                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     805              
     806              $C$DW$70        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     808                      .dwattr $C$DW$70, DW_AT_name("GPIO25")
     809                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO25")
     810                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c)
     811                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     812                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     813                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     814              
     815              $C$DW$71        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$71, DW_AT_name("GPIO26")
     818                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO26")
     819                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0a)
     820                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     821                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     822                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$72        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$72, DW_AT_name("GPIO27")
     827                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO27")
     828                      .dwattr $C$DW$72, DW_AT_bit_offset(0x08)
     829                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
     830                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     831                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     832              
     833              $C$DW$73        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$73, DW_AT_name("GPIO28")
     836                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO28")
     837                      .dwattr $C$DW$73, DW_AT_bit_offset(0x06)
     838                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
     839                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     840                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     841              
     842              $C$DW$74        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$74, DW_AT_name("GPIO29")
     845                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO29")
     846                      .dwattr $C$DW$74, DW_AT_bit_offset(0x04)
     847                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
     848                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     849                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     850              
     851              $C$DW$75        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$75, DW_AT_name("GPIO30")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   17

     854                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO30")
     855                      .dwattr $C$DW$75, DW_AT_bit_offset(0x02)
     856                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
     857                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     858                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860              $C$DW$76        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$76, DW_AT_name("GPIO31")
     863                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO31")
     864                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     865                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
     866                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     867                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     868              
     869                      .dwendtag $C$DW$T$27
     870              
     871              
     872              $C$DW$T$28      .dwtag  DW_TAG_union_type
     873                      .dwattr $C$DW$T$28, DW_AT_name("GPA2_REG")
     874                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     875              $C$DW$77        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
     877                      .dwattr $C$DW$77, DW_AT_name("all")
     878                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     879                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882              $C$DW$78        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$27)
     884                      .dwattr $C$DW$78, DW_AT_name("bit")
     885                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     886                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     888              
     889                      .dwendtag $C$DW$T$28
     890              
     891              
     892              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     893                      .dwattr $C$DW$T$29, DW_AT_name("GPACTRL2_BITS")
     894                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     895              $C$DW$79        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$79, DW_AT_name("USB0IOEN")
     898                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_USB0IOEN")
     899                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f)
     900                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     901                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     903              
     904              $C$DW$80        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     906                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
     907                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
     908                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   18

     909                      .dwattr $C$DW$80, DW_AT_bit_size(0x0f)
     910                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913                      .dwendtag $C$DW$T$29
     914              
     915              
     916              $C$DW$T$30      .dwtag  DW_TAG_union_type
     917                      .dwattr $C$DW$T$30, DW_AT_name("GPACTRL2_REG")
     918                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     919              $C$DW$81        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$81, DW_AT_name("all")
     922                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_all")
     923                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926              $C$DW$82        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     928                      .dwattr $C$DW$82, DW_AT_name("bit")
     929                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_bit")
     930                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     932              
     933                      .dwendtag $C$DW$T$30
     934              
     935              
     936              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     937                      .dwattr $C$DW$T$31, DW_AT_name("GPACTRL_BITS")
     938                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     939              $C$DW$83        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$83, DW_AT_name("QUALPRD0")
     942                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_QUALPRD0")
     943                      .dwattr $C$DW$83, DW_AT_bit_offset(0x08)
     944                      .dwattr $C$DW$83, DW_AT_bit_size(0x08)
     945                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948              $C$DW$84        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$84, DW_AT_name("QUALPRD1")
     951                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_QUALPRD1")
     952                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
     953                      .dwattr $C$DW$84, DW_AT_bit_size(0x08)
     954                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$85        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$85, DW_AT_name("QUALPRD2")
     960                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_QUALPRD2")
     961                      .dwattr $C$DW$85, DW_AT_bit_offset(0x08)
     962                      .dwattr $C$DW$85, DW_AT_bit_size(0x08)
     963                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   19

     964                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     965              
     966              $C$DW$86        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$86, DW_AT_name("QUALPRD3")
     969                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_QUALPRD3")
     970                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
     971                      .dwattr $C$DW$86, DW_AT_bit_size(0x08)
     972                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     973                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     974              
     975                      .dwendtag $C$DW$T$31
     976              
     977              
     978              $C$DW$T$32      .dwtag  DW_TAG_union_type
     979                      .dwattr $C$DW$T$32, DW_AT_name("GPACTRL_REG")
     980                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     981              $C$DW$87        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
     983                      .dwattr $C$DW$87, DW_AT_name("all")
     984                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
     985                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$88        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$31)
     990                      .dwattr $C$DW$88, DW_AT_name("bit")
     991                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
     992                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995                      .dwendtag $C$DW$T$32
     996              
     997              
     998              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     999                      .dwattr $C$DW$T$33, DW_AT_name("GPADAT_BITS")
    1000                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1001              $C$DW$89        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$89, DW_AT_name("GPIO0")
    1004                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO0")
    1005                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0f)
    1006                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$90        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$90, DW_AT_name("GPIO1")
    1013                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO1")
    1014                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e)
    1015                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1018              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   20

    1019              $C$DW$91        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$91, DW_AT_name("GPIO2")
    1022                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO2")
    1023                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0d)
    1024                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$92        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$92, DW_AT_name("GPIO3")
    1031                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO3")
    1032                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0c)
    1033                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1036              
    1037              $C$DW$93        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$93, DW_AT_name("GPIO4")
    1040                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO4")
    1041                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0b)
    1042                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1045              
    1046              $C$DW$94        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$94, DW_AT_name("GPIO5")
    1049                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO5")
    1050                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
    1051                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$95        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$95, DW_AT_name("GPIO6")
    1058                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO6")
    1059                      .dwattr $C$DW$95, DW_AT_bit_offset(0x09)
    1060                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$96        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$96, DW_AT_name("GPIO7")
    1067                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO7")
    1068                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08)
    1069                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   21

    1074                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$97, DW_AT_name("GPIO8")
    1076                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO8")
    1077                      .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1078                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$98        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$98, DW_AT_name("GPIO9")
    1085                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO9")
    1086                      .dwattr $C$DW$98, DW_AT_bit_offset(0x06)
    1087                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$99        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$99, DW_AT_name("GPIO10")
    1094                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO10")
    1095                      .dwattr $C$DW$99, DW_AT_bit_offset(0x05)
    1096                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$100       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$100, DW_AT_name("GPIO11")
    1103                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO11")
    1104                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04)
    1105                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1106                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$101       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$101, DW_AT_name("GPIO12")
    1112                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO12")
    1113                      .dwattr $C$DW$101, DW_AT_bit_offset(0x03)
    1114                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$102       .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$102, DW_AT_name("GPIO13")
    1121                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO13")
    1122                      .dwattr $C$DW$102, DW_AT_bit_offset(0x02)
    1123                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$103       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   22

    1129                      .dwattr $C$DW$103, DW_AT_name("GPIO14")
    1130                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO14")
    1131                      .dwattr $C$DW$103, DW_AT_bit_offset(0x01)
    1132                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$104       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$104, DW_AT_name("GPIO15")
    1139                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO15")
    1140                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1141                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1142                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$105       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$105, DW_AT_name("GPIO16")
    1148                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO16")
    1149                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0f)
    1150                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1151                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1152                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$106       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$106, DW_AT_name("GPIO17")
    1157                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO17")
    1158                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e)
    1159                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1160                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1161                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$107       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$107, DW_AT_name("GPIO18")
    1166                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO18")
    1167                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d)
    1168                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1169                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1170                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$108       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$108, DW_AT_name("GPIO19")
    1175                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO19")
    1176                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1177                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1178                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1179                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181              $C$DW$109       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$109, DW_AT_name("GPIO20")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   23

    1184                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO20")
    1185                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0b)
    1186                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1188                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$110       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$110, DW_AT_name("GPIO21")
    1193                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO21")
    1194                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0a)
    1195                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1197                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$111       .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$111, DW_AT_name("GPIO22")
    1202                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO22")
    1203                      .dwattr $C$DW$111, DW_AT_bit_offset(0x09)
    1204                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1205                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1206                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1207              
    1208              $C$DW$112       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$112, DW_AT_name("GPIO23")
    1211                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO23")
    1212                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    1213                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1215                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$113       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$113, DW_AT_name("GPIO24")
    1220                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO24")
    1221                      .dwattr $C$DW$113, DW_AT_bit_offset(0x07)
    1222                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1224                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$114       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$114, DW_AT_name("GPIO25")
    1229                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO25")
    1230                      .dwattr $C$DW$114, DW_AT_bit_offset(0x06)
    1231                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1232                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1233                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$115       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$115, DW_AT_name("GPIO26")
    1238                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO26")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   24

    1239                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05)
    1240                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1242                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$116       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$116, DW_AT_name("GPIO27")
    1247                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO27")
    1248                      .dwattr $C$DW$116, DW_AT_bit_offset(0x04)
    1249                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1250                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1251                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253              $C$DW$117       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$117, DW_AT_name("GPIO28")
    1256                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO28")
    1257                      .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    1258                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1260                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$118       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$118, DW_AT_name("GPIO29")
    1265                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO29")
    1266                      .dwattr $C$DW$118, DW_AT_bit_offset(0x02)
    1267                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1268                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1269                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$119       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$119, DW_AT_name("GPIO30")
    1274                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO30")
    1275                      .dwattr $C$DW$119, DW_AT_bit_offset(0x01)
    1276                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1278                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$120       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$120, DW_AT_name("GPIO31")
    1283                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO31")
    1284                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1285                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1286                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1287                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289                      .dwendtag $C$DW$T$33
    1290              
    1291              
    1292              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1293                      .dwattr $C$DW$T$34, DW_AT_name("GPADAT_REG")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   25

    1294                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1295              $C$DW$121       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1297                      .dwattr $C$DW$121, DW_AT_name("all")
    1298                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1299                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302              $C$DW$122       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    1304                      .dwattr $C$DW$122, DW_AT_name("bit")
    1305                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1306                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1308              
    1309                      .dwendtag $C$DW$T$34
    1310              
    1311              
    1312              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1313                      .dwattr $C$DW$T$35, DW_AT_name("GPB1_BITS")
    1314                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1315              $C$DW$123       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$123, DW_AT_name("GPIO32")
    1318                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO32")
    1319                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0e)
    1320                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    1321                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$124       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$124, DW_AT_name("GPIO33")
    1327                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO33")
    1328                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c)
    1329                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1330                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333              $C$DW$125       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$125, DW_AT_name("GPIO34")
    1336                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO34")
    1337                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    1338                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    1339                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$126       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$126, DW_AT_name("GPIO35")
    1345                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO35")
    1346                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08)
    1347                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    1348                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   26

    1349                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351              $C$DW$127       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$127, DW_AT_name("GPIO36")
    1354                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO36")
    1355                      .dwattr $C$DW$127, DW_AT_bit_offset(0x06)
    1356                      .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    1357                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$128       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$128, DW_AT_name("GPIO37")
    1363                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO37")
    1364                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04)
    1365                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1366                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1368              
    1369              $C$DW$129       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$129, DW_AT_name("GPIO38")
    1372                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO38")
    1373                      .dwattr $C$DW$129, DW_AT_bit_offset(0x02)
    1374                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1375                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$130       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$130, DW_AT_name("GPIO39")
    1381                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO39")
    1382                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1383                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1384                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1386              
    1387              $C$DW$131       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1389                      .dwattr $C$DW$131, DW_AT_name("GPIO40")
    1390                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO40")
    1391                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    1392                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1393                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1394                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1395              
    1396              $C$DW$132       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$132, DW_AT_name("GPIO41")
    1399                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO41")
    1400                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c)
    1401                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1402                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1403                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   27

    1404              
    1405              $C$DW$133       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1407                      .dwattr $C$DW$133, DW_AT_name("GPIO42")
    1408                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO42")
    1409                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a)
    1410                      .dwattr $C$DW$133, DW_AT_bit_size(0x02)
    1411                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1412                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414              $C$DW$134       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$134, DW_AT_name("GPIO43")
    1417                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO43")
    1418                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    1419                      .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    1420                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1421                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$135       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$135, DW_AT_name("GPIO44")
    1426                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO44")
    1427                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    1428                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1429                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1430                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$136       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    1435                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    1436                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    1437                      .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    1438                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1439                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441                      .dwendtag $C$DW$T$35
    1442              
    1443              
    1444              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1445                      .dwattr $C$DW$T$36, DW_AT_name("GPB1_REG")
    1446                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1447              $C$DW$137       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    1449                      .dwattr $C$DW$137, DW_AT_name("all")
    1450                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    1451                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$138       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$35)
    1456                      .dwattr $C$DW$138, DW_AT_name("bit")
    1457                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1458                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:56:02 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   28

    1459                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461                      .dwendtag $C$DW$T$36
    1462              
    1463              
    1464              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1465                      .dwattr $C$DW$T$37, DW_AT_name("GPB2_BITS")
    1466                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1467              $C$DW$139       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1470                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1471                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0c)
    1472                      .dwattr $C$DW$139, DW_AT_bit_size(0x04)
    1473                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1475              
    1476              $C$DW$140       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$140, DW_AT_name("GPIO50")
    1479                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO50")
    1480                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0a)
    1481                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    1482                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1484              
    1485              $C$DW$141       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1487                      .dwattr $C$DW$141, DW_AT_name("GPIO51")
    1488                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO51")
    1489                      .dwattr $C$DW$141, DW_AT_bit_offset(0x08)
    1490                      .dwattr $C$DW$141, DW_AT_bit_size(0x02)
    1491                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1493              
    1494              $C$DW$142       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
