TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 11:56:06 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initHRCAP.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")

      51              
      52                      .dwfde $C$DW$CIE, _initHRCAP
      53              
      54              ;***************************************************************
      55              ;* FNAME: _initHRCAP                    FR SIZE:   0           *
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    2

      56              ;*                                                             *
      57              ;* FUNCTION ENVIRONMENT                                        *
      58              ;*                                                             *
      59              ;* FUNCTION PROPERTIES                                         *
      60              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      61              ;***************************************************************
      62              
      63 00000000       _initHRCAP:
      64              ;* AR4   assigned to $O$C1
      65                      .dwcfi  cfa_offset, -2
      66                      .dwcfi  save_reg_to_mem, 26, 0
      67 00000000 7622   EALLOW
      68 00000001 761F!         MOVW      DP,#_HRCap2Regs       ; [CPU_U] 
         00000002 0000 
      69                      .dwpsn  file "../source/initHRCAP.c",line 14,column 5,is_stmt,isa 0
      70 00000003 8F00!         MOVL      XAR4,#_PieCtrlRegs    ; [CPU_U] |14| 
         00000004 0000 
      71                      .dwpsn  file "../source/initHRCAP.c",line 8,column 5,is_stmt,isa 0
      72 00000005 1A00!         OR        @_HRCap2Regs,#0x0001  ; [CPU_] |8| 
         00000006 0001 
      73                      .dwpsn  file "../source/initHRCAP.c",line 14,column 5,is_stmt,isa 0
      74 00000007 83A4          MOVL      XAR5,XAR4             ; [CPU_] |14| 
      75                      .dwpsn  file "../source/initHRCAP.c",line 9,column 5,is_stmt,isa 0
      76 00000008 1800!         AND       @_HRCap2Regs,#0xfeff  ; [CPU_] |9| 
         00000009 FEFF 
      77                      .dwpsn  file "../source/initHRCAP.c",line 10,column 5,is_stmt,isa 0
      78 0000000a 1800!         AND       @_HRCap2Regs,#0xfffd  ; [CPU_] |10| 
         0000000b FFFD 
      79                      .dwpsn  file "../source/initHRCAP.c",line 17,column 5,is_stmt,isa 0
      80 0000000c DC08          ADDB      XAR4,#8               ; [CPU_] |17| 
      81                      .dwpsn  file "../source/initHRCAP.c",line 11,column 5,is_stmt,isa 0
      82 0000000d 1800!         AND       @_HRCap2Regs,#0xfffb  ; [CPU_] |11| 
         0000000e FFFB 
      83                      .dwpsn  file "../source/initHRCAP.c",line 12,column 5,is_stmt,isa 0
      84 0000000f 1800!         AND       @_HRCap2Regs,#0xfff7  ; [CPU_] |12| 
         00000010 FFF7 
      85 00000011 761F!         MOVW      DP,#_SysCtrlRegs+9    ; [CPU_U] 
         00000012 0000 
      86                      .dwpsn  file "../source/initHRCAP.c",line 14,column 5,is_stmt,isa 0
      87 00000013 1AC5          OR        *+XAR5[0],#0x0001     ; [CPU_] |14| 
         00000014 0001 
      88                      .dwpsn  file "../source/initHRCAP.c",line 17,column 5,is_stmt,isa 0
      89 00000015 1AC4          OR        *+XAR4[0],#0x0080     ; [CPU_] |17| 
         00000016 0080 
      90                      .dwpsn  file "../source/initHRCAP.c",line 19,column 5,is_stmt,isa 0
      91 00000017 1A09!         OR        @_SysCtrlRegs+9,#0x0200 ; [CPU_] |19| 
         00000018 0200 
      92 00000019 2920   clrc DBGM
      93 0000001a 761A   EDIS
      94 0000001b FF69          SPM       #0                    ; [CPU_] 
      95              $C$DW$5 .dwtag  DW_TAG_TI_branch
      96                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
      97                      .dwattr $C$DW$5, DW_AT_TI_return
      98              
      99 0000001c 0006          LRETR     ; [CPU_] 
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    3

     100                      ; return occurs ; [] 
     101                      .dwattr $C$DW$4, DW_AT_TI_end_file("../source/initHRCAP.c")
     102                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x1d)
     103                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     104                      .dwendentry
     105                      .dwendtag $C$DW$4
     106              
     107              ;**************************************************************
     108              ;* UNDEFINED EXTERNAL REFERENCES                              *
     109              ;**************************************************************
     110                      .global _PieCtrlRegs
     111                      .global _HRCap2Regs
     112                      .global _SysCtrlRegs
     113              
     114              ;***************************************************************
     115              ;* TYPE INFORMATION                                            *
     116              ;***************************************************************
     117              
     118              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     119                      .dwattr $C$DW$T$20, DW_AT_name("CLKCTL_BITS")
     120                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     121              $C$DW$6 .dwtag  DW_TAG_member
     122                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     123                      .dwattr $C$DW$6, DW_AT_name("OSCCLKSRCSEL")
     124                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     125                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     126                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     127                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     128                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     129              
     130              $C$DW$7 .dwtag  DW_TAG_member
     131                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     132                      .dwattr $C$DW$7, DW_AT_name("OSCCLKSRC2SEL")
     133                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     134                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     135                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     136                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     137                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     138              
     139              $C$DW$8 .dwtag  DW_TAG_member
     140                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     141                      .dwattr $C$DW$8, DW_AT_name("WDCLKSRCSEL")
     142                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     143                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     144                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     145                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     146                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     147              
     148              $C$DW$9 .dwtag  DW_TAG_member
     149                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     150                      .dwattr $C$DW$9, DW_AT_name("TMR2CLKSRCSEL")
     151                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     152                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0b)
     153                      .dwattr $C$DW$9, DW_AT_bit_size(0x02)
     154                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    4

     155                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     156              
     157              $C$DW$10        .dwtag  DW_TAG_member
     158                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     159                      .dwattr $C$DW$10, DW_AT_name("TMR2CLKPRESCALE")
     160                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     161                      .dwattr $C$DW$10, DW_AT_bit_offset(0x08)
     162                      .dwattr $C$DW$10, DW_AT_bit_size(0x03)
     163                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     164                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     165              
     166              $C$DW$11        .dwtag  DW_TAG_member
     167                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     168                      .dwattr $C$DW$11, DW_AT_name("INTOSC1OFF")
     169                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_INTOSC1OFF")
     170                      .dwattr $C$DW$11, DW_AT_bit_offset(0x07)
     171                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     172                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     173                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     174              
     175              $C$DW$12        .dwtag  DW_TAG_member
     176                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     177                      .dwattr $C$DW$12, DW_AT_name("INTOSC1HALTI")
     178                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     179                      .dwattr $C$DW$12, DW_AT_bit_offset(0x06)
     180                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     181                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     182                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     183              
     184              $C$DW$13        .dwtag  DW_TAG_member
     185                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     186                      .dwattr $C$DW$13, DW_AT_name("INTOSC2OFF")
     187                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_INTOSC2OFF")
     188                      .dwattr $C$DW$13, DW_AT_bit_offset(0x05)
     189                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     190                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     191                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     192              
     193              $C$DW$14        .dwtag  DW_TAG_member
     194                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     195                      .dwattr $C$DW$14, DW_AT_name("INTOSC2HALTI")
     196                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     197                      .dwattr $C$DW$14, DW_AT_bit_offset(0x04)
     198                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     199                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     200                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     201              
     202              $C$DW$15        .dwtag  DW_TAG_member
     203                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     204                      .dwattr $C$DW$15, DW_AT_name("WDHALTI")
     205                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_WDHALTI")
     206                      .dwattr $C$DW$15, DW_AT_bit_offset(0x03)
     207                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     208                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     209                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    5

     210              
     211              $C$DW$16        .dwtag  DW_TAG_member
     212                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     213                      .dwattr $C$DW$16, DW_AT_name("XCLKINOFF")
     214                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_XCLKINOFF")
     215                      .dwattr $C$DW$16, DW_AT_bit_offset(0x02)
     216                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     217                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     218                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     219              
     220              $C$DW$17        .dwtag  DW_TAG_member
     221                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     222                      .dwattr $C$DW$17, DW_AT_name("XTALOSCOFF")
     223                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_XTALOSCOFF")
     224                      .dwattr $C$DW$17, DW_AT_bit_offset(0x01)
     225                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     226                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     227                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     228              
     229              $C$DW$18        .dwtag  DW_TAG_member
     230                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     231                      .dwattr $C$DW$18, DW_AT_name("NMIRESETSEL")
     232                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_NMIRESETSEL")
     233                      .dwattr $C$DW$18, DW_AT_bit_offset(0x00)
     234                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     235                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     236                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     237              
     238                      .dwendtag $C$DW$T$20
     239              
     240              
     241              $C$DW$T$21      .dwtag  DW_TAG_union_type
     242                      .dwattr $C$DW$T$21, DW_AT_name("CLKCTL_REG")
     243                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     244              $C$DW$19        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$19, DW_AT_name("all")
     247                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_all")
     248                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     249                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     250              
     251              $C$DW$20        .dwtag  DW_TAG_member
     252                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     253                      .dwattr $C$DW$20, DW_AT_name("bit")
     254                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_bit")
     255                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     256                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     257              
     258                      .dwendtag $C$DW$T$21
     259              
     260              
     261              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     262                      .dwattr $C$DW$T$22, DW_AT_name("EPWMCFG_BITS")
     263                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     264              $C$DW$21        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    6

     265                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     266                      .dwattr $C$DW$21, DW_AT_name("CONFIG")
     267                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_CONFIG")
     268                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0f)
     269                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     270                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     271                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     272              
     273              $C$DW$22        .dwtag  DW_TAG_member
     274                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     275                      .dwattr $C$DW$22, DW_AT_name("rsvd1")
     276                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd1")
     277                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     278                      .dwattr $C$DW$22, DW_AT_bit_size(0x0f)
     279                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     281              
     282                      .dwendtag $C$DW$T$22
     283              
     284              
     285              $C$DW$T$23      .dwtag  DW_TAG_union_type
     286                      .dwattr $C$DW$T$23, DW_AT_name("EPWMCFG_REG")
     287                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     288              $C$DW$23        .dwtag  DW_TAG_member
     289                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     290                      .dwattr $C$DW$23, DW_AT_name("all")
     291                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     292                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     293                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     294              
     295              $C$DW$24        .dwtag  DW_TAG_member
     296                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     297                      .dwattr $C$DW$24, DW_AT_name("bit")
     298                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     299                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     300                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     301              
     302                      .dwendtag $C$DW$T$23
     303              
     304              
     305              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     306                      .dwattr $C$DW$T$24, DW_AT_name("HCCTL_BITS")
     307                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     308              $C$DW$25        .dwtag  DW_TAG_member
     309                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     310                      .dwattr $C$DW$25, DW_AT_name("SOFTRESET")
     311                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_SOFTRESET")
     312                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f)
     313                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     314                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     315                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     316              
     317              $C$DW$26        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$26, DW_AT_name("RISEINTE")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    7

     320                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_RISEINTE")
     321                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     322                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     323                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     324                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     325              
     326              $C$DW$27        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     328                      .dwattr $C$DW$27, DW_AT_name("FALLINTE")
     329                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_FALLINTE")
     330                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     331                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     332                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     334              
     335              $C$DW$28        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$28, DW_AT_name("OVFINTE")
     338                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_OVFINTE")
     339                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c)
     340                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     341                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     342                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     343              
     344              $C$DW$29        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$29, DW_AT_name("rsvd1")
     347                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd1")
     348                      .dwattr $C$DW$29, DW_AT_bit_offset(0x08)
     349                      .dwattr $C$DW$29, DW_AT_bit_size(0x04)
     350                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     351                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     352              
     353              $C$DW$30        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     355                      .dwattr $C$DW$30, DW_AT_name("HCCAPCLKSEL")
     356                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_HCCAPCLKSEL")
     357                      .dwattr $C$DW$30, DW_AT_bit_offset(0x07)
     358                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     359                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$31        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$31, DW_AT_name("rsvd2")
     365                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd2")
     366                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     367                      .dwattr $C$DW$31, DW_AT_bit_size(0x07)
     368                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     370              
     371                      .dwendtag $C$DW$T$24
     372              
     373              
     374              $C$DW$T$25      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    8

     375                      .dwattr $C$DW$T$25, DW_AT_name("HCCTL_REG")
     376                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     377              $C$DW$32        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     379                      .dwattr $C$DW$32, DW_AT_name("all")
     380                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     381                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     383              
     384              $C$DW$33        .dwtag  DW_TAG_member
     385                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$24)
     386                      .dwattr $C$DW$33, DW_AT_name("bit")
     387                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     388                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     390              
     391                      .dwendtag $C$DW$T$25
     392              
     393              
     394              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     395                      .dwattr $C$DW$T$26, DW_AT_name("HCICLR_BITS")
     396                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     397              $C$DW$34        .dwtag  DW_TAG_member
     398                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     399                      .dwattr $C$DW$34, DW_AT_name("INT")
     400                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_INT")
     401                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0f)
     402                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     403                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     404                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     405              
     406              $C$DW$35        .dwtag  DW_TAG_member
     407                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     408                      .dwattr $C$DW$35, DW_AT_name("RISE")
     409                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_RISE")
     410                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0e)
     411                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     412                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     413                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     414              
     415              $C$DW$36        .dwtag  DW_TAG_member
     416                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     417                      .dwattr $C$DW$36, DW_AT_name("FALL")
     418                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_FALL")
     419                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0d)
     420                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     421                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     422                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     423              
     424              $C$DW$37        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     426                      .dwattr $C$DW$37, DW_AT_name("COUNTEROVF")
     427                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_COUNTEROVF")
     428                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0c)
     429                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE    9

     430                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     432              
     433              $C$DW$38        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$38, DW_AT_name("RISEOVF")
     436                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_RISEOVF")
     437                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0b)
     438                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     439                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     440                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     441              
     442              $C$DW$39        .dwtag  DW_TAG_member
     443                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     444                      .dwattr $C$DW$39, DW_AT_name("rsvd1")
     445                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd1")
     446                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
     447                      .dwattr $C$DW$39, DW_AT_bit_size(0x0b)
     448                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     449                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     450              
     451                      .dwendtag $C$DW$T$26
     452              
     453              
     454              $C$DW$T$27      .dwtag  DW_TAG_union_type
     455                      .dwattr $C$DW$T$27, DW_AT_name("HCICLR_REG")
     456                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     457              $C$DW$40        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$40, DW_AT_name("all")
     460                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
     461                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     463              
     464              $C$DW$41        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$26)
     466                      .dwattr $C$DW$41, DW_AT_name("bit")
     467                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
     468                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471                      .dwendtag $C$DW$T$27
     472              
     473              
     474              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     475                      .dwattr $C$DW$T$28, DW_AT_name("HCIFRC_BITS")
     476                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     477              $C$DW$42        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     479                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     480                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     481                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0f)
     482                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     483                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   10

     485              
     486              $C$DW$43        .dwtag  DW_TAG_member
     487                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     488                      .dwattr $C$DW$43, DW_AT_name("RISE")
     489                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_RISE")
     490                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0e)
     491                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     492                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495              $C$DW$44        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$44, DW_AT_name("FALL")
     498                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_FALL")
     499                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0d)
     500                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     501                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     502                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     503              
     504              $C$DW$45        .dwtag  DW_TAG_member
     505                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     506                      .dwattr $C$DW$45, DW_AT_name("COUNTEROVF")
     507                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_COUNTEROVF")
     508                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0c)
     509                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     510                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     511                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     512              
     513              $C$DW$46        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$46, DW_AT_name("RISEOVF")
     516                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RISEOVF")
     517                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0b)
     518                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     519                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     520                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     521              
     522              $C$DW$47        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     524                      .dwattr $C$DW$47, DW_AT_name("rsvd2")
     525                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd2")
     526                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00)
     527                      .dwattr $C$DW$47, DW_AT_bit_size(0x0b)
     528                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     529                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     530              
     531                      .dwendtag $C$DW$T$28
     532              
     533              
     534              $C$DW$T$29      .dwtag  DW_TAG_union_type
     535                      .dwattr $C$DW$T$29, DW_AT_name("HCIFRC_REG")
     536                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     537              $C$DW$48        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     539                      .dwattr $C$DW$48, DW_AT_name("all")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   11

     540                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_all")
     541                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     543              
     544              $C$DW$49        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$28)
     546                      .dwattr $C$DW$49, DW_AT_name("bit")
     547                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_bit")
     548                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     549                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     550              
     551                      .dwendtag $C$DW$T$29
     552              
     553              
     554              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     555                      .dwattr $C$DW$T$30, DW_AT_name("HCIFR_BITS")
     556                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     557              $C$DW$50        .dwtag  DW_TAG_member
     558                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     559                      .dwattr $C$DW$50, DW_AT_name("INT")
     560                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_INT")
     561                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0f)
     562                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     563                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     565              
     566              $C$DW$51        .dwtag  DW_TAG_member
     567                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     568                      .dwattr $C$DW$51, DW_AT_name("RISE")
     569                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_RISE")
     570                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0e)
     571                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     572                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     573                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     574              
     575              $C$DW$52        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$52, DW_AT_name("FALL")
     578                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_FALL")
     579                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0d)
     580                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     581                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     583              
     584              $C$DW$53        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     586                      .dwattr $C$DW$53, DW_AT_name("COUNTEROVF")
     587                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_COUNTEROVF")
     588                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0c)
     589                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     590                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     591                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     592              
     593              $C$DW$54        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   12

     595                      .dwattr $C$DW$54, DW_AT_name("RISEOVF")
     596                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_RISEOVF")
     597                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0b)
     598                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     599                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     600                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     601              
     602              $C$DW$55        .dwtag  DW_TAG_member
     603                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     604                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     605                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     606                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     607                      .dwattr $C$DW$55, DW_AT_bit_size(0x0b)
     608                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     610              
     611                      .dwendtag $C$DW$T$30
     612              
     613              
     614              $C$DW$T$31      .dwtag  DW_TAG_union_type
     615                      .dwattr $C$DW$T$31, DW_AT_name("HCIFR_REG")
     616                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     617              $C$DW$56        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$56, DW_AT_name("all")
     620                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     621                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     623              
     624              $C$DW$57        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$30)
     626                      .dwattr $C$DW$57, DW_AT_name("bit")
     627                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     628                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     630              
     631                      .dwendtag $C$DW$T$31
     632              
     633              
     634              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     635                      .dwattr $C$DW$T$34, DW_AT_name("HRCAP_REGS")
     636                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x20)
     637              $C$DW$58        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$25)
     639                      .dwattr $C$DW$58, DW_AT_name("HCCTL")
     640                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_HCCTL")
     641                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     643              
     644              $C$DW$59        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$31)
     646                      .dwattr $C$DW$59, DW_AT_name("HCIFR")
     647                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_HCIFR")
     648                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     649                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   13

     650              
     651              $C$DW$60        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$27)
     653                      .dwattr $C$DW$60, DW_AT_name("HCICLR")
     654                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_HCICLR")
     655                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     656                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     657              
     658              $C$DW$61        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$29)
     660                      .dwattr $C$DW$61, DW_AT_name("HCIFRC")
     661                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_HCIFRC")
     662                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     663                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     664              
     665              $C$DW$62        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     667                      .dwattr $C$DW$62, DW_AT_name("HCCOUNTER")
     668                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_HCCOUNTER")
     669                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     670                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     671              
     672              $C$DW$63        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$32)
     674                      .dwattr $C$DW$63, DW_AT_name("rsvd1")
     675                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd1")
     676                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     677                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     678              
     679              $C$DW$64        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$64, DW_AT_name("HCCAPCNTRISE0")
     682                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_HCCAPCNTRISE0")
     683                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     684                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     685              
     686              $C$DW$65        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$65, DW_AT_name("rsvd2")
     689                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd2")
     690                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     691                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$66        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$66, DW_AT_name("HCCAPCNTFALL0")
     696                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_HCCAPCNTFALL0")
     697                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     698                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$67        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$67, DW_AT_name("rsvd3")
     703                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd3")
     704                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   14

     705                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$68        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$68, DW_AT_name("rsvd4")
     710                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd4")
     711                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     712                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$69        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$69, DW_AT_name("rsvd5")
     717                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd5")
     718                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     719                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$70        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$33)
     723                      .dwattr $C$DW$70, DW_AT_name("rsvd6")
     724                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd6")
     725                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     726                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728              $C$DW$71        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$71, DW_AT_name("HCCAPCNTRISE1")
     731                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_HCCAPCNTRISE1")
     732                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     733                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735              $C$DW$72        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$72, DW_AT_name("rsvd7")
     738                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd7")
     739                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     740                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     741              
     742              $C$DW$73        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$73, DW_AT_name("HCCAPCNTFALL1")
     745                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_HCCAPCNTFALL1")
     746                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     747                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     748              
     749              $C$DW$74        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     751                      .dwattr $C$DW$74, DW_AT_name("rsvd8")
     752                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd8")
     753                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     754                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     755              
     756              $C$DW$75        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$75, DW_AT_name("rsvd9")
     759                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd9")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   15

     760                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     761                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     762              
     763              $C$DW$76        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$76, DW_AT_name("rsvd10")
     766                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd10")
     767                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     768                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     769              
     770              $C$DW$77        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$77, DW_AT_name("rsvd11")
     773                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd11")
     774                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     775                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777              $C$DW$78        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$78, DW_AT_name("rsvd12")
     780                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd12")
     781                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     782                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784                      .dwendtag $C$DW$T$34
     785              
     786              $C$DW$79        .dwtag  DW_TAG_TI_far_type
     787                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$34)
     788              
     789              $C$DW$T$77      .dwtag  DW_TAG_volatile_type
     790                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$79)
     791              
     792              
     793              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     794                      .dwattr $C$DW$T$35, DW_AT_name("INTOSC1TRIM_BITS")
     795                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     796              $C$DW$80        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$80, DW_AT_name("COARSETRIM")
     799                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_COARSETRIM")
     800                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08)
     801                      .dwattr $C$DW$80, DW_AT_bit_size(0x08)
     802                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     804              
     805              $C$DW$81        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
     808                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
     809                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07)
     810                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     811                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     813              
     814              $C$DW$82        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   16

     815                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     816                      .dwattr $C$DW$82, DW_AT_name("FINETRIM")
     817                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_FINETRIM")
     818                      .dwattr $C$DW$82, DW_AT_bit_offset(0x01)
     819                      .dwattr $C$DW$82, DW_AT_bit_size(0x06)
     820                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     822              
     823              $C$DW$83        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     825                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
     826                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
     827                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
     828                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     829                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     830                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832                      .dwendtag $C$DW$T$35
     833              
     834              
     835              $C$DW$T$36      .dwtag  DW_TAG_union_type
     836                      .dwattr $C$DW$T$36, DW_AT_name("INTOSC1TRIM_REG")
     837                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     838              $C$DW$84        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$84, DW_AT_name("all")
     841                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
     842                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     844              
     845              $C$DW$85        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$35)
     847                      .dwattr $C$DW$85, DW_AT_name("bit")
     848                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
     849                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852                      .dwendtag $C$DW$T$36
     853              
     854              
     855              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     856                      .dwattr $C$DW$T$37, DW_AT_name("INTOSC2TRIM_BITS")
     857                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     858              $C$DW$86        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$86, DW_AT_name("COARSETRIM")
     861                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_COARSETRIM")
     862                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
     863                      .dwattr $C$DW$86, DW_AT_bit_size(0x08)
     864                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$87        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$87, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   17

     870                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd1")
     871                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
     872                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     875              
     876              $C$DW$88        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$88, DW_AT_name("FINETRIM")
     879                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_FINETRIM")
     880                      .dwattr $C$DW$88, DW_AT_bit_offset(0x01)
     881                      .dwattr $C$DW$88, DW_AT_bit_size(0x06)
     882                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$89        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$89, DW_AT_name("rsvd2")
     888                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd2")
     889                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
     890                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894                      .dwendtag $C$DW$T$37
     895              
     896              
     897              $C$DW$T$38      .dwtag  DW_TAG_union_type
     898                      .dwattr $C$DW$T$38, DW_AT_name("INTOSC2TRIM_REG")
     899                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     900              $C$DW$90        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$90, DW_AT_name("all")
     903                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     904                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     906              
     907              $C$DW$91        .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$37)
     909                      .dwattr $C$DW$91, DW_AT_name("bit")
     910                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
     911                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     913              
     914                      .dwendtag $C$DW$T$38
     915              
     916              
     917              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     918                      .dwattr $C$DW$T$39, DW_AT_name("JTAGDEBUG_BITS")
     919                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     920              $C$DW$92        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$92, DW_AT_name("JTAGDIS")
     923                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_JTAGDIS")
     924                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   18

     925                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     928              
     929              $C$DW$93        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
     932                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
     933                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
     934                      .dwattr $C$DW$93, DW_AT_bit_size(0x0f)
     935                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     937              
     938                      .dwendtag $C$DW$T$39
     939              
     940              
     941              $C$DW$T$40      .dwtag  DW_TAG_union_type
     942                      .dwattr $C$DW$T$40, DW_AT_name("JTAGDEBUG_REG")
     943                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     944              $C$DW$94        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$94, DW_AT_name("all")
     947                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
     948                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     950              
     951              $C$DW$95        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$39)
     953                      .dwattr $C$DW$95, DW_AT_name("bit")
     954                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
     955                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958                      .dwendtag $C$DW$T$40
     959              
     960              
     961              $C$DW$T$41      .dwtag  DW_TAG_structure_type
     962                      .dwattr $C$DW$T$41, DW_AT_name("LOSPCP_BITS")
     963                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
     964              $C$DW$96        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$96, DW_AT_name("LSPCLK")
     967                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_LSPCLK")
     968                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0d)
     969                      .dwattr $C$DW$96, DW_AT_bit_size(0x03)
     970                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     972              
     973              $C$DW$97        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
     976                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
     977                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
     978                      .dwattr $C$DW$97, DW_AT_bit_size(0x0d)
     979                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   19

     980                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     981              
     982                      .dwendtag $C$DW$T$41
     983              
     984              
     985              $C$DW$T$42      .dwtag  DW_TAG_union_type
     986                      .dwattr $C$DW$T$42, DW_AT_name("LOSPCP_REG")
     987                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
     988              $C$DW$98        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$98, DW_AT_name("all")
     991                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
     992                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$99        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$41)
     997                      .dwattr $C$DW$99, DW_AT_name("bit")
     998                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
     999                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002                      .dwendtag $C$DW$T$42
    1003              
    1004              
    1005              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1006                      .dwattr $C$DW$T$43, DW_AT_name("LPMCR0_BITS")
    1007                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1008              $C$DW$100       .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$100, DW_AT_name("LPM")
    1011                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_LPM")
    1012                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0e)
    1013                      .dwattr $C$DW$100, DW_AT_bit_size(0x02)
    1014                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$101       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$101, DW_AT_name("QUALSTDBY")
    1020                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_QUALSTDBY")
    1021                      .dwattr $C$DW$101, DW_AT_bit_offset(0x08)
    1022                      .dwattr $C$DW$101, DW_AT_bit_size(0x06)
    1023                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$102       .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1029                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    1030                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1031                      .dwattr $C$DW$102, DW_AT_bit_size(0x07)
    1032                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1034              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   20

    1035              $C$DW$103       .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$103, DW_AT_name("WDINTE")
    1038                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_WDINTE")
    1039                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1040                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044                      .dwendtag $C$DW$T$43
    1045              
    1046              
    1047              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1048                      .dwattr $C$DW$T$44, DW_AT_name("LPMCR0_REG")
    1049                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1050              $C$DW$104       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$104, DW_AT_name("all")
    1053                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1054                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$105       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$43)
    1059                      .dwattr $C$DW$105, DW_AT_name("bit")
    1060                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1061                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064                      .dwendtag $C$DW$T$44
    1065              
    1066              
    1067              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1068                      .dwattr $C$DW$T$45, DW_AT_name("PCLKCR0_BITS")
    1069                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1070              $C$DW$106       .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$106, DW_AT_name("HRPWMENCLK")
    1073                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_HRPWMENCLK")
    1074                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1075                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1076                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1078              
    1079              $C$DW$107       .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$107, DW_AT_name("rsvd1")
    1082                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd1")
    1083                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1084                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1085                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088              $C$DW$108       .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   21

    1090                      .dwattr $C$DW$108, DW_AT_name("TBCLKSYNC")
    1091                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1092                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1093                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1094                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1096              
    1097              $C$DW$109       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$109, DW_AT_name("ADCENCLK")
    1100                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ADCENCLK")
    1101                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1102                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1103                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1105              
    1106              $C$DW$110       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$110, DW_AT_name("I2CAENCLK")
    1109                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_I2CAENCLK")
    1110                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1111                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1112                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115              $C$DW$111       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1118                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1119                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1120                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1121                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$112       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$112, DW_AT_name("rsvd3")
    1127                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd3")
    1128                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08)
    1129                      .dwattr $C$DW$112, DW_AT_bit_size(0x02)
    1130                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$113       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$113, DW_AT_name("SPIAENCLK")
    1136                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SPIAENCLK")
    1137                      .dwattr $C$DW$113, DW_AT_bit_offset(0x07)
    1138                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1139                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1141              
    1142              $C$DW$114       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$114, DW_AT_name("SPIBENCLK")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   22

    1145                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SPIBENCLK")
    1146                      .dwattr $C$DW$114, DW_AT_bit_offset(0x06)
    1147                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1148                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$115       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$115, DW_AT_name("SCIAENCLK")
    1154                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SCIAENCLK")
    1155                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05)
    1156                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$116       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$116, DW_AT_name("SCIBENCLK")
    1163                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_SCIBENCLK")
    1164                      .dwattr $C$DW$116, DW_AT_bit_offset(0x04)
    1165                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1166                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169              $C$DW$117       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$117, DW_AT_name("MCBSPAENCLK")
    1172                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_MCBSPAENCLK")
    1173                      .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    1174                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$118       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$118, DW_AT_name("rsvd4")
    1181                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd4")
    1182                      .dwattr $C$DW$118, DW_AT_bit_offset(0x02)
    1183                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1184                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187              $C$DW$119       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$119, DW_AT_name("ECANAENCLK")
    1190                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ECANAENCLK")
    1191                      .dwattr $C$DW$119, DW_AT_bit_offset(0x01)
    1192                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1193                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1195              
    1196              $C$DW$120       .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$120, DW_AT_name("rsvd5")
    1199                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd5")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   23

    1200                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1201                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1202                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205                      .dwendtag $C$DW$T$45
    1206              
    1207              
    1208              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1209                      .dwattr $C$DW$T$46, DW_AT_name("PCLKCR0_REG")
    1210                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1211              $C$DW$121       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$121, DW_AT_name("all")
    1214                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1215                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$122       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$45)
    1220                      .dwattr $C$DW$122, DW_AT_name("bit")
    1221                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1222                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225                      .dwendtag $C$DW$T$46
    1226              
    1227              
    1228              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1229                      .dwattr $C$DW$T$47, DW_AT_name("PCLKCR1_BITS")
    1230                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1231              $C$DW$123       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$123, DW_AT_name("EPWM1ENCLK")
    1234                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_EPWM1ENCLK")
    1235                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f)
    1236                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1237                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1239              
    1240              $C$DW$124       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$124, DW_AT_name("EPWM2ENCLK")
    1243                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EPWM2ENCLK")
    1244                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1245                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1246                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1248              
    1249              $C$DW$125       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$125, DW_AT_name("EPWM3ENCLK")
    1252                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EPWM3ENCLK")
    1253                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1254                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   24

    1255                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258              $C$DW$126       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$126, DW_AT_name("EPWM4ENCLK")
    1261                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_EPWM4ENCLK")
    1262                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c)
    1263                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1264                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1266              
    1267              $C$DW$127       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$127, DW_AT_name("EPWM5ENCLK")
    1270                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_EPWM5ENCLK")
    1271                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b)
    1272                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1273                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$128       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$128, DW_AT_name("EPWM6ENCLK")
    1279                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_EPWM6ENCLK")
    1280                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    1281                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1282                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285              $C$DW$129       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$129, DW_AT_name("EPWM7ENCLK")
    1288                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_EPWM7ENCLK")
    1289                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09)
    1290                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1291                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1293              
    1294              $C$DW$130       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$130, DW_AT_name("EPWM8ENCLK")
    1297                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_EPWM8ENCLK")
    1298                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08)
    1299                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1300                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$131       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$131, DW_AT_name("ECAP1ENCLK")
    1306                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ECAP1ENCLK")
    1307                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07)
    1308                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1309                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   25

    1310                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1311              
    1312              $C$DW$132       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$132, DW_AT_name("ECAP2ENCLK")
    1315                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ECAP2ENCLK")
    1316                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06)
    1317                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1320              
    1321              $C$DW$133       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$133, DW_AT_name("ECAP3ENCLK")
    1324                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ECAP3ENCLK")
    1325                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05)
    1326                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1327                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$134       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1333                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1334                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02)
    1335                      .dwattr $C$DW$134, DW_AT_bit_size(0x03)
    1336                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$135       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$135, DW_AT_name("EQEP1ENCLK")
    1342                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_EQEP1ENCLK")
    1343                      .dwattr $C$DW$135, DW_AT_bit_offset(0x01)
    1344                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$136       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$136, DW_AT_name("EQEP2ENCLK")
    1351                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_EQEP2ENCLK")
    1352                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    1353                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357                      .dwendtag $C$DW$T$47
    1358              
    1359              
    1360              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1361                      .dwattr $C$DW$T$48, DW_AT_name("PCLKCR1_REG")
    1362                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1363              $C$DW$137       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   26

    1365                      .dwattr $C$DW$137, DW_AT_name("all")
    1366                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    1367                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$138       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$47)
    1372                      .dwattr $C$DW$138, DW_AT_name("bit")
    1373                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1374                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377                      .dwendtag $C$DW$T$48
    1378              
    1379              
    1380              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1381                      .dwattr $C$DW$T$49, DW_AT_name("PCLKCR2_BITS")
    1382                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1383              $C$DW$139       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1386                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1387                      .dwattr $C$DW$139, DW_AT_bit_offset(0x08)
    1388                      .dwattr $C$DW$139, DW_AT_bit_size(0x08)
    1389                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$140       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$140, DW_AT_name("HRCAP1ENCLK")
    1395                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_HRCAP1ENCLK")
    1396                      .dwattr $C$DW$140, DW_AT_bit_offset(0x07)
    1397                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1398                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401              $C$DW$141       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1403                      .dwattr $C$DW$141, DW_AT_name("HRCAP2ENCLK")
    1404                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_HRCAP2ENCLK")
    1405                      .dwattr $C$DW$141, DW_AT_bit_offset(0x06)
    1406                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1407                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1409              
    1410              $C$DW$142       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$142, DW_AT_name("HRCAP3ENCLK")
    1413                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_HRCAP3ENCLK")
    1414                      .dwattr $C$DW$142, DW_AT_bit_offset(0x05)
    1415                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1416                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$143       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:07 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initHRCAP.asm                                                        PAGE   27

    1420                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
