TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 20:58:34 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initECAP1.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("ECap1Regs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ECap1Regs")

     100 00000027 1A15!         OR        @_ECap1Regs+21,#0x0010 ; [CPU_] |30| 
         00000028 0010 
     101                      .dwpsn  file "../source/initECAP1.c",line 31,column 4,is_stmt,isa 0
     102 00000029 1A15!         OR        @_ECap1Regs+21,#0x0008 ; [CPU_] |31| 
         0000002a 0008 
     103                      .dwpsn  file "../source/initECAP1.c",line 33,column 4,is_stmt,isa 0
     104 0000002b 2B17!         MOV       @_ECap1Regs+23,#0     ; [CPU_] |33| 
     105                      .dwpsn  file "../source/initECAP1.c",line 35,column 4,is_stmt,isa 0
     106 0000002c 2B16!         MOV       @_ECap1Regs+22,#0     ; [CPU_] |35| 
     107                      .dwpsn  file "../source/initECAP1.c",line 36,column 4,is_stmt,isa 0
     108 0000002d 18C4          AND       *+XAR4[0],#0xfffd     ; [CPU_] |36| 
         0000002e FFFD 
     109                      .dwpsn  file "../source/initECAP1.c",line 37,column 4,is_stmt,isa 0
     110 0000002f 1A16!         OR        @_ECap1Regs+22,#0x0004 ; [CPU_] |37| 
         00000030 0004 
     111 00000031 761A   EDIS
     112 00000032 FF69          SPM       #0                    ; [CPU_] 
     113              $C$DW$4 .dwtag  DW_TAG_TI_branch
     114                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
     115                      .dwattr $C$DW$4, DW_AT_TI_return
     116              
     117 00000033 0006          LRETR     ; [CPU_] 
     118                      ; return occurs ; [] 
     119                      .dwattr $C$DW$3, DW_AT_TI_end_file("../source/initECAP1.c")
     120                      .dwattr $C$DW$3, DW_AT_TI_end_line(0x29)
     121                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     122                      .dwendentry
     123                      .dwendtag $C$DW$3
     124              
     125 00000034               .sect   ".text"
     126                      .clink
     127                      .global _Fail
     128              
     129              $C$DW$5 .dwtag  DW_TAG_subprogram
     130                      .dwattr $C$DW$5, DW_AT_name("Fail")
     131                      .dwattr $C$DW$5, DW_AT_low_pc(_Fail)
     132                      .dwattr $C$DW$5, DW_AT_high_pc(0x00)
     133                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_Fail")
     134                      .dwattr $C$DW$5, DW_AT_external
     135                      .dwattr $C$DW$5, DW_AT_TI_begin_file("../source/initECAP1.c")
     136                      .dwattr $C$DW$5, DW_AT_TI_begin_line(0x2b)
     137                      .dwattr $C$DW$5, DW_AT_TI_begin_column(0x06)
     138                      .dwattr $C$DW$5, DW_AT_TI_max_frame_size(-2)
     139                      .dwpsn  file "../source/initECAP1.c",line 44,column 1,is_stmt,address _Fail,isa 0
     140              
     141                      .dwfde $C$DW$CIE, _Fail
     142              
     143              ;***************************************************************
     144              ;* FNAME: _Fail                         FR SIZE:   0           *
     145              ;*                                                             *
     146              ;* FUNCTION ENVIRONMENT                                        *
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    4

     147              ;*                                                             *
     148              ;* FUNCTION PROPERTIES                                         *
     149              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     150              ;***************************************************************
     151              
     152 00000034       _Fail:
     153                      .dwcfi  cfa_offset, -2
     154                      .dwcfi  save_reg_to_mem, 26, 0
     155 00000034 7625     ESTOP0
     156 00000035 FF69          SPM       #0                    ; [CPU_] 
     157              $C$DW$6 .dwtag  DW_TAG_TI_branch
     158                      .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     159                      .dwattr $C$DW$6, DW_AT_TI_return
     160              
     161 00000036 0006          LRETR     ; [CPU_] 
     162                      ; return occurs ; [] 
     163                      .dwattr $C$DW$5, DW_AT_TI_end_file("../source/initECAP1.c")
     164                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x2e)
     165                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     166                      .dwendentry
     167                      .dwendtag $C$DW$5
     168              
     169              ;**************************************************************
     170              ;* UNDEFINED EXTERNAL REFERENCES                              *
     171              ;**************************************************************
     172                      .global _ECap1Regs
     173                      .global _SysCtrlRegs
     174              
     175              ;***************************************************************
     176              ;* TYPE INFORMATION                                            *
     177              ;***************************************************************
     178              
     179              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     180                      .dwattr $C$DW$T$20, DW_AT_name("CLKCTL_BITS")
     181                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     182              $C$DW$7 .dwtag  DW_TAG_member
     183                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     184                      .dwattr $C$DW$7, DW_AT_name("OSCCLKSRCSEL")
     185                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     186                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0f)
     187                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     188                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     189                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     190              
     191              $C$DW$8 .dwtag  DW_TAG_member
     192                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     193                      .dwattr $C$DW$8, DW_AT_name("OSCCLKSRC2SEL")
     194                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     195                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0e)
     196                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     197                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     198                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     199              
     200              $C$DW$9 .dwtag  DW_TAG_member
     201                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    5

     202                      .dwattr $C$DW$9, DW_AT_name("WDCLKSRCSEL")
     203                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     204                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0d)
     205                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     206                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     207                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     208              
     209              $C$DW$10        .dwtag  DW_TAG_member
     210                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     211                      .dwattr $C$DW$10, DW_AT_name("TMR2CLKSRCSEL")
     212                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     213                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b)
     214                      .dwattr $C$DW$10, DW_AT_bit_size(0x02)
     215                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     216                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     217              
     218              $C$DW$11        .dwtag  DW_TAG_member
     219                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     220                      .dwattr $C$DW$11, DW_AT_name("TMR2CLKPRESCALE")
     221                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     222                      .dwattr $C$DW$11, DW_AT_bit_offset(0x08)
     223                      .dwattr $C$DW$11, DW_AT_bit_size(0x03)
     224                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     225                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     226              
     227              $C$DW$12        .dwtag  DW_TAG_member
     228                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     229                      .dwattr $C$DW$12, DW_AT_name("INTOSC1OFF")
     230                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_INTOSC1OFF")
     231                      .dwattr $C$DW$12, DW_AT_bit_offset(0x07)
     232                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     233                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     234                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     235              
     236              $C$DW$13        .dwtag  DW_TAG_member
     237                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     238                      .dwattr $C$DW$13, DW_AT_name("INTOSC1HALTI")
     239                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     240                      .dwattr $C$DW$13, DW_AT_bit_offset(0x06)
     241                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     242                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     243                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     244              
     245              $C$DW$14        .dwtag  DW_TAG_member
     246                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     247                      .dwattr $C$DW$14, DW_AT_name("INTOSC2OFF")
     248                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_INTOSC2OFF")
     249                      .dwattr $C$DW$14, DW_AT_bit_offset(0x05)
     250                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     251                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     252                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     253              
     254              $C$DW$15        .dwtag  DW_TAG_member
     255                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     256                      .dwattr $C$DW$15, DW_AT_name("INTOSC2HALTI")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    6

     257                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     258                      .dwattr $C$DW$15, DW_AT_bit_offset(0x04)
     259                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     260                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     261                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     262              
     263              $C$DW$16        .dwtag  DW_TAG_member
     264                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     265                      .dwattr $C$DW$16, DW_AT_name("WDHALTI")
     266                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_WDHALTI")
     267                      .dwattr $C$DW$16, DW_AT_bit_offset(0x03)
     268                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     269                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     270                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     271              
     272              $C$DW$17        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     274                      .dwattr $C$DW$17, DW_AT_name("XCLKINOFF")
     275                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_XCLKINOFF")
     276                      .dwattr $C$DW$17, DW_AT_bit_offset(0x02)
     277                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     278                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     279                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     280              
     281              $C$DW$18        .dwtag  DW_TAG_member
     282                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     283                      .dwattr $C$DW$18, DW_AT_name("XTALOSCOFF")
     284                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_XTALOSCOFF")
     285                      .dwattr $C$DW$18, DW_AT_bit_offset(0x01)
     286                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     287                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     288                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     289              
     290              $C$DW$19        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     292                      .dwattr $C$DW$19, DW_AT_name("NMIRESETSEL")
     293                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_NMIRESETSEL")
     294                      .dwattr $C$DW$19, DW_AT_bit_offset(0x00)
     295                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     296                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     298              
     299                      .dwendtag $C$DW$T$20
     300              
     301              
     302              $C$DW$T$21      .dwtag  DW_TAG_union_type
     303                      .dwattr $C$DW$T$21, DW_AT_name("CLKCTL_REG")
     304                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     305              $C$DW$20        .dwtag  DW_TAG_member
     306                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     307                      .dwattr $C$DW$20, DW_AT_name("all")
     308                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_all")
     309                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     310                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     311              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    7

     312              $C$DW$21        .dwtag  DW_TAG_member
     313                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
     314                      .dwattr $C$DW$21, DW_AT_name("bit")
     315                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_bit")
     316                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     317                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     318              
     319                      .dwendtag $C$DW$T$21
     320              
     321              
     322              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     323                      .dwattr $C$DW$T$25, DW_AT_name("ECAP_REGS")
     324                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x20)
     325              $C$DW$22        .dwtag  DW_TAG_member
     326                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     327                      .dwattr $C$DW$22, DW_AT_name("TSCTR")
     328                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_TSCTR")
     329                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     331              
     332              $C$DW$23        .dwtag  DW_TAG_member
     333                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     334                      .dwattr $C$DW$23, DW_AT_name("CTRPHS")
     335                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_CTRPHS")
     336                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     337                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     338              
     339              $C$DW$24        .dwtag  DW_TAG_member
     340                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     341                      .dwattr $C$DW$24, DW_AT_name("CAP1")
     342                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_CAP1")
     343                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     344                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     345              
     346              $C$DW$25        .dwtag  DW_TAG_member
     347                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     348                      .dwattr $C$DW$25, DW_AT_name("CAP2")
     349                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_CAP2")
     350                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     351                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     352              
     353              $C$DW$26        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     355                      .dwattr $C$DW$26, DW_AT_name("CAP3")
     356                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_CAP3")
     357                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     358                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     359              
     360              $C$DW$27        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$22)
     362                      .dwattr $C$DW$27, DW_AT_name("CAP4")
     363                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_CAP4")
     364                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     365                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     366              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    8

     367              $C$DW$28        .dwtag  DW_TAG_member
     368                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     369                      .dwattr $C$DW$28, DW_AT_name("rsvd1")
     370                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd1")
     371                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     372                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     373              
     374              $C$DW$29        .dwtag  DW_TAG_member
     375                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$27)
     376                      .dwattr $C$DW$29, DW_AT_name("ECCTL1")
     377                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_ECCTL1")
     378                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     379                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     380              
     381              $C$DW$30        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$29)
     383                      .dwattr $C$DW$30, DW_AT_name("ECCTL2")
     384                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_ECCTL2")
     385                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     386                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     387              
     388              $C$DW$31        .dwtag  DW_TAG_member
     389                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$31)
     390                      .dwattr $C$DW$31, DW_AT_name("ECEINT")
     391                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_ECEINT")
     392                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     393                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     394              
     395              $C$DW$32        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$33)
     397                      .dwattr $C$DW$32, DW_AT_name("ECFLG")
     398                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_ECFLG")
     399                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     400                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     401              
     402              $C$DW$33        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$33)
     404                      .dwattr $C$DW$33, DW_AT_name("ECCLR")
     405                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_ECCLR")
     406                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     407                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     408              
     409              $C$DW$34        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$31)
     411                      .dwattr $C$DW$34, DW_AT_name("ECFRC")
     412                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_ECFRC")
     413                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     414                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     415              
     416              $C$DW$35        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$24)
     418                      .dwattr $C$DW$35, DW_AT_name("rsvd2")
     419                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd2")
     420                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     421                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE    9

     422              
     423                      .dwendtag $C$DW$T$25
     424              
     425              $C$DW$36        .dwtag  DW_TAG_TI_far_type
     426                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
     427              
     428              $C$DW$T$70      .dwtag  DW_TAG_volatile_type
     429                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$36)
     430              
     431              
     432              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     433                      .dwattr $C$DW$T$26, DW_AT_name("ECCTL1_BITS")
     434                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     435              $C$DW$37        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     437                      .dwattr $C$DW$37, DW_AT_name("CAP1POL")
     438                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_CAP1POL")
     439                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0f)
     440                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     441                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     442                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     443              
     444              $C$DW$38        .dwtag  DW_TAG_member
     445                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     446                      .dwattr $C$DW$38, DW_AT_name("CTRRST1")
     447                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_CTRRST1")
     448                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0e)
     449                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     450                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     452              
     453              $C$DW$39        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$39, DW_AT_name("CAP2POL")
     456                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_CAP2POL")
     457                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0d)
     458                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     459                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     461              
     462              $C$DW$40        .dwtag  DW_TAG_member
     463                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     464                      .dwattr $C$DW$40, DW_AT_name("CTRRST2")
     465                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_CTRRST2")
     466                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0c)
     467                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     468                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471              $C$DW$41        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$41, DW_AT_name("CAP3POL")
     474                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_CAP3POL")
     475                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0b)
     476                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   10

     477                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     479              
     480              $C$DW$42        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$42, DW_AT_name("CTRRST3")
     483                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_CTRRST3")
     484                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0a)
     485                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     486                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     487                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$43        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     491                      .dwattr $C$DW$43, DW_AT_name("CAP4POL")
     492                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_CAP4POL")
     493                      .dwattr $C$DW$43, DW_AT_bit_offset(0x09)
     494                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     495                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     496                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     497              
     498              $C$DW$44        .dwtag  DW_TAG_member
     499                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     500                      .dwattr $C$DW$44, DW_AT_name("CTRRST4")
     501                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_CTRRST4")
     502                      .dwattr $C$DW$44, DW_AT_bit_offset(0x08)
     503                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     504                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     506              
     507              $C$DW$45        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     509                      .dwattr $C$DW$45, DW_AT_name("CAPLDEN")
     510                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_CAPLDEN")
     511                      .dwattr $C$DW$45, DW_AT_bit_offset(0x07)
     512                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     513                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$46        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$46, DW_AT_name("PRESCALE")
     519                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PRESCALE")
     520                      .dwattr $C$DW$46, DW_AT_bit_offset(0x02)
     521                      .dwattr $C$DW$46, DW_AT_bit_size(0x05)
     522                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525              $C$DW$47        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$47, DW_AT_name("FREE_SOFT")
     528                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_FREE_SOFT")
     529                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00)
     530                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     531                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   11

     532                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534                      .dwendtag $C$DW$T$26
     535              
     536              
     537              $C$DW$T$27      .dwtag  DW_TAG_union_type
     538                      .dwattr $C$DW$T$27, DW_AT_name("ECCTL1_REG")
     539                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     540              $C$DW$48        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$48, DW_AT_name("all")
     543                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_all")
     544                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$49        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$26)
     549                      .dwattr $C$DW$49, DW_AT_name("bit")
     550                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_bit")
     551                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554                      .dwendtag $C$DW$T$27
     555              
     556              
     557              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     558                      .dwattr $C$DW$T$28, DW_AT_name("ECCTL2_BITS")
     559                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     560              $C$DW$50        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     562                      .dwattr $C$DW$50, DW_AT_name("CONT_ONESHT")
     563                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_CONT_ONESHT")
     564                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0f)
     565                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     566                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     567                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     568              
     569              $C$DW$51        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     571                      .dwattr $C$DW$51, DW_AT_name("STOP_WRAP")
     572                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_STOP_WRAP")
     573                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0d)
     574                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
     575                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     577              
     578              $C$DW$52        .dwtag  DW_TAG_member
     579                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     580                      .dwattr $C$DW$52, DW_AT_name("REARM")
     581                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_REARM")
     582                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
     583                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     584                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     586              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   12

     587              $C$DW$53        .dwtag  DW_TAG_member
     588                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     589                      .dwattr $C$DW$53, DW_AT_name("TSCTRSTOP")
     590                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_TSCTRSTOP")
     591                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0b)
     592                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     593                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596              $C$DW$54        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     598                      .dwattr $C$DW$54, DW_AT_name("SYNCI_EN")
     599                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_SYNCI_EN")
     600                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0a)
     601                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     602                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     604              
     605              $C$DW$55        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$55, DW_AT_name("SYNCO_SEL")
     608                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SYNCO_SEL")
     609                      .dwattr $C$DW$55, DW_AT_bit_offset(0x08)
     610                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     611                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     613              
     614              $C$DW$56        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$56, DW_AT_name("SWSYNC")
     617                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SWSYNC")
     618                      .dwattr $C$DW$56, DW_AT_bit_offset(0x07)
     619                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     620                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     622              
     623              $C$DW$57        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$57, DW_AT_name("CAP_APWM")
     626                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_CAP_APWM")
     627                      .dwattr $C$DW$57, DW_AT_bit_offset(0x06)
     628                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     629                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632              $C$DW$58        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$58, DW_AT_name("APWMPOL")
     635                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_APWMPOL")
     636                      .dwattr $C$DW$58, DW_AT_bit_offset(0x05)
     637                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     638                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641              $C$DW$59        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   13

     642                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$59, DW_AT_name("rsvd1")
     644                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd1")
     645                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00)
     646                      .dwattr $C$DW$59, DW_AT_bit_size(0x05)
     647                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     649              
     650                      .dwendtag $C$DW$T$28
     651              
     652              
     653              $C$DW$T$29      .dwtag  DW_TAG_union_type
     654                      .dwattr $C$DW$T$29, DW_AT_name("ECCTL2_REG")
     655                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     656              $C$DW$60        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$60, DW_AT_name("all")
     659                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_all")
     660                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     661                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     662              
     663              $C$DW$61        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$28)
     665                      .dwattr $C$DW$61, DW_AT_name("bit")
     666                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_bit")
     667                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     668                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670                      .dwendtag $C$DW$T$29
     671              
     672              
     673              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     674                      .dwattr $C$DW$T$30, DW_AT_name("ECEINT_BITS")
     675                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     676              $C$DW$62        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$62, DW_AT_name("rsvd1")
     679                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd1")
     680                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0f)
     681                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685              $C$DW$63        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$63, DW_AT_name("CEVT1")
     688                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_CEVT1")
     689                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0e)
     690                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     691                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$64        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$64, DW_AT_name("CEVT2")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   14

     697                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CEVT2")
     698                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0d)
     699                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     700                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     701                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     702              
     703              $C$DW$65        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     705                      .dwattr $C$DW$65, DW_AT_name("CEVT3")
     706                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CEVT3")
     707                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0c)
     708                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     709                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712              $C$DW$66        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$66, DW_AT_name("CEVT4")
     715                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_CEVT4")
     716                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0b)
     717                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     718                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$67        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$67, DW_AT_name("CTROVF")
     724                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CTROVF")
     725                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0a)
     726                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     727                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$68        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$68, DW_AT_name("CTR_EQ_PRD")
     733                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
     734                      .dwattr $C$DW$68, DW_AT_bit_offset(0x09)
     735                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     736                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739              $C$DW$69        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$69, DW_AT_name("CTR_EQ_CMP")
     742                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
     743                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08)
     744                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     745                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748              $C$DW$70        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$70, DW_AT_name("rsvd2")
     751                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   15

     752                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00)
     753                      .dwattr $C$DW$70, DW_AT_bit_size(0x08)
     754                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     756              
     757                      .dwendtag $C$DW$T$30
     758              
     759              
     760              $C$DW$T$31      .dwtag  DW_TAG_union_type
     761                      .dwattr $C$DW$T$31, DW_AT_name("ECEINT_REG")
     762                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     763              $C$DW$71        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$71, DW_AT_name("all")
     766                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
     767                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     768                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     769              
     770              $C$DW$72        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$30)
     772                      .dwattr $C$DW$72, DW_AT_name("bit")
     773                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
     774                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     776              
     777                      .dwendtag $C$DW$T$31
     778              
     779              
     780              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     781                      .dwattr $C$DW$T$32, DW_AT_name("ECFLG_BITS")
     782                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     783              $C$DW$73        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$73, DW_AT_name("INT")
     786                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_INT")
     787                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f)
     788                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     789                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     791              
     792              $C$DW$74        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$74, DW_AT_name("CEVT1")
     795                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_CEVT1")
     796                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e)
     797                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     798                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801              $C$DW$75        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$75, DW_AT_name("CEVT2")
     804                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_CEVT2")
     805                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0d)
     806                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   16

     807                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$76        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$76, DW_AT_name("CEVT3")
     813                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CEVT3")
     814                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
     815                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     816                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819              $C$DW$77        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$77, DW_AT_name("CEVT4")
     822                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CEVT4")
     823                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0b)
     824                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
     825                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     826                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     827              
     828              $C$DW$78        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$78, DW_AT_name("CTROVF")
     831                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_CTROVF")
     832                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a)
     833                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     834                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$79        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$79, DW_AT_name("CTR_EQ_PRD")
     840                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
     841                      .dwattr $C$DW$79, DW_AT_bit_offset(0x09)
     842                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$80        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$80, DW_AT_name("CTR_EQ_CMP")
     849                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
     850                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08)
     851                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855              $C$DW$81        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
     858                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
     859                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
     860                      .dwattr $C$DW$81, DW_AT_bit_size(0x08)
     861                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   17

     862                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864                      .dwendtag $C$DW$T$32
     865              
     866              
     867              $C$DW$T$33      .dwtag  DW_TAG_union_type
     868                      .dwattr $C$DW$T$33, DW_AT_name("ECFLG_REG")
     869                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     870              $C$DW$82        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$82, DW_AT_name("all")
     873                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
     874                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     876              
     877              $C$DW$83        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$32)
     879                      .dwattr $C$DW$83, DW_AT_name("bit")
     880                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
     881                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884                      .dwendtag $C$DW$T$33
     885              
     886              
     887              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     888                      .dwattr $C$DW$T$34, DW_AT_name("EPWMCFG_BITS")
     889                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     890              $C$DW$84        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     892                      .dwattr $C$DW$84, DW_AT_name("CONFIG")
     893                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_CONFIG")
     894                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0f)
     895                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     896                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$85        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
     902                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
     903                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
     904                      .dwattr $C$DW$85, DW_AT_bit_size(0x0f)
     905                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     907              
     908                      .dwendtag $C$DW$T$34
     909              
     910              
     911              $C$DW$T$35      .dwtag  DW_TAG_union_type
     912                      .dwattr $C$DW$T$35, DW_AT_name("EPWMCFG_REG")
     913                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     914              $C$DW$86        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$86, DW_AT_name("all")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   18

     917                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
     918                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     920              
     921              $C$DW$87        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$34)
     923                      .dwattr $C$DW$87, DW_AT_name("bit")
     924                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
     925                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     927              
     928                      .dwendtag $C$DW$T$35
     929              
     930              
     931              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     932                      .dwattr $C$DW$T$36, DW_AT_name("INTOSC1TRIM_BITS")
     933                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     934              $C$DW$88        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$88, DW_AT_name("COARSETRIM")
     937                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_COARSETRIM")
     938                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08)
     939                      .dwattr $C$DW$88, DW_AT_bit_size(0x08)
     940                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     942              
     943              $C$DW$89        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
     946                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
     947                      .dwattr $C$DW$89, DW_AT_bit_offset(0x07)
     948                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     949                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     951              
     952              $C$DW$90        .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     954                      .dwattr $C$DW$90, DW_AT_name("FINETRIM")
     955                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_FINETRIM")
     956                      .dwattr $C$DW$90, DW_AT_bit_offset(0x01)
     957                      .dwattr $C$DW$90, DW_AT_bit_size(0x06)
     958                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     960              
     961              $C$DW$91        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$91, DW_AT_name("rsvd2")
     964                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd2")
     965                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00)
     966                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     967                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     969              
     970                      .dwendtag $C$DW$T$36
     971              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   19

     972              
     973              $C$DW$T$37      .dwtag  DW_TAG_union_type
     974                      .dwattr $C$DW$T$37, DW_AT_name("INTOSC1TRIM_REG")
     975                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     976              $C$DW$92        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$92, DW_AT_name("all")
     979                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_all")
     980                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$93        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$36)
     985                      .dwattr $C$DW$93, DW_AT_name("bit")
     986                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_bit")
     987                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990                      .dwendtag $C$DW$T$37
     991              
     992              
     993              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     994                      .dwattr $C$DW$T$38, DW_AT_name("INTOSC2TRIM_BITS")
     995                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     996              $C$DW$94        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$94, DW_AT_name("COARSETRIM")
     999                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_COARSETRIM")
    1000                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08)
    1001                      .dwattr $C$DW$94, DW_AT_bit_size(0x08)
    1002                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1004              
    1005              $C$DW$95        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1007                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
    1008                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
    1009                      .dwattr $C$DW$95, DW_AT_bit_offset(0x07)
    1010                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1011                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1013              
    1014              $C$DW$96        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$96, DW_AT_name("FINETRIM")
    1017                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_FINETRIM")
    1018                      .dwattr $C$DW$96, DW_AT_bit_offset(0x01)
    1019                      .dwattr $C$DW$96, DW_AT_bit_size(0x06)
    1020                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$97        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
    1026                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   20

    1027                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1028                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1029                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1031              
    1032                      .dwendtag $C$DW$T$38
    1033              
    1034              
    1035              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1036                      .dwattr $C$DW$T$39, DW_AT_name("INTOSC2TRIM_REG")
    1037                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1038              $C$DW$98        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$98, DW_AT_name("all")
    1041                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    1042                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045              $C$DW$99        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$38)
    1047                      .dwattr $C$DW$99, DW_AT_name("bit")
    1048                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    1049                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1051              
    1052                      .dwendtag $C$DW$T$39
    1053              
    1054              
    1055              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1056                      .dwattr $C$DW$T$40, DW_AT_name("JTAGDEBUG_BITS")
    1057                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1058              $C$DW$100       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$100, DW_AT_name("JTAGDIS")
    1061                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_JTAGDIS")
    1062                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f)
    1063                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1064                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1066              
    1067              $C$DW$101       .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1070                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    1071                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1072                      .dwattr $C$DW$101, DW_AT_bit_size(0x0f)
    1073                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1075              
    1076                      .dwendtag $C$DW$T$40
    1077              
    1078              
    1079              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1080                      .dwattr $C$DW$T$41, DW_AT_name("JTAGDEBUG_REG")
    1081                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   21

    1082              $C$DW$102       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$102, DW_AT_name("all")
    1085                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1086                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$103       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$40)
    1091                      .dwattr $C$DW$103, DW_AT_name("bit")
    1092                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1093                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096                      .dwendtag $C$DW$T$41
    1097              
    1098              
    1099              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1100                      .dwattr $C$DW$T$42, DW_AT_name("LOSPCP_BITS")
    1101                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1102              $C$DW$104       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$104, DW_AT_name("LSPCLK")
    1105                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_LSPCLK")
    1106                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0d)
    1107                      .dwattr $C$DW$104, DW_AT_bit_size(0x03)
    1108                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111              $C$DW$105       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    1114                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    1115                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1116                      .dwattr $C$DW$105, DW_AT_bit_size(0x0d)
    1117                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120                      .dwendtag $C$DW$T$42
    1121              
    1122              
    1123              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1124                      .dwattr $C$DW$T$43, DW_AT_name("LOSPCP_REG")
    1125                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1126              $C$DW$106       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$106, DW_AT_name("all")
    1129                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1130                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$107       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$42)
    1135                      .dwattr $C$DW$107, DW_AT_name("bit")
    1136                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   22

    1137                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1139              
    1140                      .dwendtag $C$DW$T$43
    1141              
    1142              
    1143              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1144                      .dwattr $C$DW$T$44, DW_AT_name("LPMCR0_BITS")
    1145                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1146              $C$DW$108       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$108, DW_AT_name("LPM")
    1149                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_LPM")
    1150                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e)
    1151                      .dwattr $C$DW$108, DW_AT_bit_size(0x02)
    1152                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$109       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$109, DW_AT_name("QUALSTDBY")
    1158                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_QUALSTDBY")
    1159                      .dwattr $C$DW$109, DW_AT_bit_offset(0x08)
    1160                      .dwattr $C$DW$109, DW_AT_bit_size(0x06)
    1161                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$110       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1167                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1168                      .dwattr $C$DW$110, DW_AT_bit_offset(0x01)
    1169                      .dwattr $C$DW$110, DW_AT_bit_size(0x07)
    1170                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$111       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$111, DW_AT_name("WDINTE")
    1176                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_WDINTE")
    1177                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1178                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182                      .dwendtag $C$DW$T$44
    1183              
    1184              
    1185              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1186                      .dwattr $C$DW$T$45, DW_AT_name("LPMCR0_REG")
    1187                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1188              $C$DW$112       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$112, DW_AT_name("all")
    1191                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   23

    1192                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1194              
    1195              $C$DW$113       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$44)
    1197                      .dwattr $C$DW$113, DW_AT_name("bit")
    1198                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1199                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202                      .dwendtag $C$DW$T$45
    1203              
    1204              
    1205              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1206                      .dwattr $C$DW$T$46, DW_AT_name("PCLKCR0_BITS")
    1207                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1208              $C$DW$114       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$114, DW_AT_name("HRPWMENCLK")
    1211                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_HRPWMENCLK")
    1212                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0f)
    1213                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$115       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$115, DW_AT_name("rsvd1")
    1220                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd1")
    1221                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
    1222                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1224                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$116       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$116, DW_AT_name("TBCLKSYNC")
    1229                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1230                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0d)
    1231                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1232                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$117       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$117, DW_AT_name("ADCENCLK")
    1238                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_ADCENCLK")
    1239                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    1240                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$118       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$118, DW_AT_name("I2CAENCLK")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   24

    1247                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_I2CAENCLK")
    1248                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0b)
    1249                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1250                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253              $C$DW$119       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$119, DW_AT_name("rsvd2")
    1256                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd2")
    1257                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0a)
    1258                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$120       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$120, DW_AT_name("rsvd3")
    1265                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd3")
    1266                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08)
    1267                      .dwattr $C$DW$120, DW_AT_bit_size(0x02)
    1268                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$121       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$121, DW_AT_name("SPIAENCLK")
    1274                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SPIAENCLK")
    1275                      .dwattr $C$DW$121, DW_AT_bit_offset(0x07)
    1276                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$122       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$122, DW_AT_name("SPIBENCLK")
    1283                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SPIBENCLK")
    1284                      .dwattr $C$DW$122, DW_AT_bit_offset(0x06)
    1285                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1286                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$123       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$123, DW_AT_name("SCIAENCLK")
    1292                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_SCIAENCLK")
    1293                      .dwattr $C$DW$123, DW_AT_bit_offset(0x05)
    1294                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1295                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$124       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$124, DW_AT_name("SCIBENCLK")
    1301                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SCIBENCLK")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   25

    1302                      .dwattr $C$DW$124, DW_AT_bit_offset(0x04)
    1303                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1306              
    1307              $C$DW$125       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1309                      .dwattr $C$DW$125, DW_AT_name("MCBSPAENCLK")
    1310                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_MCBSPAENCLK")
    1311                      .dwattr $C$DW$125, DW_AT_bit_offset(0x03)
    1312                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1313                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1315              
    1316              $C$DW$126       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1318                      .dwattr $C$DW$126, DW_AT_name("rsvd4")
    1319                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd4")
    1320                      .dwattr $C$DW$126, DW_AT_bit_offset(0x02)
    1321                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1322                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1324              
    1325              $C$DW$127       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1327                      .dwattr $C$DW$127, DW_AT_name("ECANAENCLK")
    1328                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ECANAENCLK")
    1329                      .dwattr $C$DW$127, DW_AT_bit_offset(0x01)
    1330                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1331                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1333              
    1334              $C$DW$128       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$128, DW_AT_name("rsvd5")
    1337                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd5")
    1338                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1339                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1340                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343                      .dwendtag $C$DW$T$46
    1344              
    1345              
    1346              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1347                      .dwattr $C$DW$T$47, DW_AT_name("PCLKCR0_REG")
    1348                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1349              $C$DW$129       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$129, DW_AT_name("all")
    1352                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1353                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$130       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   26

    1357                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$46)
    1358                      .dwattr $C$DW$130, DW_AT_name("bit")
    1359                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1360                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1361                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363                      .dwendtag $C$DW$T$47
    1364              
    1365              
    1366              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1367                      .dwattr $C$DW$T$48, DW_AT_name("PCLKCR1_BITS")
    1368                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1369              $C$DW$131       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$131, DW_AT_name("EPWM1ENCLK")
    1372                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_EPWM1ENCLK")
    1373                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    1374                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1375                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1377              
    1378              $C$DW$132       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$132, DW_AT_name("EPWM2ENCLK")
    1381                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_EPWM2ENCLK")
    1382                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1383                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1384                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1386              
    1387              $C$DW$133       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1389                      .dwattr $C$DW$133, DW_AT_name("EPWM3ENCLK")
    1390                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_EPWM3ENCLK")
    1391                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    1392                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1393                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1395              
    1396              $C$DW$134       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$134, DW_AT_name("EPWM4ENCLK")
    1399                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_EPWM4ENCLK")
    1400                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1401                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1402                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1404              
    1405              $C$DW$135       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1407                      .dwattr $C$DW$135, DW_AT_name("EPWM5ENCLK")
    1408                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_EPWM5ENCLK")
    1409                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0b)
    1410                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1411                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   27

    1412                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414              $C$DW$136       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$136, DW_AT_name("EPWM6ENCLK")
    1417                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_EPWM6ENCLK")
    1418                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a)
    1419                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1420                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$137       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$137, DW_AT_name("EPWM7ENCLK")
    1426                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_EPWM7ENCLK")
    1427                      .dwattr $C$DW$137, DW_AT_bit_offset(0x09)
    1428                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1429                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$138       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$138, DW_AT_name("EPWM8ENCLK")
    1435                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_EPWM8ENCLK")
    1436                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    1437                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1438                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$139       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$139, DW_AT_name("ECAP1ENCLK")
    1444                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ECAP1ENCLK")
    1445                      .dwattr $C$DW$139, DW_AT_bit_offset(0x07)
    1446                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1447                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450              $C$DW$140       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1452                      .dwattr $C$DW$140, DW_AT_name("ECAP2ENCLK")
    1453                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ECAP2ENCLK")
    1454                      .dwattr $C$DW$140, DW_AT_bit_offset(0x06)
    1455                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1456                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1458              
    1459              $C$DW$141       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1461                      .dwattr $C$DW$141, DW_AT_name("ECAP3ENCLK")
    1462                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ECAP3ENCLK")
    1463                      .dwattr $C$DW$141, DW_AT_bit_offset(0x05)
    1464                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1465                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 20:58:34 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initECAP1.asm                                                        PAGE   28

    1467              
    1468              $C$DW$142       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1471                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1472                      .dwattr $C$DW$142, DW_AT_bit_offset(0x02)
    1473                      .dwattr $C$DW$142, DW_AT_bit_size(0x03)
    1474                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1476              
    1477              $C$DW$143       .dwtag  DW_TAG_member
