TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 23:31:12 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initInterrupt.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("setOutputs")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_setOutputs")

     639                      .dwpsn  file "../source/initInterrupt.c",line 163,column 1,is_stmt,address _cpu_timer1_isr,isa 0
     640              
     641                      .dwfde $C$DW$CIE, _cpu_timer1_isr
     642              
     643              ;***************************************************************
     644              ;* FNAME: _cpu_timer1_isr               FR SIZE:   4           *
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   14

     645              ;*                                                             *
     646              ;* FUNCTION ENVIRONMENT                                        *
     647              ;*                                                             *
     648              ;* FUNCTION PROPERTIES                                         *
     649              ;*                            0 Parameter,  0 Auto,  4 SOE     *
     650              ;***************************************************************
     651              
     652 000000ca       _cpu_timer1_isr:
     653                      .dwcfi  cfa_offset, -2
     654                      .dwcfi  save_reg_to_mem, 26, 0
     655 000000ca 761B          ASP       ; [CPU_] 
     656 000000cb FFF0          PUSH      RB                    ; [CPU_] 
     657                      .dwcfi  save_reg_to_mem, 73, 2
     658                      .dwcfi  save_reg_to_mem, 74, 3
     659                      .dwcfi  cfa_offset, -4
     660 000000cc E200          MOV32     *SP++,STF             ; [CPU_] 
         000000cd 00BD 
     661                      .dwcfi  save_reg_to_mem, 39, 4
     662                      .dwcfi  save_reg_to_mem, 40, 5
     663                      .dwcfi  cfa_offset, -6
     664 000000ce E630          SETFLG    RNDF32=1, RNDF64=1    ; [CPU_] 
         000000cf 0600 
     665 000000d0 2942          CLRC      PAGE0,OVM             ; [CPU_] 
     666 000000d1 5616          CLRC      AMODE                 ; [CPU_] 
     667 000000d2 761F!         MOVW      DP,#_GpioDataRegs+6   ; [CPU_U] 
         000000d3 0000 
     668                      .dwpsn  file "../source/initInterrupt.c",line 164,column 5,is_stmt,isa 0
     669 000000d4 1A06!         OR        @_GpioDataRegs+6,#0x0010 ; [CPU_] |164| 
         000000d5 0010 
     670 000000d6 761F!         MOVW      DP,#_CpuTimer1Regs+4  ; [CPU_U] 
         000000d7 0000 
     671                      .dwpsn  file "../source/initInterrupt.c",line 165,column 5,is_stmt,isa 0
     672 000000d8 1A04!         OR        @_CpuTimer1Regs+4,#0x8000 ; [CPU_] |165| 
         000000d9 8000 
     673 000000da E280          MOV32     STF,*--SP             ; [CPU_] 
         000000db 00BE 
     674                      .dwcfi  cfa_offset, -4
     675                      .dwcfi  restore_reg, 39
     676                      .dwcfi  restore_reg, 40
     677 000000dc FFF1          POP       RB                    ; [CPU_] 
     678                      .dwcfi  cfa_offset, -2
     679                      .dwcfi  restore_reg, 73
     680                      .dwcfi  restore_reg, 74
     681 000000dd 7617          NASP      ; [CPU_] 
     682              $C$DW$25        .dwtag  DW_TAG_TI_branch
     683                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     684                      .dwattr $C$DW$25, DW_AT_TI_return
     685              
     686 000000de 7602          IRET      ; [CPU_] 
     687                      ; return occurs ; [] 
     688                      .dwattr $C$DW$24, DW_AT_TI_end_file("../source/initInterrupt.c")
     689                      .dwattr $C$DW$24, DW_AT_TI_end_line(0xa7)
     690                      .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     691                      .dwendentry
     692                      .dwendtag $C$DW$24
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   15

     693              
     694              ;**************************************************************
     695              ;* UNDEFINED EXTERNAL REFERENCES                              *
     696              ;**************************************************************
     697                      .global _setOutputs
     698                      .global _InitPieVectTable
     699                      .global _sendNextPulse
     700                      .global _pushbutton_threshold
     701                      .global _CurrentState
     702                      .global _pushbutton_long_press_time
     703                      .global _CpuTimer1Regs
     704                      .global _XIntruptRegs
     705                      .global _PieCtrlRegs
     706                      .global _GpioDataRegs
     707                      .global _ECap1Regs
     708                      .global _PieVectTable
     709              
     710              ;***************************************************************
     711              ;* TYPE INFORMATION                                            *
     712              ;***************************************************************
     713              
     714              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     715                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     716                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     717              $C$DW$26        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     719                      .dwattr $C$DW$26, DW_AT_name("rsvd1")
     720                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd1")
     721                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0f)
     722                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     723                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     725              
     726              $C$DW$27        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$27, DW_AT_name("rsvd2")
     729                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd2")
     730                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0e)
     731                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     732                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735              $C$DW$28        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$28, DW_AT_name("AIO2")
     738                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_AIO2")
     739                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0d)
     740                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     741                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     743              
     744              $C$DW$29        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$29, DW_AT_name("rsvd3")
     747                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd3")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   16

     748                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     749                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     750                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     752              
     753              $C$DW$30        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     755                      .dwattr $C$DW$30, DW_AT_name("AIO4")
     756                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_AIO4")
     757                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b)
     758                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     759                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     761              
     762              $C$DW$31        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     764                      .dwattr $C$DW$31, DW_AT_name("rsvd4")
     765                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd4")
     766                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a)
     767                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     768                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     770              
     771              $C$DW$32        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$32, DW_AT_name("AIO6")
     774                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_AIO6")
     775                      .dwattr $C$DW$32, DW_AT_bit_offset(0x09)
     776                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     777                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$33        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$33, DW_AT_name("rsvd5")
     783                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd5")
     784                      .dwattr $C$DW$33, DW_AT_bit_offset(0x08)
     785                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     786                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     788              
     789              $C$DW$34        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$34, DW_AT_name("rsvd6")
     792                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd6")
     793                      .dwattr $C$DW$34, DW_AT_bit_offset(0x07)
     794                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     795                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     796                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     797              
     798              $C$DW$35        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$35, DW_AT_name("rsvd7")
     801                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd7")
     802                      .dwattr $C$DW$35, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   17

     803                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     804                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     806              
     807              $C$DW$36        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$36, DW_AT_name("AIO10")
     810                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_AIO10")
     811                      .dwattr $C$DW$36, DW_AT_bit_offset(0x05)
     812                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     813                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     815              
     816              $C$DW$37        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$37, DW_AT_name("rsvd8")
     819                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd8")
     820                      .dwattr $C$DW$37, DW_AT_bit_offset(0x04)
     821                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$38        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$38, DW_AT_name("AIO12")
     828                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_AIO12")
     829                      .dwattr $C$DW$38, DW_AT_bit_offset(0x03)
     830                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     831                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     833              
     834              $C$DW$39        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     836                      .dwattr $C$DW$39, DW_AT_name("rsvd9")
     837                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd9")
     838                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     839                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     840                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     842              
     843              $C$DW$40        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$40, DW_AT_name("AIO14")
     846                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_AIO14")
     847                      .dwattr $C$DW$40, DW_AT_bit_offset(0x01)
     848                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     849                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852              $C$DW$41        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$41, DW_AT_name("rsvd10")
     855                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd10")
     856                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     857                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   18

     858                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     860              
     861              $C$DW$42        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$42, DW_AT_name("rsvd11")
     864                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd11")
     865                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
     866                      .dwattr $C$DW$42, DW_AT_bit_size(0x10)
     867                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     868                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     869              
     870                      .dwendtag $C$DW$T$20
     871              
     872              
     873              $C$DW$T$22      .dwtag  DW_TAG_union_type
     874                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     875                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     876              $C$DW$43        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$21)
     878                      .dwattr $C$DW$43, DW_AT_name("all")
     879                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     880                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     882              
     883              $C$DW$44        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
     885                      .dwattr $C$DW$44, DW_AT_name("bit")
     886                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     887                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     889              
     890                      .dwendtag $C$DW$T$22
     891              
     892              
     893              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     894                      .dwattr $C$DW$T$23, DW_AT_name("CPUTIMER_REGS")
     895                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     896              $C$DW$45        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$60)
     898                      .dwattr $C$DW$45, DW_AT_name("TIM")
     899                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_TIM")
     900                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     902              
     903              $C$DW$46        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$53)
     905                      .dwattr $C$DW$46, DW_AT_name("PRD")
     906                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PRD")
     907                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     908                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910              $C$DW$47        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$59)
     912                      .dwattr $C$DW$47, DW_AT_name("TCR")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   19

     913                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_TCR")
     914                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     915                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     916              
     917              $C$DW$48        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$48, DW_AT_name("rsvd1")
     920                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd1")
     921                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     922                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     923              
     924              $C$DW$49        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$65)
     926                      .dwattr $C$DW$49, DW_AT_name("TPR")
     927                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_TPR")
     928                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     929                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     930              
     931              $C$DW$50        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$63)
     933                      .dwattr $C$DW$50, DW_AT_name("TPRH")
     934                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_TPRH")
     935                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     936                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     937              
     938                      .dwendtag $C$DW$T$23
     939              
     940              $C$DW$51        .dwtag  DW_TAG_TI_far_type
     941                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$23)
     942              
     943              $C$DW$T$70      .dwtag  DW_TAG_volatile_type
     944                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$51)
     945              
     946              
     947              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     948                      .dwattr $C$DW$T$26, DW_AT_name("ECAP_REGS")
     949                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
     950              $C$DW$52        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     952                      .dwattr $C$DW$52, DW_AT_name("TSCTR")
     953                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_TSCTR")
     954                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$53        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     959                      .dwattr $C$DW$53, DW_AT_name("CTRPHS")
     960                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_CTRPHS")
     961                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     962                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964              $C$DW$54        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     966                      .dwattr $C$DW$54, DW_AT_name("CAP1")
     967                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_CAP1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   20

     968                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     969                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971              $C$DW$55        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     973                      .dwattr $C$DW$55, DW_AT_name("CAP2")
     974                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_CAP2")
     975                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     976                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     977              
     978              $C$DW$56        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     980                      .dwattr $C$DW$56, DW_AT_name("CAP3")
     981                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_CAP3")
     982                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     983                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     984              
     985              $C$DW$57        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     987                      .dwattr $C$DW$57, DW_AT_name("CAP4")
     988                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_CAP4")
     989                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     990                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$58        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$24)
     994                      .dwattr $C$DW$58, DW_AT_name("rsvd1")
     995                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd1")
     996                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     997                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     998              
     999              $C$DW$59        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$28)
    1001                      .dwattr $C$DW$59, DW_AT_name("ECCTL1")
    1002                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_ECCTL1")
    1003                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1004                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1005              
    1006              $C$DW$60        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$30)
    1008                      .dwattr $C$DW$60, DW_AT_name("ECCTL2")
    1009                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_ECCTL2")
    1010                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1011                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013              $C$DW$61        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$32)
    1015                      .dwattr $C$DW$61, DW_AT_name("ECEINT")
    1016                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_ECEINT")
    1017                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1018                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1019              
    1020              $C$DW$62        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$34)
    1022                      .dwattr $C$DW$62, DW_AT_name("ECFLG")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   21

    1023                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_ECFLG")
    1024                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1025                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1026              
    1027              $C$DW$63        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$34)
    1029                      .dwattr $C$DW$63, DW_AT_name("ECCLR")
    1030                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_ECCLR")
    1031                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1032                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1033              
    1034              $C$DW$64        .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$32)
    1036                      .dwattr $C$DW$64, DW_AT_name("ECFRC")
    1037                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_ECFRC")
    1038                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1039                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1040              
    1041              $C$DW$65        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
    1043                      .dwattr $C$DW$65, DW_AT_name("rsvd2")
    1044                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd2")
    1045                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1046                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048                      .dwendtag $C$DW$T$26
    1049              
    1050              $C$DW$66        .dwtag  DW_TAG_TI_far_type
    1051                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$26)
    1052              
    1053              $C$DW$T$72      .dwtag  DW_TAG_volatile_type
    1054                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$66)
    1055              
    1056              
    1057              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1058                      .dwattr $C$DW$T$27, DW_AT_name("ECCTL1_BITS")
    1059                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1060              $C$DW$67        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$67, DW_AT_name("CAP1POL")
    1063                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CAP1POL")
    1064                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0f)
    1065                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1066                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$68        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$68, DW_AT_name("CTRRST1")
    1072                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CTRRST1")
    1073                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e)
    1074                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1077              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   22

    1078              $C$DW$69        .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$69, DW_AT_name("CAP2POL")
    1081                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CAP2POL")
    1082                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0d)
    1083                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$70        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$70, DW_AT_name("CTRRST2")
    1090                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CTRRST2")
    1091                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c)
    1092                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1093                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096              $C$DW$71        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$71, DW_AT_name("CAP3POL")
    1099                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CAP3POL")
    1100                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0b)
    1101                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1102                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1104              
    1105              $C$DW$72        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$72, DW_AT_name("CTRRST3")
    1108                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CTRRST3")
    1109                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a)
    1110                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1111                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114              $C$DW$73        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$73, DW_AT_name("CAP4POL")
    1117                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CAP4POL")
    1118                      .dwattr $C$DW$73, DW_AT_bit_offset(0x09)
    1119                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1120                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$74        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$74, DW_AT_name("CTRRST4")
    1126                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_CTRRST4")
    1127                      .dwattr $C$DW$74, DW_AT_bit_offset(0x08)
    1128                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
    1129                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1131              
    1132              $C$DW$75        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   23

    1133                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1134                      .dwattr $C$DW$75, DW_AT_name("CAPLDEN")
    1135                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_CAPLDEN")
    1136                      .dwattr $C$DW$75, DW_AT_bit_offset(0x07)
    1137                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1138                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141              $C$DW$76        .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$76, DW_AT_name("PRESCALE")
    1144                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PRESCALE")
    1145                      .dwattr $C$DW$76, DW_AT_bit_offset(0x02)
    1146                      .dwattr $C$DW$76, DW_AT_bit_size(0x05)
    1147                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1149              
    1150              $C$DW$77        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$77, DW_AT_name("FREE_SOFT")
    1153                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_FREE_SOFT")
    1154                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1155                      .dwattr $C$DW$77, DW_AT_bit_size(0x02)
    1156                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159                      .dwendtag $C$DW$T$27
    1160              
    1161              
    1162              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1163                      .dwattr $C$DW$T$28, DW_AT_name("ECCTL1_REG")
    1164                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1165              $C$DW$78        .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$78, DW_AT_name("all")
    1168                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_all")
    1169                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$79        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$27)
    1174                      .dwattr $C$DW$79, DW_AT_name("bit")
    1175                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_bit")
    1176                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179                      .dwendtag $C$DW$T$28
    1180              
    1181              
    1182              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1183                      .dwattr $C$DW$T$29, DW_AT_name("ECCTL2_BITS")
    1184                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1185              $C$DW$80        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$80, DW_AT_name("CONT_ONESHT")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   24

    1188                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_CONT_ONESHT")
    1189                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0f)
    1190                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1191                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194              $C$DW$81        .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$81, DW_AT_name("STOP_WRAP")
    1197                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_STOP_WRAP")
    1198                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d)
    1199                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
    1200                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1202              
    1203              $C$DW$82        .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$82, DW_AT_name("REARM")
    1206                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_REARM")
    1207                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c)
    1208                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1209                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1211              
    1212              $C$DW$83        .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$83, DW_AT_name("TSCTRSTOP")
    1215                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_TSCTRSTOP")
    1216                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b)
    1217                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1218                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$84        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$84, DW_AT_name("SYNCI_EN")
    1224                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SYNCI_EN")
    1225                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a)
    1226                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1229              
    1230              $C$DW$85        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$85, DW_AT_name("SYNCO_SEL")
    1233                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_SYNCO_SEL")
    1234                      .dwattr $C$DW$85, DW_AT_bit_offset(0x08)
    1235                      .dwattr $C$DW$85, DW_AT_bit_size(0x02)
    1236                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$86        .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$86, DW_AT_name("SWSYNC")
    1242                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SWSYNC")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   25

    1243                      .dwattr $C$DW$86, DW_AT_bit_offset(0x07)
    1244                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$87        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$87, DW_AT_name("CAP_APWM")
    1251                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CAP_APWM")
    1252                      .dwattr $C$DW$87, DW_AT_bit_offset(0x06)
    1253                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$88        .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$88, DW_AT_name("APWMPOL")
    1260                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_APWMPOL")
    1261                      .dwattr $C$DW$88, DW_AT_bit_offset(0x05)
    1262                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$89        .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
    1269                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
    1270                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1271                      .dwattr $C$DW$89, DW_AT_bit_size(0x05)
    1272                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275                      .dwendtag $C$DW$T$29
    1276              
    1277              
    1278              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1279                      .dwattr $C$DW$T$30, DW_AT_name("ECCTL2_REG")
    1280                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1281              $C$DW$90        .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$90, DW_AT_name("all")
    1284                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    1285                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$91        .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$29)
    1290                      .dwattr $C$DW$91, DW_AT_name("bit")
    1291                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    1292                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1294              
    1295                      .dwendtag $C$DW$T$30
    1296              
    1297              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   26

    1298              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1299                      .dwattr $C$DW$T$31, DW_AT_name("ECEINT_BITS")
    1300                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1301              $C$DW$92        .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    1304                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    1305                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0f)
    1306                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1307                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310              $C$DW$93        .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1312                      .dwattr $C$DW$93, DW_AT_name("CEVT1")
    1313                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CEVT1")
    1314                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e)
    1315                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1316                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1318              
    1319              $C$DW$94        .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$94, DW_AT_name("CEVT2")
    1322                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CEVT2")
    1323                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d)
    1324                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1325                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328              $C$DW$95        .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$95, DW_AT_name("CEVT3")
    1331                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CEVT3")
    1332                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0c)
    1333                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1334                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1336              
    1337              $C$DW$96        .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1339                      .dwattr $C$DW$96, DW_AT_name("CEVT4")
    1340                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CEVT4")
    1341                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0b)
    1342                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1343                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$97        .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1348                      .dwattr $C$DW$97, DW_AT_name("CTROVF")
    1349                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_CTROVF")
    1350                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a)
    1351                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1352                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   27

    1353                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1354              
    1355              $C$DW$98        .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$98, DW_AT_name("CTR_EQ_PRD")
    1358                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
    1359                      .dwattr $C$DW$98, DW_AT_bit_offset(0x09)
    1360                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1361                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$99        .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$99, DW_AT_name("CTR_EQ_CMP")
    1367                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
    1368                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1369                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1370                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1372              
    1373              $C$DW$100       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1375                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1376                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1377                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1378                      .dwattr $C$DW$100, DW_AT_bit_size(0x08)
    1379                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382                      .dwendtag $C$DW$T$31
    1383              
    1384              
    1385              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1386                      .dwattr $C$DW$T$32, DW_AT_name("ECEINT_REG")
    1387                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1388              $C$DW$101       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$101, DW_AT_name("all")
    1391                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1392                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$102       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$31)
    1397                      .dwattr $C$DW$102, DW_AT_name("bit")
    1398                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1399                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402                      .dwendtag $C$DW$T$32
    1403              
    1404              
    1405              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1406                      .dwattr $C$DW$T$33, DW_AT_name("ECFLG_BITS")
    1407                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   28

    1408              $C$DW$103       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1410                      .dwattr $C$DW$103, DW_AT_name("INT")
    1411                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INT")
    1412                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
    1413                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1414                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1416              
    1417              $C$DW$104       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$104, DW_AT_name("CEVT1")
    1420                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CEVT1")
    1421                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1422                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1423                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$105       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1428                      .dwattr $C$DW$105, DW_AT_name("CEVT2")
    1429                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CEVT2")
    1430                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    1431                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1432                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1434              
    1435              $C$DW$106       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$106, DW_AT_name("CEVT3")
    1438                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CEVT3")
    1439                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    1440                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1441                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$107       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$107, DW_AT_name("CEVT4")
    1447                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CEVT4")
    1448                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b)
    1449                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1450                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453              $C$DW$108       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1455                      .dwattr $C$DW$108, DW_AT_name("CTROVF")
    1456                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CTROVF")
    1457                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    1458                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1459                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   29

    1463                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1464                      .dwattr $C$DW$109, DW_AT_name("CTR_EQ_PRD")
    1465                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
    1466                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09)
    1467                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1468                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$110       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1473                      .dwattr $C$DW$110, DW_AT_name("CTR_EQ_CMP")
    1474                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
    1475                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    1476                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1477                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1479              
    1480              $C$DW$111       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1483                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1484                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1485                      .dwattr $C$DW$111, DW_AT_bit_size(0x08)
    1486                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489                      .dwendtag $C$DW$T$33
    1490              
    1491              
    1492              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1493                      .dwattr $C$DW$T$34, DW_AT_name("ECFLG_REG")
    1494                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1495              $C$DW$112       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1497                      .dwattr $C$DW$112, DW_AT_name("all")
    1498                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1499                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$113       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$33)
    1504                      .dwattr $C$DW$113, DW_AT_name("bit")
    1505                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1506                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1508              
    1509                      .dwendtag $C$DW$T$34
    1510              
    1511              
    1512              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1513                      .dwattr $C$DW$T$35, DW_AT_name("GPADAT_BITS")
    1514                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1515              $C$DW$114       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$114, DW_AT_name("GPIO0")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   30

    1518                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO0")
    1519                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0f)
    1520                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1521                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$115       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$115, DW_AT_name("GPIO1")
    1527                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO1")
    1528                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e)
    1529                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$116       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$116, DW_AT_name("GPIO2")
    1536                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO2")
    1537                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0d)
    1538                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1539                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$117       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$117, DW_AT_name("GPIO3")
    1545                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO3")
    1546                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    1547                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1550              
    1551              $C$DW$118       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1553                      .dwattr $C$DW$118, DW_AT_name("GPIO4")
    1554                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO4")
    1555                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0b)
    1556                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1559              
    1560              $C$DW$119       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$119, DW_AT_name("GPIO5")
    1563                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO5")
    1564                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0a)
    1565                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1566                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$120       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$120, DW_AT_name("GPIO6")
    1572                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO6")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   31

    1573                      .dwattr $C$DW$120, DW_AT_bit_offset(0x09)
    1574                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1575                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1577              
    1578              $C$DW$121       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$121, DW_AT_name("GPIO7")
    1581                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO7")
    1582                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08)
    1583                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1584                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1585                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$122       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$122, DW_AT_name("GPIO8")
    1590                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO8")
    1591                      .dwattr $C$DW$122, DW_AT_bit_offset(0x07)
    1592                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1593                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1595              
    1596              $C$DW$123       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1598                      .dwattr $C$DW$123, DW_AT_name("GPIO9")
    1599                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO9")
    1600                      .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    1601                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1602                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1604              
    1605              $C$DW$124       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$124, DW_AT_name("GPIO10")
    1608                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO10")
    1609                      .dwattr $C$DW$124, DW_AT_bit_offset(0x05)
    1610                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1611                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$125       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$125, DW_AT_name("GPIO11")
    1617                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO11")
    1618                      .dwattr $C$DW$125, DW_AT_bit_offset(0x04)
    1619                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623              $C$DW$126       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$126, DW_AT_name("GPIO12")
    1626                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO12")
    1627                      .dwattr $C$DW$126, DW_AT_bit_offset(0x03)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   32

    1628                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1629                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$127       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$127, DW_AT_name("GPIO13")
    1635                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO13")
    1636                      .dwattr $C$DW$127, DW_AT_bit_offset(0x02)
    1637                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1638                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1640              
    1641              $C$DW$128       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$128, DW_AT_name("GPIO14")
    1644                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO14")
    1645                      .dwattr $C$DW$128, DW_AT_bit_offset(0x01)
    1646                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1647                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$129       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$129, DW_AT_name("GPIO15")
    1653                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO15")
    1654                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    1655                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1656                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$130       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$130, DW_AT_name("GPIO16")
    1662                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO16")
    1663                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f)
    1664                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1665                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1666                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1667              
    1668              $C$DW$131       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$131, DW_AT_name("GPIO17")
    1671                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO17")
    1672                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    1673                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1674                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1675                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$132       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$132, DW_AT_name("GPIO18")
    1680                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO18")
    1681                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d)
    1682                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   33

    1683                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1684                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$133       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$133, DW_AT_name("GPIO19")
    1689                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO19")
    1690                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c)
    1691                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1692                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1693                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$134       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1697                      .dwattr $C$DW$134, DW_AT_name("GPIO20")
    1698                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO20")
    1699                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0b)
    1700                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1702                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$135       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$135, DW_AT_name("GPIO21")
    1707                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO21")
    1708                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0a)
    1709                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1710                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1711                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713              $C$DW$136       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$136, DW_AT_name("GPIO22")
    1716                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO22")
    1717                      .dwattr $C$DW$136, DW_AT_bit_offset(0x09)
    1718                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1719                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1720                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1721              
    1722              $C$DW$137       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$137, DW_AT_name("GPIO23")
    1725                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO23")
    1726                      .dwattr $C$DW$137, DW_AT_bit_offset(0x08)
    1727                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1728                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1729                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$138       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$138, DW_AT_name("GPIO24")
    1734                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO24")
    1735                      .dwattr $C$DW$138, DW_AT_bit_offset(0x07)
    1736                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1737                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   34

    1738                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740              $C$DW$139       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$139, DW_AT_name("GPIO25")
    1743                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO25")
    1744                      .dwattr $C$DW$139, DW_AT_bit_offset(0x06)
    1745                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1746                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1747                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1748              
    1749              $C$DW$140       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$140, DW_AT_name("GPIO26")
    1752                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO26")
    1753                      .dwattr $C$DW$140, DW_AT_bit_offset(0x05)
    1754                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1755                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1756                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1757              
    1758              $C$DW$141       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$141, DW_AT_name("GPIO27")
    1761                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO27")
    1762                      .dwattr $C$DW$141, DW_AT_bit_offset(0x04)
    1763                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1764                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1765                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767              $C$DW$142       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1769                      .dwattr $C$DW$142, DW_AT_name("GPIO28")
    1770                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO28")
    1771                      .dwattr $C$DW$142, DW_AT_bit_offset(0x03)
    1772                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1773                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1774                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1775              
    1776              $C$DW$143       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1778                      .dwattr $C$DW$143, DW_AT_name("GPIO29")
    1779                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO29")
    1780                      .dwattr $C$DW$143, DW_AT_bit_offset(0x02)
    1781                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1782                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1783                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1784              
    1785              $C$DW$144       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1787                      .dwattr $C$DW$144, DW_AT_name("GPIO30")
    1788                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO30")
    1789                      .dwattr $C$DW$144, DW_AT_bit_offset(0x01)
    1790                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1791                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1792                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   35

    1793              
    1794              $C$DW$145       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$145, DW_AT_name("GPIO31")
    1797                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO31")
    1798                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    1799                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1800                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1801                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1802              
    1803                      .dwendtag $C$DW$T$35
    1804              
    1805              
    1806              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1807                      .dwattr $C$DW$T$36, DW_AT_name("GPADAT_REG")
    1808                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1809              $C$DW$146       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    1811                      .dwattr $C$DW$146, DW_AT_name("all")
    1812                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    1813                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$147       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$35)
    1818                      .dwattr $C$DW$147, DW_AT_name("bit")
    1819                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    1820                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823                      .dwendtag $C$DW$T$36
    1824              
    1825              
    1826              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1827                      .dwattr $C$DW$T$37, DW_AT_name("GPBDAT_BITS")
    1828                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1829              $C$DW$148       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$148, DW_AT_name("GPIO32")
    1832                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO32")
    1833                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    1834                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1837              
    1838              $C$DW$149       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$149, DW_AT_name("GPIO33")
    1841                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO33")
    1842                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    1843                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1844                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1845                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1846              
    1847              $C$DW$150       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   36

    1848                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$150, DW_AT_name("GPIO34")
    1850                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO34")
    1851                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    1852                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1853                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1855              
    1856              $C$DW$151       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$151, DW_AT_name("GPIO35")
    1859                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO35")
    1860                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    1861                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$152       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$152, DW_AT_name("GPIO36")
    1868                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO36")
    1869                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    1870                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1871                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874              $C$DW$153       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$153, DW_AT_name("GPIO37")
    1877                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO37")
    1878                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    1879                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1880                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1882              
    1883              $C$DW$154       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1885                      .dwattr $C$DW$154, DW_AT_name("GPIO38")
    1886                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO38")
    1887                      .dwattr $C$DW$154, DW_AT_bit_offset(0x09)
    1888                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1889                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892              $C$DW$155       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$155, DW_AT_name("GPIO39")
    1895                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO39")
    1896                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08)
    1897                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1898                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1900              
    1901              $C$DW$156       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   37

    1903                      .dwattr $C$DW$156, DW_AT_name("GPIO40")
    1904                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO40")
    1905                      .dwattr $C$DW$156, DW_AT_bit_offset(0x07)
    1906                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1907                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1909              
    1910              $C$DW$157       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$157, DW_AT_name("GPIO41")
    1913                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO41")
    1914                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06)
    1915                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1916                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1918              
    1919              $C$DW$158       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$158, DW_AT_name("GPIO42")
    1922                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO42")
    1923                      .dwattr $C$DW$158, DW_AT_bit_offset(0x05)
    1924                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1926                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$159       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$159, DW_AT_name("GPIO43")
    1931                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO43")
    1932                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    1933                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1934                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$160       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$160, DW_AT_name("GPIO44")
    1940                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO44")
    1941                      .dwattr $C$DW$160, DW_AT_bit_offset(0x03)
    1942                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1943                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946              $C$DW$161       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$161, DW_AT_name("rsvd1")
    1949                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd1")
    1950                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    1951                      .dwattr $C$DW$161, DW_AT_bit_size(0x03)
    1952                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1954              
    1955              $C$DW$162       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1957                      .dwattr $C$DW$162, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:31:12 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   38

    1958                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd2")
    1959                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e)
    1960                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    1961                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1962                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1963              
    1964              $C$DW$163       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$163, DW_AT_name("GPIO50")
    1967                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO50")
    1968                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d)
    1969                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1970                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1971                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1972              
    1973              $C$DW$164       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1975                      .dwattr $C$DW$164, DW_AT_name("GPIO51")
    1976                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO51")
    1977                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c)
    1978                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1979                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1980                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1981              
    1982              $C$DW$165       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1984                      .dwattr $C$DW$165, DW_AT_name("GPIO52")
    1985                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO52")
    1986                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b)
    1987                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1989                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1990              
    1991              $C$DW$166       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1993                      .dwattr $C$DW$166, DW_AT_name("GPIO53")
    1994                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO53")
    1995                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0a)
    1996                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    1997                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1998                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1999              
    2000              $C$DW$167       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
