TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 11:56:06 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initExtInt.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("XIntruptRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_XIntruptRegs")

      27              ;       C:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\opt2000.exe C:\\Users\\MESSME~1\\AppData\\Loca
      28              ;       C:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\ac2000.exe -@C:\\Users\\MESSME~1\\AppData\\Loc
      29 00000000               .sect   ".text"
      30                      .clink
      31                      .global _initExtInt
      32              
      33              $C$DW$3 .dwtag  DW_TAG_subprogram
      34                      .dwattr $C$DW$3, DW_AT_name("initExtInt")
      35                      .dwattr $C$DW$3, DW_AT_low_pc(_initExtInt)
      36                      .dwattr $C$DW$3, DW_AT_high_pc(0x00)
      37                      .dwattr $C$DW$3, DW_AT_TI_symbol_name("_initExtInt")
      38                      .dwattr $C$DW$3, DW_AT_external
      39                      .dwattr $C$DW$3, DW_AT_TI_begin_file("../source/initExtInt.c")
      40                      .dwattr $C$DW$3, DW_AT_TI_begin_line(0x05)
      41                      .dwattr $C$DW$3, DW_AT_TI_begin_column(0x06)
      42                      .dwattr $C$DW$3, DW_AT_TI_max_frame_size(-2)
      43                      .dwpsn  file "../source/initExtInt.c",line 6,column 1,is_stmt,address _initExtInt,isa 0
      44              
      45                      .dwfde $C$DW$CIE, _initExtInt
      46              
      47              ;***************************************************************
      48              ;* FNAME: _initExtInt                   FR SIZE:   0           *
      49              ;*                                                             *
      50              ;* FUNCTION ENVIRONMENT                                        *
      51              ;*                                                             *
      52              ;* FUNCTION PROPERTIES                                         *
      53              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      54              ;***************************************************************
      55              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    2

      56 00000000       _initExtInt:
      57                      .dwcfi  cfa_offset, -2
      58                      .dwcfi  save_reg_to_mem, 26, 0
      59 00000000 7622   EALLOW
      60 00000001 761F!         MOVW      DP,#_PieCtrlRegs+2    ; [CPU_U] 
         00000002 0000 
      61                      .dwpsn  file "../source/initExtInt.c",line 9,column 5,is_stmt,isa 0
      62 00000003 1A02!         OR        @_PieCtrlRegs+2,#0x0008 ; [CPU_] |9| 
         00000004 0008 
      63                      .dwpsn  file "../source/initExtInt.c",line 11,column 5,is_stmt,isa 0
      64 00000005 1A00!         OR        @_PieCtrlRegs,#0x0001 ; [CPU_] |11| 
         00000006 0001 
      65 00000007 761F!         MOVW      DP,#_XIntruptRegs     ; [CPU_U] 
         00000008 0000 
      66                      .dwpsn  file "../source/initExtInt.c",line 13,column 5,is_stmt,isa 0
      67 00000009 1A00!         OR        @_XIntruptRegs,#0x0001 ; [CPU_] |13| 
         0000000a 0001 
      68                      .dwpsn  file "../source/initExtInt.c",line 14,column 5,is_stmt,isa 0
      69 0000000b CC00!         AND       AL,@_XIntruptRegs,#0xfff7 ; [CPU_] |14| 
         0000000c FFF7 
      70 0000000d 5004          ORB       AL,#0x04              ; [CPU_] |14| 
      71 0000000e 9600!         MOV       @_XIntruptRegs,AL     ; [CPU_] |14| 
      72 0000000f 2920   clrc DBGM
      73 00000010 761A   EDIS
      74 00000011 761A   EDIS
      75 00000012 FF69          SPM       #0                    ; [CPU_] 
      76              $C$DW$4 .dwtag  DW_TAG_TI_branch
      77                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
      78                      .dwattr $C$DW$4, DW_AT_TI_return
      79              
      80 00000013 0006          LRETR     ; [CPU_] 
      81                      ; return occurs ; [] 
      82                      .dwattr $C$DW$3, DW_AT_TI_end_file("../source/initExtInt.c")
      83                      .dwattr $C$DW$3, DW_AT_TI_end_line(0x18)
      84                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
      85                      .dwendentry
      86                      .dwendtag $C$DW$3
      87              
      88              ;**************************************************************
      89              ;* UNDEFINED EXTERNAL REFERENCES                              *
      90              ;**************************************************************
      91                      .global _XIntruptRegs
      92                      .global _PieCtrlRegs
      93              
      94              ;***************************************************************
      95              ;* TYPE INFORMATION                                            *
      96              ;***************************************************************
      97              
      98              $C$DW$T$20      .dwtag  DW_TAG_structure_type
      99                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     100                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     101              $C$DW$5 .dwtag  DW_TAG_member
     102                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     103                      .dwattr $C$DW$5, DW_AT_name("ACK1")
     104                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_ACK1")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    3

     105                      .dwattr $C$DW$5, DW_AT_bit_offset(0x0f)
     106                      .dwattr $C$DW$5, DW_AT_bit_size(0x01)
     107                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     108                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     109              
     110              $C$DW$6 .dwtag  DW_TAG_member
     111                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     112                      .dwattr $C$DW$6, DW_AT_name("ACK2")
     113                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_ACK2")
     114                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0e)
     115                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     116                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     117                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     118              
     119              $C$DW$7 .dwtag  DW_TAG_member
     120                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     121                      .dwattr $C$DW$7, DW_AT_name("ACK3")
     122                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_ACK3")
     123                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0d)
     124                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     125                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     126                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     127              
     128              $C$DW$8 .dwtag  DW_TAG_member
     129                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     130                      .dwattr $C$DW$8, DW_AT_name("ACK4")
     131                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_ACK4")
     132                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0c)
     133                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     134                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     135                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     136              
     137              $C$DW$9 .dwtag  DW_TAG_member
     138                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     139                      .dwattr $C$DW$9, DW_AT_name("ACK5")
     140                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_ACK5")
     141                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0b)
     142                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     143                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     144                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     145              
     146              $C$DW$10        .dwtag  DW_TAG_member
     147                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     148                      .dwattr $C$DW$10, DW_AT_name("ACK6")
     149                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_ACK6")
     150                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0a)
     151                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     152                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     153                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     154              
     155              $C$DW$11        .dwtag  DW_TAG_member
     156                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     157                      .dwattr $C$DW$11, DW_AT_name("ACK7")
     158                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_ACK7")
     159                      .dwattr $C$DW$11, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    4

     160                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     161                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     162                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     163              
     164              $C$DW$12        .dwtag  DW_TAG_member
     165                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     166                      .dwattr $C$DW$12, DW_AT_name("ACK8")
     167                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_ACK8")
     168                      .dwattr $C$DW$12, DW_AT_bit_offset(0x08)
     169                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     170                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     171                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     172              
     173              $C$DW$13        .dwtag  DW_TAG_member
     174                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     175                      .dwattr $C$DW$13, DW_AT_name("ACK9")
     176                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_ACK9")
     177                      .dwattr $C$DW$13, DW_AT_bit_offset(0x07)
     178                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     179                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     180                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     181              
     182              $C$DW$14        .dwtag  DW_TAG_member
     183                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     184                      .dwattr $C$DW$14, DW_AT_name("ACK10")
     185                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_ACK10")
     186                      .dwattr $C$DW$14, DW_AT_bit_offset(0x06)
     187                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     188                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     189                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     190              
     191              $C$DW$15        .dwtag  DW_TAG_member
     192                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     193                      .dwattr $C$DW$15, DW_AT_name("ACK11")
     194                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_ACK11")
     195                      .dwattr $C$DW$15, DW_AT_bit_offset(0x05)
     196                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     197                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     198                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     199              
     200              $C$DW$16        .dwtag  DW_TAG_member
     201                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     202                      .dwattr $C$DW$16, DW_AT_name("ACK12")
     203                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_ACK12")
     204                      .dwattr $C$DW$16, DW_AT_bit_offset(0x04)
     205                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     206                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     207                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     208              
     209              $C$DW$17        .dwtag  DW_TAG_member
     210                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     211                      .dwattr $C$DW$17, DW_AT_name("rsvd1")
     212                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd1")
     213                      .dwattr $C$DW$17, DW_AT_bit_offset(0x00)
     214                      .dwattr $C$DW$17, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    5

     215                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     216                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     217              
     218                      .dwendtag $C$DW$T$20
     219              
     220              
     221              $C$DW$T$21      .dwtag  DW_TAG_union_type
     222                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
     223                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     224              $C$DW$18        .dwtag  DW_TAG_member
     225                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     226                      .dwattr $C$DW$18, DW_AT_name("all")
     227                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_all")
     228                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     229                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     230              
     231              $C$DW$19        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     233                      .dwattr $C$DW$19, DW_AT_name("bit")
     234                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_bit")
     235                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     236                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     237              
     238                      .dwendtag $C$DW$T$21
     239              
     240              
     241              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     242                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
     243                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     244              $C$DW$20        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$20, DW_AT_name("ENPIE")
     247                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_ENPIE")
     248                      .dwattr $C$DW$20, DW_AT_bit_offset(0x0f)
     249                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     250                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     252              
     253              $C$DW$21        .dwtag  DW_TAG_member
     254                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     255                      .dwattr $C$DW$21, DW_AT_name("PIEVECT")
     256                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_PIEVECT")
     257                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00)
     258                      .dwattr $C$DW$21, DW_AT_bit_size(0x0f)
     259                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     261              
     262                      .dwendtag $C$DW$T$22
     263              
     264              
     265              $C$DW$T$23      .dwtag  DW_TAG_union_type
     266                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
     267                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     268              $C$DW$22        .dwtag  DW_TAG_member
     269                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    6

     270                      .dwattr $C$DW$22, DW_AT_name("all")
     271                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_all")
     272                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     274              
     275              $C$DW$23        .dwtag  DW_TAG_member
     276                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     277                      .dwattr $C$DW$23, DW_AT_name("bit")
     278                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_bit")
     279                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     281              
     282                      .dwendtag $C$DW$T$23
     283              
     284              
     285              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     286                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
     287                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     288              $C$DW$24        .dwtag  DW_TAG_member
     289                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     290                      .dwattr $C$DW$24, DW_AT_name("INTx1")
     291                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_INTx1")
     292                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0f)
     293                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     294                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     295                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     296              
     297              $C$DW$25        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     299                      .dwattr $C$DW$25, DW_AT_name("INTx2")
     300                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_INTx2")
     301                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0e)
     302                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     303                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     304                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     305              
     306              $C$DW$26        .dwtag  DW_TAG_member
     307                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     308                      .dwattr $C$DW$26, DW_AT_name("INTx3")
     309                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_INTx3")
     310                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0d)
     311                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     312                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     313                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     314              
     315              $C$DW$27        .dwtag  DW_TAG_member
     316                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     317                      .dwattr $C$DW$27, DW_AT_name("INTx4")
     318                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTx4")
     319                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0c)
     320                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     321                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     322                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     323              
     324              $C$DW$28        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    7

     325                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     326                      .dwattr $C$DW$28, DW_AT_name("INTx5")
     327                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_INTx5")
     328                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0b)
     329                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     330                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     331                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     332              
     333              $C$DW$29        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     335                      .dwattr $C$DW$29, DW_AT_name("INTx6")
     336                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_INTx6")
     337                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0a)
     338                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     339                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342              $C$DW$30        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     344                      .dwattr $C$DW$30, DW_AT_name("INTx7")
     345                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_INTx7")
     346                      .dwattr $C$DW$30, DW_AT_bit_offset(0x09)
     347                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     348                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     349                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     350              
     351              $C$DW$31        .dwtag  DW_TAG_member
     352                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     353                      .dwattr $C$DW$31, DW_AT_name("INTx8")
     354                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_INTx8")
     355                      .dwattr $C$DW$31, DW_AT_bit_offset(0x08)
     356                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     357                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     358                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     359              
     360              $C$DW$32        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     362                      .dwattr $C$DW$32, DW_AT_name("rsvd1")
     363                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd1")
     364                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     365                      .dwattr $C$DW$32, DW_AT_bit_size(0x08)
     366                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     367                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     368              
     369                      .dwendtag $C$DW$T$24
     370              
     371              
     372              $C$DW$T$25      .dwtag  DW_TAG_union_type
     373                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
     374                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     375              $C$DW$33        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     377                      .dwattr $C$DW$33, DW_AT_name("all")
     378                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_all")
     379                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    8

     380                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     381              
     382              $C$DW$34        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$24)
     384                      .dwattr $C$DW$34, DW_AT_name("bit")
     385                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_bit")
     386                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     387                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389                      .dwendtag $C$DW$T$25
     390              
     391              
     392              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     393                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
     394                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     395              $C$DW$35        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     397                      .dwattr $C$DW$35, DW_AT_name("INTx1")
     398                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTx1")
     399                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0f)
     400                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     401                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     403              
     404              $C$DW$36        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$36, DW_AT_name("INTx2")
     407                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_INTx2")
     408                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0e)
     409                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     410                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     412              
     413              $C$DW$37        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     415                      .dwattr $C$DW$37, DW_AT_name("INTx3")
     416                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTx3")
     417                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0d)
     418                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     419                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     420                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     421              
     422              $C$DW$38        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$38, DW_AT_name("INTx4")
     425                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_INTx4")
     426                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0c)
     427                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     428                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$39        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$39, DW_AT_name("INTx5")
     434                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_INTx5")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE    9

     435                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0b)
     436                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     437                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$40        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     442                      .dwattr $C$DW$40, DW_AT_name("INTx6")
     443                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_INTx6")
     444                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0a)
     445                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     446                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     447                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     448              
     449              $C$DW$41        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     451                      .dwattr $C$DW$41, DW_AT_name("INTx7")
     452                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_INTx7")
     453                      .dwattr $C$DW$41, DW_AT_bit_offset(0x09)
     454                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     455                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     456                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$42        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$42, DW_AT_name("INTx8")
     461                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_INTx8")
     462                      .dwattr $C$DW$42, DW_AT_bit_offset(0x08)
     463                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     464                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$43        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$43, DW_AT_name("rsvd1")
     470                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd1")
     471                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00)
     472                      .dwattr $C$DW$43, DW_AT_bit_size(0x08)
     473                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     475              
     476                      .dwendtag $C$DW$T$26
     477              
     478              
     479              $C$DW$T$27      .dwtag  DW_TAG_union_type
     480                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
     481                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     482              $C$DW$44        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     484                      .dwattr $C$DW$44, DW_AT_name("all")
     485                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     486                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     487                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$45        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   10

     490                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$26)
     491                      .dwattr $C$DW$45, DW_AT_name("bit")
     492                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bit")
     493                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     495              
     496                      .dwendtag $C$DW$T$27
     497              
     498              
     499              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     500                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
     501                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
     502              $C$DW$46        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     504                      .dwattr $C$DW$46, DW_AT_name("PIECTRL")
     505                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PIECTRL")
     506                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     508              
     509              $C$DW$47        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$21)
     511                      .dwattr $C$DW$47, DW_AT_name("PIEACK")
     512                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_PIEACK")
     513                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     514                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$48        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$25)
     518                      .dwattr $C$DW$48, DW_AT_name("PIEIER1")
     519                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_PIEIER1")
     520                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     521                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$49        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$27)
     525                      .dwattr $C$DW$49, DW_AT_name("PIEIFR1")
     526                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PIEIFR1")
     527                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     528                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$50        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
     532                      .dwattr $C$DW$50, DW_AT_name("PIEIER2")
     533                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PIEIER2")
     534                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     535                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     536              
     537              $C$DW$51        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$27)
     539                      .dwattr $C$DW$51, DW_AT_name("PIEIFR2")
     540                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PIEIFR2")
     541                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     542                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     543              
     544              $C$DW$52        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   11

     545                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
     546                      .dwattr $C$DW$52, DW_AT_name("PIEIER3")
     547                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PIEIER3")
     548                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     549                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     550              
     551              $C$DW$53        .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$27)
     553                      .dwattr $C$DW$53, DW_AT_name("PIEIFR3")
     554                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PIEIFR3")
     555                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     556                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558              $C$DW$54        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$25)
     560                      .dwattr $C$DW$54, DW_AT_name("PIEIER4")
     561                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PIEIER4")
     562                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     563                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565              $C$DW$55        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$27)
     567                      .dwattr $C$DW$55, DW_AT_name("PIEIFR4")
     568                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PIEIFR4")
     569                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     570                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     571              
     572              $C$DW$56        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
     574                      .dwattr $C$DW$56, DW_AT_name("PIEIER5")
     575                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PIEIER5")
     576                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     577                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579              $C$DW$57        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$27)
     581                      .dwattr $C$DW$57, DW_AT_name("PIEIFR5")
     582                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PIEIFR5")
     583                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     584                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$58        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$25)
     588                      .dwattr $C$DW$58, DW_AT_name("PIEIER6")
     589                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PIEIER6")
     590                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     591                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     592              
     593              $C$DW$59        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$27)
     595                      .dwattr $C$DW$59, DW_AT_name("PIEIFR6")
     596                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PIEIFR6")
     597                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     598                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     599              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   12

     600              $C$DW$60        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
     602                      .dwattr $C$DW$60, DW_AT_name("PIEIER7")
     603                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PIEIER7")
     604                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     605                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     606              
     607              $C$DW$61        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$27)
     609                      .dwattr $C$DW$61, DW_AT_name("PIEIFR7")
     610                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PIEIFR7")
     611                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     612                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     613              
     614              $C$DW$62        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     616                      .dwattr $C$DW$62, DW_AT_name("PIEIER8")
     617                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PIEIER8")
     618                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     619                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     620              
     621              $C$DW$63        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$27)
     623                      .dwattr $C$DW$63, DW_AT_name("PIEIFR8")
     624                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PIEIFR8")
     625                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     626                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     627              
     628              $C$DW$64        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$25)
     630                      .dwattr $C$DW$64, DW_AT_name("PIEIER9")
     631                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PIEIER9")
     632                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     633                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     634              
     635              $C$DW$65        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$27)
     637                      .dwattr $C$DW$65, DW_AT_name("PIEIFR9")
     638                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PIEIFR9")
     639                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     640                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     641              
     642              $C$DW$66        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
     644                      .dwattr $C$DW$66, DW_AT_name("PIEIER10")
     645                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PIEIER10")
     646                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     647                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     648              
     649              $C$DW$67        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$27)
     651                      .dwattr $C$DW$67, DW_AT_name("PIEIFR10")
     652                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PIEIFR10")
     653                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     654                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   13

     655              
     656              $C$DW$68        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$25)
     658                      .dwattr $C$DW$68, DW_AT_name("PIEIER11")
     659                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PIEIER11")
     660                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     661                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     662              
     663              $C$DW$69        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$27)
     665                      .dwattr $C$DW$69, DW_AT_name("PIEIFR11")
     666                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PIEIFR11")
     667                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     668                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     669              
     670              $C$DW$70        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$25)
     672                      .dwattr $C$DW$70, DW_AT_name("PIEIER12")
     673                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PIEIER12")
     674                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     675                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     676              
     677              $C$DW$71        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$27)
     679                      .dwattr $C$DW$71, DW_AT_name("PIEIFR12")
     680                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PIEIFR12")
     681                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     682                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     683              
     684                      .dwendtag $C$DW$T$28
     685              
     686              $C$DW$72        .dwtag  DW_TAG_TI_far_type
     687                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$28)
     688              
     689              $C$DW$T$35      .dwtag  DW_TAG_volatile_type
     690                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$72)
     691              
     692              
     693              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     694                      .dwattr $C$DW$T$29, DW_AT_name("XINTCR_BITS")
     695                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     696              $C$DW$73        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$73, DW_AT_name("ENABLE")
     699                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ENABLE")
     700                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f)
     701                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     702                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     704              
     705              $C$DW$74        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$74, DW_AT_name("rsvd1")
     708                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd1")
     709                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   14

     710                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     711                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$75        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$75, DW_AT_name("POLARITY")
     717                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_POLARITY")
     718                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c)
     719                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
     720                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723              $C$DW$76        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$76, DW_AT_name("rsvd2")
     726                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd2")
     727                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     728                      .dwattr $C$DW$76, DW_AT_bit_size(0x0c)
     729                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732                      .dwendtag $C$DW$T$29
     733              
     734              
     735              $C$DW$T$30      .dwtag  DW_TAG_union_type
     736                      .dwattr $C$DW$T$30, DW_AT_name("XINTCR_REG")
     737                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     738              $C$DW$77        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$77, DW_AT_name("all")
     741                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     742                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$78        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$29)
     747                      .dwattr $C$DW$78, DW_AT_name("bit")
     748                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     749                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752                      .dwendtag $C$DW$T$30
     753              
     754              
     755              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     756                      .dwattr $C$DW$T$32, DW_AT_name("XINTRUPT_REGS")
     757                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
     758              $C$DW$79        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$30)
     760                      .dwattr $C$DW$79, DW_AT_name("XINT1CR")
     761                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_XINT1CR")
     762                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     764              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   15

     765              $C$DW$80        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$30)
     767                      .dwattr $C$DW$80, DW_AT_name("XINT2CR")
     768                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_XINT2CR")
     769                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     770                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     771              
     772              $C$DW$81        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$30)
     774                      .dwattr $C$DW$81, DW_AT_name("XINT3CR")
     775                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_XINT3CR")
     776                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     777                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     778              
     779              $C$DW$82        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$31)
     781                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
     782                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
     783                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     784                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     785              
     786              $C$DW$83        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$83, DW_AT_name("XINT1CTR")
     789                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_XINT1CTR")
     790                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     791                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     792              
     793              $C$DW$84        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$84, DW_AT_name("XINT2CTR")
     796                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_XINT2CTR")
     797                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     798                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     799              
     800              $C$DW$85        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$85, DW_AT_name("XINT3CTR")
     803                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_XINT3CTR")
     804                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     805                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     806              
     807              $C$DW$86        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$31)
     809                      .dwattr $C$DW$86, DW_AT_name("rsvd2")
     810                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd2")
     811                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     812                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     813              
     814                      .dwendtag $C$DW$T$32
     815              
     816              $C$DW$87        .dwtag  DW_TAG_TI_far_type
     817                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$32)
     818              
     819              $C$DW$T$37      .dwtag  DW_TAG_volatile_type
TMS320C2000 Assembler PC v16.9.6 Sat May 05 11:56:06 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initExtInt.asm                                                       PAGE   16

     820                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$87)
     821              
     822              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     823                      .dwattr $C$DW$T$2, DW_AT_name("void")
     824              
     825              $C$DW$T$4       .dwtag  DW_TAG_base_type
     826                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     827                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     828                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     829              
     830              $C$DW$T$5       .dwtag  DW_TAG_base_type
     831                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     832                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     833                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     834              
     835              $C$DW$T$6       .dwtag  DW_TAG_base_type
     836                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     837                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     838                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     839              
     840              $C$DW$T$7       .dwtag  DW_TAG_base_type
     841                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     842                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     843                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     844              
     845              $C$DW$T$8       .dwtag  DW_TAG_base_type
     846                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     847                      .dwattr $C$DW$T$8, DW_AT_name("short")
     848                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     849              
     850              $C$DW$T$9       .dwtag  DW_TAG_base_type
     851                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     852                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     853                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     854              
     855              $C$DW$T$10      .dwtag  DW_TAG_base_type
     856                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     857                      .dwattr $C$DW$T$10, DW_AT_name("int")
     858                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     859              
     860              $C$DW$T$11      .dwtag  DW_TAG_base_type
     861                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     862                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     863                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     864              
     865              $C$DW$T$19      .dwtag  DW_TAG_typedef
     866                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
     867                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     868                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     869              
     870              
     871              $C$DW$T$31      .dwtag  DW_TAG_array_type
     872                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
