TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Apr 10 14:49:16 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initMCU.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioDataRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioDataRegs")

      60              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      61              ;***************************************************************
      62              
      63 00000000       _initMCU:
      64              ;* AR6   assigned to $O$C1
      65              ;* AR4   assigned to $O$C2
      66                      .dwcfi  cfa_offset, -2
      67                      .dwcfi  save_reg_to_mem, 26, 0
      68 00000000 7622   EALLOW
      69                      .dwpsn  file "../source/initMCU.c",line 23,column 5,is_stmt,isa 0
      70 00000001 8F00!         MOVL      XAR4,#_GpioCtrlRegs   ; [CPU_U] |23| 
         00000002 0000 
      71 00000003 83A4          MOVL      XAR5,XAR4             ; [CPU_] |23| 
      72 00000004 761F!         MOVW      DP,#_GpioCtrlRegs+22  ; [CPU_U] 
         00000005 0000 
      73                      .dwpsn  file "../source/initMCU.c",line 27,column 5,is_stmt,isa 0
      74 00000006 7680!         MOVL      XAR6,#_SysCtrlRegs    ; [CPU_U] |27| 
         00000007 0000 
      75                      .dwpsn  file "../source/initMCU.c",line 24,column 5,is_stmt,isa 0
      76 00000008 DC16          ADDB      XAR4,#22              ; [CPU_] |24| 
      77                      .dwpsn  file "../source/initMCU.c",line 23,column 5,is_stmt,isa 0
      78 00000009 DD08          ADDB      XAR5,#8               ; [CPU_] |23| 
      79 0000000a 1AC5          OR        *+XAR5[0],#0x0030     ; [CPU_] |23| 
         0000000b 0030 
      80                      .dwpsn  file "../source/initMCU.c",line 24,column 5,is_stmt,isa 0
      81 0000000c 18C4          AND       *+XAR4[0],#0xffcf     ; [CPU_] |24| 
         0000000d FFCF 
      82                      .dwpsn  file "../source/initMCU.c",line 25,column 5,is_stmt,isa 0
      83 0000000e 1816!         AND       @_GpioCtrlRegs+22,#0x3fff ; [CPU_] |25| 
         0000000f 3FFF 
      84                      .dwpsn  file "../source/initMCU.c",line 29,column 5,is_stmt,isa 0
      85 00000010 8AA6          MOVL      XAR4,XAR6             ; [CPU_] |29| 
      86 00000011 761F!         MOVW      DP,#_GpioDataRegs+8   ; [CPU_U] 
         00000012 0000 
      87                      .dwpsn  file "../source/initMCU.c",line 27,column 5,is_stmt,isa 0
      88 00000013 CCC6          AND       AL,*+XAR6[0],#0xfffe  ; [CPU_] |27| 
         00000014 FFFE 
      89 00000015 5002          ORB       AL,#0x02              ; [CPU_] |27| 
      90                      .dwpsn  file "../source/initMCU.c",line 29,column 5,is_stmt,isa 0
      91 00000016 DC11          ADDB      XAR4,#17              ; [CPU_] |29| 
      92                      .dwpsn  file "../source/initMCU.c",line 27,column 5,is_stmt,isa 0
      93 00000017 96C6          MOV       *+XAR6[0],AL          ; [CPU_] |27| 
      94                      .dwpsn  file "../source/initMCU.c",line 28,column 5,is_stmt,isa 0
      95 00000018 1ACE          OR        *+XAR6[1],#0x0180     ; [CPU_] |28| 
         00000019 0180 
      96                      .dwpsn  file "../source/initMCU.c",line 29,column 5,is_stmt,isa 0
      97 0000001a 18C4          AND       *+XAR4[0],#0xffe0     ; [CPU_] |29| 
         0000001b FFE0 
      98                      .dwpsn  file "../source/initMCU.c",line 32,column 5,is_stmt,isa 0
      99 0000001c 1A08!         OR        @_GpioDataRegs+8,#132 ; [CPU_] |32| 
         0000001d 0084 
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    3

     100 0000001e 761F!         MOVW      DP,#_GpioCtrlRegs+26  ; [CPU_U] 
         0000001f 0000 
     101                      .dwpsn  file "../source/initMCU.c",line 33,column 5,is_stmt,isa 0
     102 00000020 1A1A!         OR        @_GpioCtrlRegs+26,#132 ; [CPU_] |33| 
         00000021 0084 
     103 00000022 761A   EDIS
     104 00000023 FF69          SPM       #0                    ; [CPU_] 
     105              $C$DW$5 .dwtag  DW_TAG_TI_branch
     106                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     107                      .dwattr $C$DW$5, DW_AT_TI_return
     108              
     109 00000024 0006          LRETR     ; [CPU_] 
     110                      ; return occurs ; [] 
     111                      .dwattr $C$DW$4, DW_AT_TI_end_file("../source/initMCU.c")
     112                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x26)
     113                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     114                      .dwendentry
     115                      .dwendtag $C$DW$4
     116              
     117              ;**************************************************************
     118              ;* UNDEFINED EXTERNAL REFERENCES                              *
     119              ;**************************************************************
     120                      .global _GpioDataRegs
     121                      .global _SysCtrlRegs
     122                      .global _GpioCtrlRegs
     123              
     124              ;***************************************************************
     125              ;* TYPE INFORMATION                                            *
     126              ;***************************************************************
     127              
     128              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     129                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     130                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     131              $C$DW$6 .dwtag  DW_TAG_member
     132                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     133                      .dwattr $C$DW$6, DW_AT_name("rsvd1")
     134                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_rsvd1")
     135                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     136                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     137                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     138                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     139              
     140              $C$DW$7 .dwtag  DW_TAG_member
     141                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     142                      .dwattr $C$DW$7, DW_AT_name("rsvd2")
     143                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_rsvd2")
     144                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     145                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     146                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     147                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     148              
     149              $C$DW$8 .dwtag  DW_TAG_member
     150                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     151                      .dwattr $C$DW$8, DW_AT_name("AIO2")
     152                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_AIO2")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    4

     153                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     154                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     155                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     156                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     157              
     158              $C$DW$9 .dwtag  DW_TAG_member
     159                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     160                      .dwattr $C$DW$9, DW_AT_name("rsvd3")
     161                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_rsvd3")
     162                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c)
     163                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     164                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     165                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     166              
     167              $C$DW$10        .dwtag  DW_TAG_member
     168                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     169                      .dwattr $C$DW$10, DW_AT_name("AIO4")
     170                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_AIO4")
     171                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b)
     172                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     173                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     174                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     175              
     176              $C$DW$11        .dwtag  DW_TAG_member
     177                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     178                      .dwattr $C$DW$11, DW_AT_name("rsvd4")
     179                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_rsvd4")
     180                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a)
     181                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     182                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     183                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     184              
     185              $C$DW$12        .dwtag  DW_TAG_member
     186                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     187                      .dwattr $C$DW$12, DW_AT_name("AIO6")
     188                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_AIO6")
     189                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09)
     190                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     191                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     192                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     193              
     194              $C$DW$13        .dwtag  DW_TAG_member
     195                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     196                      .dwattr $C$DW$13, DW_AT_name("rsvd5")
     197                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_rsvd5")
     198                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     199                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     200                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     201                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     202              
     203              $C$DW$14        .dwtag  DW_TAG_member
     204                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     205                      .dwattr $C$DW$14, DW_AT_name("rsvd6")
     206                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_rsvd6")
     207                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    5

     208                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     209                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     210                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     211              
     212              $C$DW$15        .dwtag  DW_TAG_member
     213                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     214                      .dwattr $C$DW$15, DW_AT_name("rsvd7")
     215                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd7")
     216                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06)
     217                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     218                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     219                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     220              
     221              $C$DW$16        .dwtag  DW_TAG_member
     222                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     223                      .dwattr $C$DW$16, DW_AT_name("AIO10")
     224                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_AIO10")
     225                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05)
     226                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     227                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     228                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     229              
     230              $C$DW$17        .dwtag  DW_TAG_member
     231                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     232                      .dwattr $C$DW$17, DW_AT_name("rsvd8")
     233                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd8")
     234                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     235                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     236                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     237                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     238              
     239              $C$DW$18        .dwtag  DW_TAG_member
     240                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     241                      .dwattr $C$DW$18, DW_AT_name("AIO12")
     242                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_AIO12")
     243                      .dwattr $C$DW$18, DW_AT_bit_offset(0x03)
     244                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     245                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     246                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     247              
     248              $C$DW$19        .dwtag  DW_TAG_member
     249                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     250                      .dwattr $C$DW$19, DW_AT_name("rsvd9")
     251                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd9")
     252                      .dwattr $C$DW$19, DW_AT_bit_offset(0x02)
     253                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     254                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     255                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     256              
     257              $C$DW$20        .dwtag  DW_TAG_member
     258                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     259                      .dwattr $C$DW$20, DW_AT_name("AIO14")
     260                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_AIO14")
     261                      .dwattr $C$DW$20, DW_AT_bit_offset(0x01)
     262                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    6

     263                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     264                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     265              
     266              $C$DW$21        .dwtag  DW_TAG_member
     267                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     268                      .dwattr $C$DW$21, DW_AT_name("rsvd10")
     269                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd10")
     270                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00)
     271                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     272                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     274              
     275              $C$DW$22        .dwtag  DW_TAG_member
     276                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     277                      .dwattr $C$DW$22, DW_AT_name("rsvd11")
     278                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd11")
     279                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     280                      .dwattr $C$DW$22, DW_AT_bit_size(0x10)
     281                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     282                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     283              
     284                      .dwendtag $C$DW$T$20
     285              
     286              
     287              $C$DW$T$22      .dwtag  DW_TAG_union_type
     288                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     289                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     290              $C$DW$23        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     292                      .dwattr $C$DW$23, DW_AT_name("all")
     293                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     294                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     295                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     296              
     297              $C$DW$24        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     299                      .dwattr $C$DW$24, DW_AT_name("bit")
     300                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     301                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     303              
     304                      .dwendtag $C$DW$T$22
     305              
     306              
     307              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     308                      .dwattr $C$DW$T$23, DW_AT_name("AIO_BITS")
     309                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     310              $C$DW$25        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$25, DW_AT_name("rsvd1")
     313                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd1")
     314                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0e)
     315                      .dwattr $C$DW$25, DW_AT_bit_size(0x02)
     316                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     317                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    7

     318              
     319              $C$DW$26        .dwtag  DW_TAG_member
     320                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     321                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     322                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     323                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0c)
     324                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     325                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     326                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     327              
     328              $C$DW$27        .dwtag  DW_TAG_member
     329                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     330                      .dwattr $C$DW$27, DW_AT_name("AIO2")
     331                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_AIO2")
     332                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0a)
     333                      .dwattr $C$DW$27, DW_AT_bit_size(0x02)
     334                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     335                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     336              
     337              $C$DW$28        .dwtag  DW_TAG_member
     338                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     339                      .dwattr $C$DW$28, DW_AT_name("rsvd3")
     340                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd3")
     341                      .dwattr $C$DW$28, DW_AT_bit_offset(0x08)
     342                      .dwattr $C$DW$28, DW_AT_bit_size(0x02)
     343                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     344                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     345              
     346              $C$DW$29        .dwtag  DW_TAG_member
     347                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     348                      .dwattr $C$DW$29, DW_AT_name("AIO4")
     349                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_AIO4")
     350                      .dwattr $C$DW$29, DW_AT_bit_offset(0x06)
     351                      .dwattr $C$DW$29, DW_AT_bit_size(0x02)
     352                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$30        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$30, DW_AT_name("rsvd4")
     358                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd4")
     359                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     360                      .dwattr $C$DW$30, DW_AT_bit_size(0x02)
     361                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     363              
     364              $C$DW$31        .dwtag  DW_TAG_member
     365                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     366                      .dwattr $C$DW$31, DW_AT_name("AIO6")
     367                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_AIO6")
     368                      .dwattr $C$DW$31, DW_AT_bit_offset(0x02)
     369                      .dwattr $C$DW$31, DW_AT_bit_size(0x02)
     370                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     371                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     372              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    8

     373              $C$DW$32        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     375                      .dwattr $C$DW$32, DW_AT_name("rsvd5")
     376                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd5")
     377                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     378                      .dwattr $C$DW$32, DW_AT_bit_size(0x02)
     379                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     380                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     381              
     382              $C$DW$33        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     384                      .dwattr $C$DW$33, DW_AT_name("rsvd6")
     385                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd6")
     386                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0e)
     387                      .dwattr $C$DW$33, DW_AT_bit_size(0x02)
     388                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     389                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     390              
     391              $C$DW$34        .dwtag  DW_TAG_member
     392                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     393                      .dwattr $C$DW$34, DW_AT_name("rsvd7")
     394                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd7")
     395                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c)
     396                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     397                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     398                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     399              
     400              $C$DW$35        .dwtag  DW_TAG_member
     401                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     402                      .dwattr $C$DW$35, DW_AT_name("AIO10")
     403                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_AIO10")
     404                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
     405                      .dwattr $C$DW$35, DW_AT_bit_size(0x02)
     406                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     407                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     408              
     409              $C$DW$36        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     411                      .dwattr $C$DW$36, DW_AT_name("rsvd8")
     412                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd8")
     413                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08)
     414                      .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     415                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     416                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     417              
     418              $C$DW$37        .dwtag  DW_TAG_member
     419                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     420                      .dwattr $C$DW$37, DW_AT_name("AIO12")
     421                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_AIO12")
     422                      .dwattr $C$DW$37, DW_AT_bit_offset(0x06)
     423                      .dwattr $C$DW$37, DW_AT_bit_size(0x02)
     424                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     425                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     426              
     427              $C$DW$38        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE    9

     428                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     429                      .dwattr $C$DW$38, DW_AT_name("rsvd9")
     430                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd9")
     431                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     432                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
     433                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     434                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     435              
     436              $C$DW$39        .dwtag  DW_TAG_member
     437                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     438                      .dwattr $C$DW$39, DW_AT_name("AIO14")
     439                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_AIO14")
     440                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     441                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     442                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     443                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     444              
     445              $C$DW$40        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$40, DW_AT_name("rsvd10")
     448                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd10")
     449                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     450                      .dwattr $C$DW$40, DW_AT_bit_size(0x02)
     451                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     452                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     453              
     454                      .dwendtag $C$DW$T$23
     455              
     456              
     457              $C$DW$T$24      .dwtag  DW_TAG_union_type
     458                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
     459                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     460              $C$DW$41        .dwtag  DW_TAG_member
     461                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     462                      .dwattr $C$DW$41, DW_AT_name("all")
     463                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     464                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467              $C$DW$42        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     469                      .dwattr $C$DW$42, DW_AT_name("bit")
     470                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     471                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     472                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     473              
     474                      .dwendtag $C$DW$T$24
     475              
     476              
     477              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     478                      .dwattr $C$DW$T$25, DW_AT_name("CLKCTL_BITS")
     479                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     480              $C$DW$43        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$43, DW_AT_name("OSCCLKSRCSEL")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   10

     483                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     484                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f)
     485                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     486                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     487                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$44        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     491                      .dwattr $C$DW$44, DW_AT_name("OSCCLKSRC2SEL")
     492                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     493                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e)
     494                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     495                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     496                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     497              
     498              $C$DW$45        .dwtag  DW_TAG_member
     499                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     500                      .dwattr $C$DW$45, DW_AT_name("WDCLKSRCSEL")
     501                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     502                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d)
     503                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     504                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     506              
     507              $C$DW$46        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     509                      .dwattr $C$DW$46, DW_AT_name("TMR2CLKSRCSEL")
     510                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     511                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0b)
     512                      .dwattr $C$DW$46, DW_AT_bit_size(0x02)
     513                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$47        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$47, DW_AT_name("TMR2CLKPRESCALE")
     519                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     520                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
     521                      .dwattr $C$DW$47, DW_AT_bit_size(0x03)
     522                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525              $C$DW$48        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$48, DW_AT_name("INTOSC1OFF")
     528                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_INTOSC1OFF")
     529                      .dwattr $C$DW$48, DW_AT_bit_offset(0x07)
     530                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     531                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     532                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534              $C$DW$49        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     536                      .dwattr $C$DW$49, DW_AT_name("INTOSC1HALTI")
     537                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_INTOSC1HALTI")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   11

     538                      .dwattr $C$DW$49, DW_AT_bit_offset(0x06)
     539                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     540                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     541                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     542              
     543              $C$DW$50        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     545                      .dwattr $C$DW$50, DW_AT_name("INTOSC2OFF")
     546                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_INTOSC2OFF")
     547                      .dwattr $C$DW$50, DW_AT_bit_offset(0x05)
     548                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     549                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     551              
     552              $C$DW$51        .dwtag  DW_TAG_member
     553                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     554                      .dwattr $C$DW$51, DW_AT_name("INTOSC2HALTI")
     555                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     556                      .dwattr $C$DW$51, DW_AT_bit_offset(0x04)
     557                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     558                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     560              
     561              $C$DW$52        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     563                      .dwattr $C$DW$52, DW_AT_name("WDHALTI")
     564                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_WDHALTI")
     565                      .dwattr $C$DW$52, DW_AT_bit_offset(0x03)
     566                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     567                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     569              
     570              $C$DW$53        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$53, DW_AT_name("XCLKINOFF")
     573                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_XCLKINOFF")
     574                      .dwattr $C$DW$53, DW_AT_bit_offset(0x02)
     575                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     576                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579              $C$DW$54        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     581                      .dwattr $C$DW$54, DW_AT_name("XTALOSCOFF")
     582                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_XTALOSCOFF")
     583                      .dwattr $C$DW$54, DW_AT_bit_offset(0x01)
     584                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     585                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     586                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     587              
     588              $C$DW$55        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     590                      .dwattr $C$DW$55, DW_AT_name("NMIRESETSEL")
     591                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_NMIRESETSEL")
     592                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   12

     593                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     594                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     596              
     597                      .dwendtag $C$DW$T$25
     598              
     599              
     600              $C$DW$T$26      .dwtag  DW_TAG_union_type
     601                      .dwattr $C$DW$T$26, DW_AT_name("CLKCTL_REG")
     602                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     603              $C$DW$56        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$56, DW_AT_name("all")
     606                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     607                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$57        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$25)
     612                      .dwattr $C$DW$57, DW_AT_name("bit")
     613                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     614                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617                      .dwendtag $C$DW$T$26
     618              
     619              
     620              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     621                      .dwattr $C$DW$T$27, DW_AT_name("EPWMCFG_BITS")
     622                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     623              $C$DW$58        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$58, DW_AT_name("CONFIG")
     626                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CONFIG")
     627                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0f)
     628                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     629                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632              $C$DW$59        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$59, DW_AT_name("rsvd1")
     635                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd1")
     636                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00)
     637                      .dwattr $C$DW$59, DW_AT_bit_size(0x0f)
     638                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641                      .dwendtag $C$DW$T$27
     642              
     643              
     644              $C$DW$T$28      .dwtag  DW_TAG_union_type
     645                      .dwattr $C$DW$T$28, DW_AT_name("EPWMCFG_REG")
     646                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     647              $C$DW$60        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   13

     648                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$60, DW_AT_name("all")
     650                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_all")
     651                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$61        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$27)
     656                      .dwattr $C$DW$61, DW_AT_name("bit")
     657                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_bit")
     658                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     660              
     661                      .dwendtag $C$DW$T$28
     662              
     663              
     664              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     665                      .dwattr $C$DW$T$29, DW_AT_name("GPA1_BITS")
     666                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     667              $C$DW$62        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$62, DW_AT_name("GPIO0")
     670                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO0")
     671                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e)
     672                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
     673                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$63        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$63, DW_AT_name("GPIO1")
     679                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO1")
     680                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0c)
     681                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     682                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685              $C$DW$64        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$64, DW_AT_name("GPIO2")
     688                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO2")
     689                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0a)
     690                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
     691                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$65        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$65, DW_AT_name("GPIO3")
     697                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO3")
     698                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08)
     699                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
     700                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     701                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     702              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   14

     703              $C$DW$66        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     705                      .dwattr $C$DW$66, DW_AT_name("GPIO4")
     706                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO4")
     707                      .dwattr $C$DW$66, DW_AT_bit_offset(0x06)
     708                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     709                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712              $C$DW$67        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$67, DW_AT_name("GPIO5")
     715                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO5")
     716                      .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
     717                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
     718                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$68        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$68, DW_AT_name("GPIO6")
     724                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO6")
     725                      .dwattr $C$DW$68, DW_AT_bit_offset(0x02)
     726                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     727                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$69        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$69, DW_AT_name("GPIO7")
     733                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO7")
     734                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     735                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
     736                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739              $C$DW$70        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$70, DW_AT_name("GPIO8")
     742                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO8")
     743                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0e)
     744                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     745                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     746                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748              $C$DW$71        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$71, DW_AT_name("GPIO9")
     751                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO9")
     752                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0c)
     753                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     754                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     755                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     756              
     757              $C$DW$72        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   15

     758                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$72, DW_AT_name("GPIO10")
     760                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO10")
     761                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a)
     762                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
     763                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     764                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$73        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$73, DW_AT_name("GPIO11")
     769                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO11")
     770                      .dwattr $C$DW$73, DW_AT_bit_offset(0x08)
     771                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
     772                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     773                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     774              
     775              $C$DW$74        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$74, DW_AT_name("GPIO12")
     778                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO12")
     779                      .dwattr $C$DW$74, DW_AT_bit_offset(0x06)
     780                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
     781                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     782                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784              $C$DW$75        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$75, DW_AT_name("GPIO13")
     787                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO13")
     788                      .dwattr $C$DW$75, DW_AT_bit_offset(0x04)
     789                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
     790                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     791                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     792              
     793              $C$DW$76        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$76, DW_AT_name("GPIO14")
     796                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO14")
     797                      .dwattr $C$DW$76, DW_AT_bit_offset(0x02)
     798                      .dwattr $C$DW$76, DW_AT_bit_size(0x02)
     799                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     800                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     801              
     802              $C$DW$77        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$77, DW_AT_name("GPIO15")
     805                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO15")
     806                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
     807                      .dwattr $C$DW$77, DW_AT_bit_size(0x02)
     808                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     809                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811                      .dwendtag $C$DW$T$29
     812              
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   16

     813              
     814              $C$DW$T$30      .dwtag  DW_TAG_union_type
     815                      .dwattr $C$DW$T$30, DW_AT_name("GPA1_REG")
     816                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     817              $C$DW$78        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
     819                      .dwattr $C$DW$78, DW_AT_name("all")
     820                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_all")
     821                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$79        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$29)
     826                      .dwattr $C$DW$79, DW_AT_name("bit")
     827                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_bit")
     828                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831                      .dwendtag $C$DW$T$30
     832              
     833              
     834              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     835                      .dwattr $C$DW$T$31, DW_AT_name("GPA2_BITS")
     836                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     837              $C$DW$80        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$80, DW_AT_name("GPIO16")
     840                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO16")
     841                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e)
     842                      .dwattr $C$DW$80, DW_AT_bit_size(0x02)
     843                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$81        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$81, DW_AT_name("GPIO17")
     849                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO17")
     850                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0c)
     851                      .dwattr $C$DW$81, DW_AT_bit_size(0x02)
     852                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855              $C$DW$82        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$82, DW_AT_name("GPIO18")
     858                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO18")
     859                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0a)
     860                      .dwattr $C$DW$82, DW_AT_bit_size(0x02)
     861                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864              $C$DW$83        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$83, DW_AT_name("GPIO19")
     867                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO19")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   17

     868                      .dwattr $C$DW$83, DW_AT_bit_offset(0x08)
     869                      .dwattr $C$DW$83, DW_AT_bit_size(0x02)
     870                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     872              
     873              $C$DW$84        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$84, DW_AT_name("GPIO20")
     876                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO20")
     877                      .dwattr $C$DW$84, DW_AT_bit_offset(0x06)
     878                      .dwattr $C$DW$84, DW_AT_bit_size(0x02)
     879                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882              $C$DW$85        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$85, DW_AT_name("GPIO21")
     885                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO21")
     886                      .dwattr $C$DW$85, DW_AT_bit_offset(0x04)
     887                      .dwattr $C$DW$85, DW_AT_bit_size(0x02)
     888                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891              $C$DW$86        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$86, DW_AT_name("GPIO22")
     894                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO22")
     895                      .dwattr $C$DW$86, DW_AT_bit_offset(0x02)
     896                      .dwattr $C$DW$86, DW_AT_bit_size(0x02)
     897                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     899              
     900              $C$DW$87        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$87, DW_AT_name("GPIO23")
     903                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO23")
     904                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
     905                      .dwattr $C$DW$87, DW_AT_bit_size(0x02)
     906                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$88        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$88, DW_AT_name("GPIO24")
     912                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO24")
     913                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e)
     914                      .dwattr $C$DW$88, DW_AT_bit_size(0x02)
     915                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     916                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     917              
     918              $C$DW$89        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     920                      .dwattr $C$DW$89, DW_AT_name("GPIO25")
     921                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO25")
     922                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   18

     923                      .dwattr $C$DW$89, DW_AT_bit_size(0x02)
     924                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     925                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$90        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$90, DW_AT_name("GPIO26")
     930                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO26")
     931                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0a)
     932                      .dwattr $C$DW$90, DW_AT_bit_size(0x02)
     933                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     934                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     935              
     936              $C$DW$91        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$91, DW_AT_name("GPIO27")
     939                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO27")
     940                      .dwattr $C$DW$91, DW_AT_bit_offset(0x08)
     941                      .dwattr $C$DW$91, DW_AT_bit_size(0x02)
     942                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     943                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     944              
     945              $C$DW$92        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$92, DW_AT_name("GPIO28")
     948                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO28")
     949                      .dwattr $C$DW$92, DW_AT_bit_offset(0x06)
     950                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
     951                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     952                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954              $C$DW$93        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$93, DW_AT_name("GPIO29")
     957                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO29")
     958                      .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
     959                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
     960                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     961                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$94        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$94, DW_AT_name("GPIO30")
     966                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO30")
     967                      .dwattr $C$DW$94, DW_AT_bit_offset(0x02)
     968                      .dwattr $C$DW$94, DW_AT_bit_size(0x02)
     969                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     970                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$95        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$95, DW_AT_name("GPIO31")
     975                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO31")
     976                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00)
     977                      .dwattr $C$DW$95, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   19

     978                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     979                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981                      .dwendtag $C$DW$T$31
     982              
     983              
     984              $C$DW$T$32      .dwtag  DW_TAG_union_type
     985                      .dwattr $C$DW$T$32, DW_AT_name("GPA2_REG")
     986                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     987              $C$DW$96        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
     989                      .dwattr $C$DW$96, DW_AT_name("all")
     990                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
     991                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     993              
     994              $C$DW$97        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$31)
     996                      .dwattr $C$DW$97, DW_AT_name("bit")
     997                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
     998                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001                      .dwendtag $C$DW$T$32
    1002              
    1003              
    1004              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1005                      .dwattr $C$DW$T$33, DW_AT_name("GPACTRL2_BITS")
    1006                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1007              $C$DW$98        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$98, DW_AT_name("USB0IOEN")
    1010                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_USB0IOEN")
    1011                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0f)
    1012                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$99        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1019                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1020                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00)
    1021                      .dwattr $C$DW$99, DW_AT_bit_size(0x0f)
    1022                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1024              
    1025                      .dwendtag $C$DW$T$33
    1026              
    1027              
    1028              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1029                      .dwattr $C$DW$T$34, DW_AT_name("GPACTRL2_REG")
    1030                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1031              $C$DW$100       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   20

    1033                      .dwattr $C$DW$100, DW_AT_name("all")
    1034                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_all")
    1035                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038              $C$DW$101       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$33)
    1040                      .dwattr $C$DW$101, DW_AT_name("bit")
    1041                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bit")
    1042                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045                      .dwendtag $C$DW$T$34
    1046              
    1047              
    1048              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1049                      .dwattr $C$DW$T$35, DW_AT_name("GPACTRL_BITS")
    1050                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1051              $C$DW$102       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$102, DW_AT_name("QUALPRD0")
    1054                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_QUALPRD0")
    1055                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08)
    1056                      .dwattr $C$DW$102, DW_AT_bit_size(0x08)
    1057                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1059              
    1060              $C$DW$103       .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$103, DW_AT_name("QUALPRD1")
    1063                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_QUALPRD1")
    1064                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1065                      .dwattr $C$DW$103, DW_AT_bit_size(0x08)
    1066                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$104       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$104, DW_AT_name("QUALPRD2")
    1072                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_QUALPRD2")
    1073                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    1074                      .dwattr $C$DW$104, DW_AT_bit_size(0x08)
    1075                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1076                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078              $C$DW$105       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$105, DW_AT_name("QUALPRD3")
    1081                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_QUALPRD3")
    1082                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1083                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    1084                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1085                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087                      .dwendtag $C$DW$T$35
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   21

    1088              
    1089              
    1090              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1091                      .dwattr $C$DW$T$36, DW_AT_name("GPACTRL_REG")
    1092                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1093              $C$DW$106       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1095                      .dwattr $C$DW$106, DW_AT_name("all")
    1096                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1097                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$107       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$35)
    1102                      .dwattr $C$DW$107, DW_AT_name("bit")
    1103                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1104                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107                      .dwendtag $C$DW$T$36
    1108              
    1109              
    1110              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1111                      .dwattr $C$DW$T$37, DW_AT_name("GPADAT_BITS")
    1112                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1113              $C$DW$108       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$108, DW_AT_name("GPIO0")
    1116                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO0")
    1117                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f)
    1118                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1119                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1120                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1121              
    1122              $C$DW$109       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1124                      .dwattr $C$DW$109, DW_AT_name("GPIO1")
    1125                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO1")
    1126                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e)
    1127                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1128                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1130              
    1131              $C$DW$110       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$110, DW_AT_name("GPIO2")
    1134                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO2")
    1135                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d)
    1136                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1137                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1139              
    1140              $C$DW$111       .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$111, DW_AT_name("GPIO3")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   22

    1143                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO3")
    1144                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1145                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1146                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1148              
    1149              $C$DW$112       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$112, DW_AT_name("GPIO4")
    1152                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO4")
    1153                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b)
    1154                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1155                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$113       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$113, DW_AT_name("GPIO5")
    1161                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO5")
    1162                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    1163                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1164                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1166              
    1167              $C$DW$114       .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$114, DW_AT_name("GPIO6")
    1170                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO6")
    1171                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09)
    1172                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1173                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1175              
    1176              $C$DW$115       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$115, DW_AT_name("GPIO7")
    1179                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO7")
    1180                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08)
    1181                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$116       .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$116, DW_AT_name("GPIO8")
    1188                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO8")
    1189                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07)
    1190                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1191                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194              $C$DW$117       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$117, DW_AT_name("GPIO9")
    1197                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO9")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   23

    1198                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06)
    1199                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1200                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1202              
    1203              $C$DW$118       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$118, DW_AT_name("GPIO10")
    1206                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO10")
    1207                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05)
    1208                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1209                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1211              
    1212              $C$DW$119       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$119, DW_AT_name("GPIO11")
    1215                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO11")
    1216                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04)
    1217                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1218                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$120       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$120, DW_AT_name("GPIO12")
    1224                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO12")
    1225                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03)
    1226                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1229              
    1230              $C$DW$121       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$121, DW_AT_name("GPIO13")
    1233                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO13")
    1234                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02)
    1235                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1236                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$122       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$122, DW_AT_name("GPIO14")
    1242                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO14")
    1243                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01)
    1244                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$123       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$123, DW_AT_name("GPIO15")
    1251                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO15")
    1252                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   24

    1253                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1256              
    1257              $C$DW$124       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$124, DW_AT_name("GPIO16")
    1260                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO16")
    1261                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1262                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1264                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$125       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$125, DW_AT_name("GPIO17")
    1269                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO17")
    1270                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1271                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1273                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1274              
    1275              $C$DW$126       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$126, DW_AT_name("GPIO18")
    1278                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO18")
    1279                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1280                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1281                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1282                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$127       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$127, DW_AT_name("GPIO19")
    1287                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO19")
    1288                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1289                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1291                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293              $C$DW$128       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$128, DW_AT_name("GPIO20")
    1296                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO20")
    1297                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b)
    1298                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1299                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1300                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302              $C$DW$129       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1304                      .dwattr $C$DW$129, DW_AT_name("GPIO21")
    1305                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO21")
    1306                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a)
    1307                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   25

    1308                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1309                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$130       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$130, DW_AT_name("GPIO22")
    1314                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO22")
    1315                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09)
    1316                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1318                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$131       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$131, DW_AT_name("GPIO23")
    1323                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO23")
    1324                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    1325                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1326                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1327                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$132       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$132, DW_AT_name("GPIO24")
    1332                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO24")
    1333                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07)
    1334                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1335                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1336                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1337              
    1338              $C$DW$133       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$133, DW_AT_name("GPIO25")
    1341                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO25")
    1342                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06)
    1343                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1344                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1345                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1346              
    1347              $C$DW$134       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$134, DW_AT_name("GPIO26")
    1350                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO26")
    1351                      .dwattr $C$DW$134, DW_AT_bit_offset(0x05)
    1352                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1353                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$135       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$135, DW_AT_name("GPIO27")
    1359                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO27")
    1360                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04)
    1361                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1362                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   26

    1363                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1364              
    1365              $C$DW$136       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1367                      .dwattr $C$DW$136, DW_AT_name("GPIO28")
    1368                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO28")
    1369                      .dwattr $C$DW$136, DW_AT_bit_offset(0x03)
    1370                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1371                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1372                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$137       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1376                      .dwattr $C$DW$137, DW_AT_name("GPIO29")
    1377                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO29")
    1378                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02)
    1379                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1380                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1381                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1382              
    1383              $C$DW$138       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$138, DW_AT_name("GPIO30")
    1386                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO30")
    1387                      .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    1388                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1389                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1390                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$139       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$139, DW_AT_name("GPIO31")
    1395                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO31")
    1396                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1397                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1398                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1399                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401                      .dwendtag $C$DW$T$37
    1402              
    1403              
    1404              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1405                      .dwattr $C$DW$T$38, DW_AT_name("GPADAT_REG")
    1406                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1407              $C$DW$140       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1409                      .dwattr $C$DW$140, DW_AT_name("all")
    1410                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1411                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414              $C$DW$141       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$37)
    1416                      .dwattr $C$DW$141, DW_AT_name("bit")
    1417                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.6 Tue Apr 10 14:49:16 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initMCU.asm                                                          PAGE   27

