TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sat May 05 23:40:04 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../source/initFSM.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\MessmerDL1\Documents\ccs_workspace\InputCaptureProject_1\D
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     272                      .dwattr $C$DW$15, DW_AT_TI_return
     273              
     274 00000078 0006          LRETR     ; [CPU_] 
     275                      ; return occurs ; [] 
     276                      .dwattr $C$DW$11, DW_AT_TI_end_file("../source/initFSM.c")
     277                      .dwattr $C$DW$11, DW_AT_TI_end_line(0x56)
     278                      .dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
     279                      .dwendentry
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE    7

     280                      .dwendtag $C$DW$11
     281              
     282 00000079               .sect   ".text"
     283                      .clink
     284                      .global _initFSM
     285              
     286              $C$DW$16        .dwtag  DW_TAG_subprogram
     287                      .dwattr $C$DW$16, DW_AT_name("initFSM")
     288                      .dwattr $C$DW$16, DW_AT_low_pc(_initFSM)
     289                      .dwattr $C$DW$16, DW_AT_high_pc(0x00)
     290                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_initFSM")
     291                      .dwattr $C$DW$16, DW_AT_external
     292                      .dwattr $C$DW$16, DW_AT_TI_begin_file("../source/initFSM.c")
     293                      .dwattr $C$DW$16, DW_AT_TI_begin_line(0x24)
     294                      .dwattr $C$DW$16, DW_AT_TI_begin_column(0x06)
     295                      .dwattr $C$DW$16, DW_AT_TI_max_frame_size(-2)
     296                      .dwpsn  file "../source/initFSM.c",line 37,column 1,is_stmt,address _initFSM,isa 0
     297              
     298                      .dwfde $C$DW$CIE, _initFSM
     299              
     300              ;***************************************************************
     301              ;* FNAME: _initFSM                      FR SIZE:   0           *
     302              ;*                                                             *
     303              ;* FUNCTION ENVIRONMENT                                        *
     304              ;*                                                             *
     305              ;* FUNCTION PROPERTIES                                         *
     306              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     307              ;***************************************************************
     308              
     309 00000079       _initFSM:
     310                      .dwcfi  cfa_offset, -2
     311                      .dwcfi  save_reg_to_mem, 26, 0
     312                      .dwpsn  file "../source/initFSM.c",line 38,column 5,is_stmt,isa 0
     313 00000079 8F00-         MOVL      XAR4,#_fsm            ; [CPU_U] |38| 
         0000007a 0002 
     314 0000007b 761F-         MOVW      DP,#_CurrentState     ; [CPU_U] 
         0000007c 0000 
     315 0000007d A800-         MOVL      @_CurrentState,XAR4   ; [CPU_] |38| 
     316                      .dwpsn  file "../source/initFSM.c",line 39,column 5,is_stmt,isa 0
     317              $C$DW$17        .dwtag  DW_TAG_TI_branch
     318                      .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     319                      .dwattr $C$DW$17, DW_AT_name("_setOutputs")
     320                      .dwattr $C$DW$17, DW_AT_TI_call
     321              
     322 0000007e 7640'         LCR       #_setOutputs          ; [CPU_] |39| 
         0000007f 0000 
     323                      ; call occurs [#_setOutputs] ; [] |39| 
     324              $C$DW$18        .dwtag  DW_TAG_TI_branch
     325                      .dwattr $C$DW$18, DW_AT_low_pc(0x00)
     326                      .dwattr $C$DW$18, DW_AT_TI_return
     327              
     328 00000080 0006          LRETR     ; [CPU_] 
     329                      ; return occurs ; [] 
     330                      .dwattr $C$DW$16, DW_AT_TI_end_file("../source/initFSM.c")
     331                      .dwattr $C$DW$16, DW_AT_TI_end_line(0x28)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE    8

     332                      .dwattr $C$DW$16, DW_AT_TI_end_column(0x01)
     333                      .dwendentry
     334                      .dwendtag $C$DW$16
     335              
     336              ;**************************************************************
     337              ;* UNDEFINED EXTERNAL REFERENCES                              *
     338              ;**************************************************************
     339                      .global _Fail
     340                      .global _distance
     341                      .global _ceil
     342                      .global _floor
     343                      .global _CpuTimer1Regs
     344                      .global _GpioDataRegs
     345              
     346              ;***************************************************************
     347              ;* TYPE INFORMATION                                            *
     348              ;***************************************************************
     349              
     350              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     351                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     352                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     353              $C$DW$19        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     355                      .dwattr $C$DW$19, DW_AT_name("rsvd1")
     356                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd1")
     357                      .dwattr $C$DW$19, DW_AT_bit_offset(0x0f)
     358                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     359                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$20        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$20, DW_AT_name("rsvd2")
     365                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd2")
     366                      .dwattr $C$DW$20, DW_AT_bit_offset(0x0e)
     367                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     368                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     370              
     371              $C$DW$21        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     373                      .dwattr $C$DW$21, DW_AT_name("AIO2")
     374                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_AIO2")
     375                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0d)
     376                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     377                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     378                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     379              
     380              $C$DW$22        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     382                      .dwattr $C$DW$22, DW_AT_name("rsvd3")
     383                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_rsvd3")
     384                      .dwattr $C$DW$22, DW_AT_bit_offset(0x0c)
     385                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     386                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE    9

     387                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389              $C$DW$23        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     391                      .dwattr $C$DW$23, DW_AT_name("AIO4")
     392                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_AIO4")
     393                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0b)
     394                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     395                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     396                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     397              
     398              $C$DW$24        .dwtag  DW_TAG_member
     399                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     400                      .dwattr $C$DW$24, DW_AT_name("rsvd4")
     401                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd4")
     402                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0a)
     403                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     404                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     405                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     406              
     407              $C$DW$25        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     409                      .dwattr $C$DW$25, DW_AT_name("AIO6")
     410                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_AIO6")
     411                      .dwattr $C$DW$25, DW_AT_bit_offset(0x09)
     412                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     413                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     414                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     415              
     416              $C$DW$26        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     418                      .dwattr $C$DW$26, DW_AT_name("rsvd5")
     419                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd5")
     420                      .dwattr $C$DW$26, DW_AT_bit_offset(0x08)
     421                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     422                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     423                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     424              
     425              $C$DW$27        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     427                      .dwattr $C$DW$27, DW_AT_name("rsvd6")
     428                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd6")
     429                      .dwattr $C$DW$27, DW_AT_bit_offset(0x07)
     430                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     431                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     432                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     433              
     434              $C$DW$28        .dwtag  DW_TAG_member
     435                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     436                      .dwattr $C$DW$28, DW_AT_name("rsvd7")
     437                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd7")
     438                      .dwattr $C$DW$28, DW_AT_bit_offset(0x06)
     439                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     440                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     441                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   10

     442              
     443              $C$DW$29        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     445                      .dwattr $C$DW$29, DW_AT_name("AIO10")
     446                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_AIO10")
     447                      .dwattr $C$DW$29, DW_AT_bit_offset(0x05)
     448                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     449                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452              $C$DW$30        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$30, DW_AT_name("rsvd8")
     455                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd8")
     456                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     457                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     458                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     460              
     461              $C$DW$31        .dwtag  DW_TAG_member
     462                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     463                      .dwattr $C$DW$31, DW_AT_name("AIO12")
     464                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_AIO12")
     465                      .dwattr $C$DW$31, DW_AT_bit_offset(0x03)
     466                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     467                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     468                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     469              
     470              $C$DW$32        .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     472                      .dwattr $C$DW$32, DW_AT_name("rsvd9")
     473                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd9")
     474                      .dwattr $C$DW$32, DW_AT_bit_offset(0x02)
     475                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     476                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     477                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     478              
     479              $C$DW$33        .dwtag  DW_TAG_member
     480                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     481                      .dwattr $C$DW$33, DW_AT_name("AIO14")
     482                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_AIO14")
     483                      .dwattr $C$DW$33, DW_AT_bit_offset(0x01)
     484                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     485                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     486                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     487              
     488              $C$DW$34        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     490                      .dwattr $C$DW$34, DW_AT_name("rsvd10")
     491                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd10")
     492                      .dwattr $C$DW$34, DW_AT_bit_offset(0x00)
     493                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     494                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     495                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     496              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   11

     497              $C$DW$35        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     499                      .dwattr $C$DW$35, DW_AT_name("rsvd11")
     500                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd11")
     501                      .dwattr $C$DW$35, DW_AT_bit_offset(0x00)
     502                      .dwattr $C$DW$35, DW_AT_bit_size(0x10)
     503                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     504                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     505              
     506                      .dwendtag $C$DW$T$20
     507              
     508              
     509              $C$DW$T$22      .dwtag  DW_TAG_union_type
     510                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     511                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     512              $C$DW$36        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$21)
     514                      .dwattr $C$DW$36, DW_AT_name("all")
     515                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_all")
     516                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     517                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     518              
     519              $C$DW$37        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
     521                      .dwattr $C$DW$37, DW_AT_name("bit")
     522                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_bit")
     523                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     525              
     526                      .dwendtag $C$DW$T$22
     527              
     528              
     529              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     530                      .dwattr $C$DW$T$23, DW_AT_name("CPUTIMER_REGS")
     531                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
     532              $C$DW$38        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$37)
     534                      .dwattr $C$DW$38, DW_AT_name("TIM")
     535                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_TIM")
     536                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     538              
     539              $C$DW$39        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$30)
     541                      .dwattr $C$DW$39, DW_AT_name("PRD")
     542                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_PRD")
     543                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     544                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     545              
     546              $C$DW$40        .dwtag  DW_TAG_member
     547                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$36)
     548                      .dwattr $C$DW$40, DW_AT_name("TCR")
     549                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_TCR")
     550                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     551                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   12

     552              
     553              $C$DW$41        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     555                      .dwattr $C$DW$41, DW_AT_name("rsvd1")
     556                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd1")
     557                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     558                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     559              
     560              $C$DW$42        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$42)
     562                      .dwattr $C$DW$42, DW_AT_name("TPR")
     563                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_TPR")
     564                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     565                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567              $C$DW$43        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$40)
     569                      .dwattr $C$DW$43, DW_AT_name("TPRH")
     570                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_TPRH")
     571                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     572                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574                      .dwendtag $C$DW$T$23
     575              
     576              $C$DW$44        .dwtag  DW_TAG_TI_far_type
     577                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     578              
     579              $C$DW$T$43      .dwtag  DW_TAG_volatile_type
     580                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$44)
     581              
     582              
     583              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     584                      .dwattr $C$DW$T$24, DW_AT_name("GPADAT_BITS")
     585                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     586              $C$DW$45        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$45, DW_AT_name("GPIO0")
     589                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO0")
     590                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0f)
     591                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     592                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     594              
     595              $C$DW$46        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$46, DW_AT_name("GPIO1")
     598                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO1")
     599                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0e)
     600                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     603              
     604              $C$DW$47        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     606                      .dwattr $C$DW$47, DW_AT_name("GPIO2")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   13

     607                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO2")
     608                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0d)
     609                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$48        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$48, DW_AT_name("GPIO3")
     616                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO3")
     617                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c)
     618                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     619                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     621              
     622              $C$DW$49        .dwtag  DW_TAG_member
     623                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     624                      .dwattr $C$DW$49, DW_AT_name("GPIO4")
     625                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO4")
     626                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0b)
     627                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     628                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     630              
     631              $C$DW$50        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$50, DW_AT_name("GPIO5")
     634                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO5")
     635                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a)
     636                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     637                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$51        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$51, DW_AT_name("GPIO6")
     643                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO6")
     644                      .dwattr $C$DW$51, DW_AT_bit_offset(0x09)
     645                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     646                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     647                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     648              
     649              $C$DW$52        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     651                      .dwattr $C$DW$52, DW_AT_name("GPIO7")
     652                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO7")
     653                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     654                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     655                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     656                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     657              
     658              $C$DW$53        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     660                      .dwattr $C$DW$53, DW_AT_name("GPIO8")
     661                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO8")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   14

     662                      .dwattr $C$DW$53, DW_AT_bit_offset(0x07)
     663                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     664                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     666              
     667              $C$DW$54        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$54, DW_AT_name("GPIO9")
     670                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO9")
     671                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06)
     672                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     673                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$55        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$55, DW_AT_name("GPIO10")
     679                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO10")
     680                      .dwattr $C$DW$55, DW_AT_bit_offset(0x05)
     681                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685              $C$DW$56        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$56, DW_AT_name("GPIO11")
     688                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO11")
     689                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
     690                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     691                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$57        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$57, DW_AT_name("GPIO12")
     697                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO12")
     698                      .dwattr $C$DW$57, DW_AT_bit_offset(0x03)
     699                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     700                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     701                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     702              
     703              $C$DW$58        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     705                      .dwattr $C$DW$58, DW_AT_name("GPIO13")
     706                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO13")
     707                      .dwattr $C$DW$58, DW_AT_bit_offset(0x02)
     708                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     709                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712              $C$DW$59        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$59, DW_AT_name("GPIO14")
     715                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO14")
     716                      .dwattr $C$DW$59, DW_AT_bit_offset(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   15

     717                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     718                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$60        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$60, DW_AT_name("GPIO15")
     724                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO15")
     725                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00)
     726                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     727                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     729              
     730              $C$DW$61        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$61, DW_AT_name("GPIO16")
     733                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO16")
     734                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f)
     735                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     736                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     737                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     738              
     739              $C$DW$62        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$62, DW_AT_name("GPIO17")
     742                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO17")
     743                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e)
     744                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     745                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     746                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     747              
     748              $C$DW$63        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$63, DW_AT_name("GPIO18")
     751                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO18")
     752                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0d)
     753                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     754                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     755                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     756              
     757              $C$DW$64        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$64, DW_AT_name("GPIO19")
     760                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO19")
     761                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     762                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     763                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     764                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$65        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$65, DW_AT_name("GPIO20")
     769                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO20")
     770                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0b)
     771                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   16

     772                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     773                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     774              
     775              $C$DW$66        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$66, DW_AT_name("GPIO21")
     778                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO21")
     779                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0a)
     780                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     781                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     782                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784              $C$DW$67        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$67, DW_AT_name("GPIO22")
     787                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO22")
     788                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09)
     789                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     790                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     791                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     792              
     793              $C$DW$68        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$68, DW_AT_name("GPIO23")
     796                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO23")
     797                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08)
     798                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     799                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     800                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     801              
     802              $C$DW$69        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$69, DW_AT_name("GPIO24")
     805                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO24")
     806                      .dwattr $C$DW$69, DW_AT_bit_offset(0x07)
     807                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     808                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     809                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$70        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$70, DW_AT_name("GPIO25")
     814                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO25")
     815                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06)
     816                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     818                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     819              
     820              $C$DW$71        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$71, DW_AT_name("GPIO26")
     823                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO26")
     824                      .dwattr $C$DW$71, DW_AT_bit_offset(0x05)
     825                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     826                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   17

     827                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829              $C$DW$72        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$72, DW_AT_name("GPIO27")
     832                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO27")
     833                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
     834                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     836                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$73        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$73, DW_AT_name("GPIO28")
     841                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO28")
     842                      .dwattr $C$DW$73, DW_AT_bit_offset(0x03)
     843                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     845                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     846              
     847              $C$DW$74        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$74, DW_AT_name("GPIO29")
     850                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO29")
     851                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02)
     852                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     854                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$75        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$75, DW_AT_name("GPIO30")
     859                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO30")
     860                      .dwattr $C$DW$75, DW_AT_bit_offset(0x01)
     861                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     862                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     863                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$76        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$76, DW_AT_name("GPIO31")
     868                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO31")
     869                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     870                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     872                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874                      .dwendtag $C$DW$T$24
     875              
     876              
     877              $C$DW$T$25      .dwtag  DW_TAG_union_type
     878                      .dwattr $C$DW$T$25, DW_AT_name("GPADAT_REG")
     879                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     880              $C$DW$77        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   18

     882                      .dwattr $C$DW$77, DW_AT_name("all")
     883                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     884                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     886              
     887              $C$DW$78        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$24)
     889                      .dwattr $C$DW$78, DW_AT_name("bit")
     890                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     891                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     893              
     894                      .dwendtag $C$DW$T$25
     895              
     896              
     897              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     898                      .dwattr $C$DW$T$26, DW_AT_name("GPBDAT_BITS")
     899                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     900              $C$DW$79        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$79, DW_AT_name("GPIO32")
     903                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO32")
     904                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f)
     905                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     906                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$80        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$80, DW_AT_name("GPIO33")
     912                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO33")
     913                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e)
     914                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     915                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     917              
     918              $C$DW$81        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     920                      .dwattr $C$DW$81, DW_AT_name("GPIO34")
     921                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO34")
     922                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d)
     923                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     924                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     925                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$82        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$82, DW_AT_name("GPIO35")
     930                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO35")
     931                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c)
     932                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     935              
     936              $C$DW$83        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   19

     937                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$83, DW_AT_name("GPIO36")
     939                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO36")
     940                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b)
     941                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     942                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     944              
     945              $C$DW$84        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$84, DW_AT_name("GPIO37")
     948                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO37")
     949                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a)
     950                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     951                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954              $C$DW$85        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$85, DW_AT_name("GPIO38")
     957                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO38")
     958                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09)
     959                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$86        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$86, DW_AT_name("GPIO39")
     966                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO39")
     967                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08)
     968                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     969                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$87        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$87, DW_AT_name("GPIO40")
     975                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO40")
     976                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
     977                      .dwattr $C$DW$87, DW_AT_bit_size(0x01)
     978                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981              $C$DW$88        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$88, DW_AT_name("GPIO41")
     984                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO41")
     985                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06)
     986                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990              $C$DW$89        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   20

     992                      .dwattr $C$DW$89, DW_AT_name("GPIO42")
     993                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO42")
     994                      .dwattr $C$DW$89, DW_AT_bit_offset(0x05)
     995                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     996                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     998              
     999              $C$DW$90        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$90, DW_AT_name("GPIO43")
    1002                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO43")
    1003                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04)
    1004                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1005                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$91        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$91, DW_AT_name("GPIO44")
    1011                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO44")
    1012                      .dwattr $C$DW$91, DW_AT_bit_offset(0x03)
    1013                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$92        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    1020                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    1021                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1022                      .dwattr $C$DW$92, DW_AT_bit_size(0x03)
    1023                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$93        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$93, DW_AT_name("rsvd2")
    1029                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd2")
    1030                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e)
    1031                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1032                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1033                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$94        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$94, DW_AT_name("GPIO50")
    1038                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO50")
    1039                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d)
    1040                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1042                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044              $C$DW$95        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1046                      .dwattr $C$DW$95, DW_AT_name("GPIO51")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   21

    1047                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO51")
    1048                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0c)
    1049                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1051                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$96        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$96, DW_AT_name("GPIO52")
    1056                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO52")
    1057                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0b)
    1058                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1060                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$97        .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$97, DW_AT_name("GPIO53")
    1065                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO53")
    1066                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a)
    1067                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1068                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1069                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1070              
    1071              $C$DW$98        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$98, DW_AT_name("GPIO54")
    1074                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO54")
    1075                      .dwattr $C$DW$98, DW_AT_bit_offset(0x09)
    1076                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1078                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$99        .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$99, DW_AT_name("GPIO55")
    1083                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO55")
    1084                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1085                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1086                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1087                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$100       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$100, DW_AT_name("GPIO56")
    1092                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO56")
    1093                      .dwattr $C$DW$100, DW_AT_bit_offset(0x07)
    1094                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1095                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1096                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1097              
    1098              $C$DW$101       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$101, DW_AT_name("GPIO57")
    1101                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO57")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   22

    1102                      .dwattr $C$DW$101, DW_AT_bit_offset(0x06)
    1103                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1105                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1106              
    1107              $C$DW$102       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1109                      .dwattr $C$DW$102, DW_AT_name("GPIO58")
    1110                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO58")
    1111                      .dwattr $C$DW$102, DW_AT_bit_offset(0x05)
    1112                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1113                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1114                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116              $C$DW$103       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1118                      .dwattr $C$DW$103, DW_AT_name("rsvd3")
    1119                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd3")
    1120                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1121                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    1122                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1123                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1124              
    1125                      .dwendtag $C$DW$T$26
    1126              
    1127              
    1128              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1129                      .dwattr $C$DW$T$27, DW_AT_name("GPBDAT_REG")
    1130                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1131              $C$DW$104       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1133                      .dwattr $C$DW$104, DW_AT_name("all")
    1134                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1135                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1137              
    1138              $C$DW$105       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$26)
    1140                      .dwattr $C$DW$105, DW_AT_name("bit")
    1141                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1142                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145                      .dwendtag $C$DW$T$27
    1146              
    1147              
    1148              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1149                      .dwattr $C$DW$T$29, DW_AT_name("GPIO_DATA_REGS")
    1150                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x20)
    1151              $C$DW$106       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$25)
    1153                      .dwattr $C$DW$106, DW_AT_name("GPADAT")
    1154                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPADAT")
    1155                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   23

    1157              
    1158              $C$DW$107       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1160                      .dwattr $C$DW$107, DW_AT_name("GPASET")
    1161                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPASET")
    1162                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1163                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$108       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$25)
    1167                      .dwattr $C$DW$108, DW_AT_name("GPACLEAR")
    1168                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPACLEAR")
    1169                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1170                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$109       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$25)
    1174                      .dwattr $C$DW$109, DW_AT_name("GPATOGGLE")
    1175                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPATOGGLE")
    1176                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1177                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$110       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$27)
    1181                      .dwattr $C$DW$110, DW_AT_name("GPBDAT")
    1182                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPBDAT")
    1183                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1184                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$111       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$27)
    1188                      .dwattr $C$DW$111, DW_AT_name("GPBSET")
    1189                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPBSET")
    1190                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1191                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$112       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$27)
    1195                      .dwattr $C$DW$112, DW_AT_name("GPBCLEAR")
    1196                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPBCLEAR")
    1197                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1198                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$113       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    1202                      .dwattr $C$DW$113, DW_AT_name("GPBTOGGLE")
    1203                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1204                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1205                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$114       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$28)
    1209                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1210                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    1211                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   24

    1212                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$115       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1216                      .dwattr $C$DW$115, DW_AT_name("AIODAT")
    1217                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_AIODAT")
    1218                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1219                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$116       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
    1223                      .dwattr $C$DW$116, DW_AT_name("AIOSET")
    1224                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_AIOSET")
    1225                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1226                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1227              
    1228              $C$DW$117       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$22)
    1230                      .dwattr $C$DW$117, DW_AT_name("AIOCLEAR")
    1231                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_AIOCLEAR")
    1232                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1233                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$118       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$22)
    1237                      .dwattr $C$DW$118, DW_AT_name("AIOTOGGLE")
    1238                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1239                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1240                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242                      .dwendtag $C$DW$T$29
    1243              
    1244              $C$DW$119       .dwtag  DW_TAG_TI_far_type
    1245                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$29)
    1246              
    1247              $C$DW$T$49      .dwtag  DW_TAG_volatile_type
    1248                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$119)
    1249              
    1250              
    1251              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1252                      .dwattr $C$DW$T$30, DW_AT_name("PRD_GROUP")
    1253                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1254              $C$DW$120       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    1256                      .dwattr $C$DW$120, DW_AT_name("all")
    1257                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1258                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1260              
    1261              $C$DW$121       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$31)
    1263                      .dwattr $C$DW$121, DW_AT_name("half")
    1264                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_half")
    1265                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   25

    1267              
    1268                      .dwendtag $C$DW$T$30
    1269              
    1270              
    1271              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1272                      .dwattr $C$DW$T$31, DW_AT_name("PRD_REG")
    1273                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1274              $C$DW$122       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$122, DW_AT_name("LSW")
    1277                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_LSW")
    1278                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$123       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$123, DW_AT_name("MSW")
    1284                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_MSW")
    1285                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1286                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288                      .dwendtag $C$DW$T$31
    1289              
    1290              
    1291              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1292                      .dwattr $C$DW$T$34, DW_AT_name("State")
    1293                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    1294              $C$DW$124       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$33)
    1296                      .dwattr $C$DW$124, DW_AT_name("Next")
    1297                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Next")
    1298                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1300              
    1301                      .dwendtag $C$DW$T$34
    1302              
    1303              $C$DW$T$53      .dwtag  DW_TAG_typedef
    1304                      .dwattr $C$DW$T$53, DW_AT_name("StateType")
    1305                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$34)
    1306                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1307              
    1308              
    1309              $C$DW$T$54      .dwtag  DW_TAG_array_type
    1310                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1311                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1312                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
    1313              $C$DW$125       .dwtag  DW_TAG_subrange_type
    1314                      .dwattr $C$DW$125, DW_AT_upper_bound(0x02)
    1315              
    1316                      .dwendtag $C$DW$T$54
    1317              
    1318              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1319                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    1320                      .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    1321              
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   26

    1322              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1323                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$34)
    1324                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    1325              
    1326              
    1327              $C$DW$T$33      .dwtag  DW_TAG_array_type
    1328                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1329                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1330                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    1331              $C$DW$126       .dwtag  DW_TAG_subrange_type
    1332                      .dwattr $C$DW$126, DW_AT_upper_bound(0x01)
    1333              
    1334                      .dwendtag $C$DW$T$33
    1335              
    1336              
    1337              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1338                      .dwattr $C$DW$T$35, DW_AT_name("TCR_BITS")
    1339                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1340              $C$DW$127       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$127, DW_AT_name("rsvd1")
    1343                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd1")
    1344                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
    1345                      .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    1346                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1348              
    1349              $C$DW$128       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$128, DW_AT_name("TSS")
    1352                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_TSS")
    1353                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b)
    1354                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1355                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1357              
    1358              $C$DW$129       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1360                      .dwattr $C$DW$129, DW_AT_name("TRB")
    1361                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_TRB")
    1362                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a)
    1363                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1364                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$130       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    1370                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    1371                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06)
    1372                      .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1373                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1375              
    1376              $C$DW$131       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   27

    1377                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$131, DW_AT_name("SOFT")
    1379                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SOFT")
    1380                      .dwattr $C$DW$131, DW_AT_bit_offset(0x05)
    1381                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$132       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$132, DW_AT_name("FREE")
    1388                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_FREE")
    1389                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    1390                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1391                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$133       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1396                      .dwattr $C$DW$133, DW_AT_name("rsvd3")
    1397                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd3")
    1398                      .dwattr $C$DW$133, DW_AT_bit_offset(0x02)
    1399                      .dwattr $C$DW$133, DW_AT_bit_size(0x02)
    1400                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1402              
    1403              $C$DW$134       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$134, DW_AT_name("TIE")
    1406                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_TIE")
    1407                      .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    1408                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$135       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$135, DW_AT_name("TIF")
    1415                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_TIF")
    1416                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1417                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1418                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1420              
    1421                      .dwendtag $C$DW$T$35
    1422              
    1423              
    1424              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1425                      .dwattr $C$DW$T$36, DW_AT_name("TCR_REG")
    1426                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1427              $C$DW$136       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$136, DW_AT_name("all")
    1430                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1431                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   28

    1432                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1433              
    1434              $C$DW$137       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$35)
    1436                      .dwattr $C$DW$137, DW_AT_name("bit")
    1437                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1438                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441                      .dwendtag $C$DW$T$36
    1442              
    1443              
    1444              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1445                      .dwattr $C$DW$T$37, DW_AT_name("TIM_GROUP")
    1446                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1447              $C$DW$138       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1449                      .dwattr $C$DW$138, DW_AT_name("all")
    1450                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1451                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$139       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$38)
    1456                      .dwattr $C$DW$139, DW_AT_name("half")
    1457                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_half")
    1458                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461                      .dwendtag $C$DW$T$37
    1462              
    1463              
    1464              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1465                      .dwattr $C$DW$T$38, DW_AT_name("TIM_REG")
    1466                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1467              $C$DW$140       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$140, DW_AT_name("LSW")
    1470                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_LSW")
    1471                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474              $C$DW$141       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1476                      .dwattr $C$DW$141, DW_AT_name("MSW")
    1477                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_MSW")
    1478                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1479                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1480              
    1481                      .dwendtag $C$DW$T$38
    1482              
    1483              
    1484              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1485                      .dwattr $C$DW$T$39, DW_AT_name("TPRH_BITS")
    1486                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   29

    1487              $C$DW$142       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1489                      .dwattr $C$DW$142, DW_AT_name("TDDRH")
    1490                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_TDDRH")
    1491                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08)
    1492                      .dwattr $C$DW$142, DW_AT_bit_size(0x08)
    1493                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$143       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$143, DW_AT_name("PSCH")
    1499                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PSCH")
    1500                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    1501                      .dwattr $C$DW$143, DW_AT_bit_size(0x08)
    1502                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505                      .dwendtag $C$DW$T$39
    1506              
    1507              
    1508              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1509                      .dwattr $C$DW$T$40, DW_AT_name("TPRH_REG")
    1510                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1511              $C$DW$144       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$144, DW_AT_name("all")
    1514                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    1515                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1517              
    1518              $C$DW$145       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$39)
    1520                      .dwattr $C$DW$145, DW_AT_name("bit")
    1521                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_bit")
    1522                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1524              
    1525                      .dwendtag $C$DW$T$40
    1526              
    1527              
    1528              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1529                      .dwattr $C$DW$T$41, DW_AT_name("TPR_BITS")
    1530                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1531              $C$DW$146       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$146, DW_AT_name("TDDR")
    1534                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_TDDR")
    1535                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08)
    1536                      .dwattr $C$DW$146, DW_AT_bit_size(0x08)
    1537                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1539              
    1540              $C$DW$147       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   30

    1542                      .dwattr $C$DW$147, DW_AT_name("PSC")
    1543                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PSC")
    1544                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    1545                      .dwattr $C$DW$147, DW_AT_bit_size(0x08)
    1546                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549                      .dwendtag $C$DW$T$41
    1550              
    1551              
    1552              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1553                      .dwattr $C$DW$T$42, DW_AT_name("TPR_REG")
    1554                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1555              $C$DW$148       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$148, DW_AT_name("all")
    1558                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    1559                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1561              
    1562              $C$DW$149       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$41)
    1564                      .dwattr $C$DW$149, DW_AT_name("bit")
    1565                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    1566                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569                      .dwendtag $C$DW$T$42
    1570              
    1571              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1572                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1573              
    1574              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1575                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1576                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1577                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1578              
    1579              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1580                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1581                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1582                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1583              
    1584              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1585                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1586                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1587                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1588              
    1589              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1590                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1591                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1592                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1593              
    1594              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1595                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1596                      .dwattr $C$DW$T$8, DW_AT_name("short")
TMS320C2000 Assembler PC v16.9.6 Sat May 05 23:40:04 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
initFSM.asm                                                          PAGE   31

    1597                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1598              
    1599              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1600                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1601                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1602                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1603              
    1604              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1605                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1606                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1607                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1608              
    1609              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1610                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1611                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1612                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1613              
    1614              $C$DW$T$19      .dwtag  DW_TAG_typedef
    1615                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
    1616                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1617                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1618              
    1619              
    1620              $C$DW$T$28      .dwtag  DW_TAG_array_type
    1621                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$19)
    1622                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1623                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1624              $C$DW$150       .dwtag  DW_TAG_subrange_type
    1625                      .dwattr $C$DW$150, DW_AT_upper_bound(0x07)
    1626              
    1627                      .dwendtag $C$DW$T$28
    1628              
