TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Sat Mar 11 21:51:20 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../initClock.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Lawrence\Google Drive\workspace_v7\SeventhProject\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SysCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SysCtrlRegs")

      34                      .dwattr $C$DW$2, DW_AT_TI_begin_column(0x06)
      35                      .dwattr $C$DW$2, DW_AT_TI_max_frame_size(-2)
      36                      .dwpsn  file "../initClock.c",line 11,column 1,is_stmt,address _initClock,isa 0
      37              
      38                      .dwfde $C$DW$CIE, _initClock
      39              
      40              ;***************************************************************
      41              ;* FNAME: _initClock                    FR SIZE:   0           *
      42              ;*                                                             *
      43              ;* FUNCTION ENVIRONMENT                                        *
      44              ;*                                                             *
      45              ;* FUNCTION PROPERTIES                                         *
      46              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      47              ;***************************************************************
      48              
      49 00000000       _initClock:
      50              ;* AR5   assigned to $O$C1
      51                      .dwcfi  cfa_offset, -2
      52                      .dwcfi  save_reg_to_mem, 26, 0
      53 00000000 7622   EALLOW
      54                      .dwpsn  file "../initClock.c",line 13,column 5,is_stmt,isa 0
      55 00000001 8F40!         MOVL      XAR5,#_SysCtrlRegs    ; [CPU_U] |13| 
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    2

         00000002 0000 
      56 00000003 8AA5          MOVL      XAR4,XAR5             ; [CPU_] |13| 
      57                      .dwpsn  file "../initClock.c",line 14,column 5,is_stmt,isa 0
      58 00000004 D011          MOVB      XAR0,#17              ; [CPU_] |14| 
      59 00000005 761F!         MOVW      DP,#_SysCtrlRegs+17   ; [CPU_U] 
         00000006 0000 
      60                      .dwpsn  file "../initClock.c",line 13,column 5,is_stmt,isa 0
      61 00000007 DC01          ADDB      XAR4,#1               ; [CPU_] |13| 
      62 00000008 1AC4          OR        *+XAR4[0],#0x0040     ; [CPU_] |13| 
         00000009 0040 
      63                      .dwpsn  file "../initClock.c",line 14,column 5,is_stmt,isa 0
      64 0000000a CC95          AND       AL,*+XAR5[AR0],#0xffe0 ; [CPU_] |14| 
         0000000b FFE0 
      65 0000000c 5004          ORB       AL,#0x04              ; [CPU_] |14| 
      66 0000000d 9611!         MOV       @_SysCtrlRegs+17,AL   ; [CPU_] |14| 
      67 0000000e       $C$L1:    
      68                      .dwpsn  file "../initClock.c",line 15,column 11,is_stmt,isa 0
      69 0000000e 4001!         TBIT      @_SysCtrlRegs+1,#0    ; [CPU_] |15| 
      70 0000000f 6CFF          B         $C$L1,NTC             ; [CPU_] |15| 
      71                      ; branchcc occurs ; [] |15| 
      72                      .dwpsn  file "../initClock.c",line 16,column 5,is_stmt,isa 0
      73 00000010 1801!         AND       @_SysCtrlRegs+1,#0xffbf ; [CPU_] |16| 
         00000011 FFBF 
      74                      .dwpsn  file "../initClock.c",line 17,column 5,is_stmt,isa 0
      75 00000012 1A01!         OR        @_SysCtrlRegs+1,#0x0180 ; [CPU_] |17| 
         00000013 0180 
      76                      .dwpsn  file "../initClock.c",line 18,column 5,is_stmt,isa 0
      77 00000014 CC00!         AND       AL,@_SysCtrlRegs,#0xfffe ; [CPU_] |18| 
         00000015 FFFE 
      78 00000016 5002          ORB       AL,#0x02              ; [CPU_] |18| 
      79 00000017 9600!         MOV       @_SysCtrlRegs,AL      ; [CPU_] |18| 
      80 00000018 761A   EDIS
      81 00000019 FF69          SPM       #0                    ; [CPU_] 
      82              $C$DW$3 .dwtag  DW_TAG_TI_branch
      83                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
      84                      .dwattr $C$DW$3, DW_AT_TI_return
      85              
      86 0000001a 0006          LRETR     ; [CPU_] 
      87                      ; return occurs ; [] 
      88                      .dwattr $C$DW$2, DW_AT_TI_end_file("../initClock.c")
      89                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x14)
      90                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
      91                      .dwendentry
      92                      .dwendtag $C$DW$2
      93              
      94              ;**************************************************************
      95              ;* UNDEFINED EXTERNAL REFERENCES                              *
      96              ;**************************************************************
      97                      .global _SysCtrlRegs
      98              
      99              ;***************************************************************
     100              ;* TYPE INFORMATION                                            *
     101              ;***************************************************************
     102              
     103              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    3

     104                      .dwattr $C$DW$T$20, DW_AT_name("CLKCTL_BITS")
     105                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     106              $C$DW$4 .dwtag  DW_TAG_member
     107                      .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$19)
     108                      .dwattr $C$DW$4, DW_AT_name("OSCCLKSRCSEL")
     109                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     110                      .dwattr $C$DW$4, DW_AT_bit_offset(0x0f)
     111                      .dwattr $C$DW$4, DW_AT_bit_size(0x01)
     112                      .dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     113                      .dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)
     114              
     115              $C$DW$5 .dwtag  DW_TAG_member
     116                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     117                      .dwattr $C$DW$5, DW_AT_name("OSCCLKSRC2SEL")
     118                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_OSCCLKSRC2SEL")
     119                      .dwattr $C$DW$5, DW_AT_bit_offset(0x0e)
     120                      .dwattr $C$DW$5, DW_AT_bit_size(0x01)
     121                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     122                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     123              
     124              $C$DW$6 .dwtag  DW_TAG_member
     125                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     126                      .dwattr $C$DW$6, DW_AT_name("WDCLKSRCSEL")
     127                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_WDCLKSRCSEL")
     128                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0d)
     129                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     130                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     131                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     132              
     133              $C$DW$7 .dwtag  DW_TAG_member
     134                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     135                      .dwattr $C$DW$7, DW_AT_name("TMR2CLKSRCSEL")
     136                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_TMR2CLKSRCSEL")
     137                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0b)
     138                      .dwattr $C$DW$7, DW_AT_bit_size(0x02)
     139                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     140                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     141              
     142              $C$DW$8 .dwtag  DW_TAG_member
     143                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     144                      .dwattr $C$DW$8, DW_AT_name("TMR2CLKPRESCALE")
     145                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_TMR2CLKPRESCALE")
     146                      .dwattr $C$DW$8, DW_AT_bit_offset(0x08)
     147                      .dwattr $C$DW$8, DW_AT_bit_size(0x03)
     148                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     149                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     150              
     151              $C$DW$9 .dwtag  DW_TAG_member
     152                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     153                      .dwattr $C$DW$9, DW_AT_name("INTOSC1OFF")
     154                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_INTOSC1OFF")
     155                      .dwattr $C$DW$9, DW_AT_bit_offset(0x07)
     156                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     157                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     158                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    4

     159              
     160              $C$DW$10        .dwtag  DW_TAG_member
     161                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     162                      .dwattr $C$DW$10, DW_AT_name("INTOSC1HALTI")
     163                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_INTOSC1HALTI")
     164                      .dwattr $C$DW$10, DW_AT_bit_offset(0x06)
     165                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     166                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     167                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     168              
     169              $C$DW$11        .dwtag  DW_TAG_member
     170                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     171                      .dwattr $C$DW$11, DW_AT_name("INTOSC2OFF")
     172                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_INTOSC2OFF")
     173                      .dwattr $C$DW$11, DW_AT_bit_offset(0x05)
     174                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     175                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     176                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     177              
     178              $C$DW$12        .dwtag  DW_TAG_member
     179                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     180                      .dwattr $C$DW$12, DW_AT_name("INTOSC2HALTI")
     181                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_INTOSC2HALTI")
     182                      .dwattr $C$DW$12, DW_AT_bit_offset(0x04)
     183                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     184                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     185                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     186              
     187              $C$DW$13        .dwtag  DW_TAG_member
     188                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     189                      .dwattr $C$DW$13, DW_AT_name("WDHALTI")
     190                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_WDHALTI")
     191                      .dwattr $C$DW$13, DW_AT_bit_offset(0x03)
     192                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     193                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     194                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     195              
     196              $C$DW$14        .dwtag  DW_TAG_member
     197                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     198                      .dwattr $C$DW$14, DW_AT_name("XCLKINOFF")
     199                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_XCLKINOFF")
     200                      .dwattr $C$DW$14, DW_AT_bit_offset(0x02)
     201                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     202                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     203                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     204              
     205              $C$DW$15        .dwtag  DW_TAG_member
     206                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     207                      .dwattr $C$DW$15, DW_AT_name("XTALOSCOFF")
     208                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_XTALOSCOFF")
     209                      .dwattr $C$DW$15, DW_AT_bit_offset(0x01)
     210                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     211                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     212                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     213              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    5

     214              $C$DW$16        .dwtag  DW_TAG_member
     215                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     216                      .dwattr $C$DW$16, DW_AT_name("NMIRESETSEL")
     217                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_NMIRESETSEL")
     218                      .dwattr $C$DW$16, DW_AT_bit_offset(0x00)
     219                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     220                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     221                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     222              
     223                      .dwendtag $C$DW$T$20
     224              
     225              
     226              $C$DW$T$21      .dwtag  DW_TAG_union_type
     227                      .dwattr $C$DW$T$21, DW_AT_name("CLKCTL_REG")
     228                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     229              $C$DW$17        .dwtag  DW_TAG_member
     230                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     231                      .dwattr $C$DW$17, DW_AT_name("all")
     232                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_all")
     233                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     234                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     235              
     236              $C$DW$18        .dwtag  DW_TAG_member
     237                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
     238                      .dwattr $C$DW$18, DW_AT_name("bit")
     239                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_bit")
     240                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     241                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     242              
     243                      .dwendtag $C$DW$T$21
     244              
     245              
     246              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     247                      .dwattr $C$DW$T$22, DW_AT_name("EPWMCFG_BITS")
     248                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     249              $C$DW$19        .dwtag  DW_TAG_member
     250                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     251                      .dwattr $C$DW$19, DW_AT_name("CONFIG")
     252                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_CONFIG")
     253                      .dwattr $C$DW$19, DW_AT_bit_offset(0x0f)
     254                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     255                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     256                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     257              
     258              $C$DW$20        .dwtag  DW_TAG_member
     259                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     260                      .dwattr $C$DW$20, DW_AT_name("rsvd1")
     261                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd1")
     262                      .dwattr $C$DW$20, DW_AT_bit_offset(0x00)
     263                      .dwattr $C$DW$20, DW_AT_bit_size(0x0f)
     264                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     266              
     267                      .dwendtag $C$DW$T$22
     268              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    6

     269              
     270              $C$DW$T$23      .dwtag  DW_TAG_union_type
     271                      .dwattr $C$DW$T$23, DW_AT_name("EPWMCFG_REG")
     272                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     273              $C$DW$21        .dwtag  DW_TAG_member
     274                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     275                      .dwattr $C$DW$21, DW_AT_name("all")
     276                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_all")
     277                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     278                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     279              
     280              $C$DW$22        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     282                      .dwattr $C$DW$22, DW_AT_name("bit")
     283                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_bit")
     284                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     285                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     286              
     287                      .dwendtag $C$DW$T$23
     288              
     289              
     290              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     291                      .dwattr $C$DW$T$24, DW_AT_name("INTOSC1TRIM_BITS")
     292                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     293              $C$DW$23        .dwtag  DW_TAG_member
     294                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     295                      .dwattr $C$DW$23, DW_AT_name("COARSETRIM")
     296                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_COARSETRIM")
     297                      .dwattr $C$DW$23, DW_AT_bit_offset(0x08)
     298                      .dwattr $C$DW$23, DW_AT_bit_size(0x08)
     299                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     300                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     301              
     302              $C$DW$24        .dwtag  DW_TAG_member
     303                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     304                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     305                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     306                      .dwattr $C$DW$24, DW_AT_bit_offset(0x07)
     307                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     308                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311              $C$DW$25        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     313                      .dwattr $C$DW$25, DW_AT_name("FINETRIM")
     314                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_FINETRIM")
     315                      .dwattr $C$DW$25, DW_AT_bit_offset(0x01)
     316                      .dwattr $C$DW$25, DW_AT_bit_size(0x06)
     317                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     318                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     319              
     320              $C$DW$26        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     322                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     323                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    7

     324                      .dwattr $C$DW$26, DW_AT_bit_offset(0x00)
     325                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     326                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     327                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     328              
     329                      .dwendtag $C$DW$T$24
     330              
     331              
     332              $C$DW$T$25      .dwtag  DW_TAG_union_type
     333                      .dwattr $C$DW$T$25, DW_AT_name("INTOSC1TRIM_REG")
     334                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     335              $C$DW$27        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$27, DW_AT_name("all")
     338                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_all")
     339                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342              $C$DW$28        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$24)
     344                      .dwattr $C$DW$28, DW_AT_name("bit")
     345                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_bit")
     346                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     348              
     349                      .dwendtag $C$DW$T$25
     350              
     351              
     352              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     353                      .dwattr $C$DW$T$26, DW_AT_name("INTOSC2TRIM_BITS")
     354                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     355              $C$DW$29        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$29, DW_AT_name("COARSETRIM")
     358                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_COARSETRIM")
     359                      .dwattr $C$DW$29, DW_AT_bit_offset(0x08)
     360                      .dwattr $C$DW$29, DW_AT_bit_size(0x08)
     361                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     363              
     364              $C$DW$30        .dwtag  DW_TAG_member
     365                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     366                      .dwattr $C$DW$30, DW_AT_name("rsvd1")
     367                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd1")
     368                      .dwattr $C$DW$30, DW_AT_bit_offset(0x07)
     369                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     370                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     371                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     372              
     373              $C$DW$31        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     375                      .dwattr $C$DW$31, DW_AT_name("FINETRIM")
     376                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_FINETRIM")
     377                      .dwattr $C$DW$31, DW_AT_bit_offset(0x01)
     378                      .dwattr $C$DW$31, DW_AT_bit_size(0x06)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    8

     379                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     380                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     381              
     382              $C$DW$32        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     384                      .dwattr $C$DW$32, DW_AT_name("rsvd2")
     385                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd2")
     386                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     387                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     388                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     390              
     391                      .dwendtag $C$DW$T$26
     392              
     393              
     394              $C$DW$T$27      .dwtag  DW_TAG_union_type
     395                      .dwattr $C$DW$T$27, DW_AT_name("INTOSC2TRIM_REG")
     396                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     397              $C$DW$33        .dwtag  DW_TAG_member
     398                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     399                      .dwattr $C$DW$33, DW_AT_name("all")
     400                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_all")
     401                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     403              
     404              $C$DW$34        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$26)
     406                      .dwattr $C$DW$34, DW_AT_name("bit")
     407                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_bit")
     408                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     409                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     410              
     411                      .dwendtag $C$DW$T$27
     412              
     413              
     414              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     415                      .dwattr $C$DW$T$28, DW_AT_name("JTAGDEBUG_BITS")
     416                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     417              $C$DW$35        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     419                      .dwattr $C$DW$35, DW_AT_name("JTAGDIS")
     420                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_JTAGDIS")
     421                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0f)
     422                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     423                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     425              
     426              $C$DW$36        .dwtag  DW_TAG_member
     427                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     428                      .dwattr $C$DW$36, DW_AT_name("rsvd1")
     429                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd1")
     430                      .dwattr $C$DW$36, DW_AT_bit_offset(0x00)
     431                      .dwattr $C$DW$36, DW_AT_bit_size(0x0f)
     432                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     433                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE    9

     434              
     435                      .dwendtag $C$DW$T$28
     436              
     437              
     438              $C$DW$T$29      .dwtag  DW_TAG_union_type
     439                      .dwattr $C$DW$T$29, DW_AT_name("JTAGDEBUG_REG")
     440                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     441              $C$DW$37        .dwtag  DW_TAG_member
     442                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     443                      .dwattr $C$DW$37, DW_AT_name("all")
     444                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_all")
     445                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     446                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     447              
     448              $C$DW$38        .dwtag  DW_TAG_member
     449                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$28)
     450                      .dwattr $C$DW$38, DW_AT_name("bit")
     451                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_bit")
     452                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     453                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     454              
     455                      .dwendtag $C$DW$T$29
     456              
     457              
     458              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     459                      .dwattr $C$DW$T$30, DW_AT_name("LOSPCP_BITS")
     460                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     461              $C$DW$39        .dwtag  DW_TAG_member
     462                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     463                      .dwattr $C$DW$39, DW_AT_name("LSPCLK")
     464                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_LSPCLK")
     465                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0d)
     466                      .dwattr $C$DW$39, DW_AT_bit_size(0x03)
     467                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     468                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     469              
     470              $C$DW$40        .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     472                      .dwattr $C$DW$40, DW_AT_name("rsvd1")
     473                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd1")
     474                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     475                      .dwattr $C$DW$40, DW_AT_bit_size(0x0d)
     476                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     477                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     478              
     479                      .dwendtag $C$DW$T$30
     480              
     481              
     482              $C$DW$T$31      .dwtag  DW_TAG_union_type
     483                      .dwattr $C$DW$T$31, DW_AT_name("LOSPCP_REG")
     484                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     485              $C$DW$41        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$41, DW_AT_name("all")
     488                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   10

     489                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     490                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     491              
     492              $C$DW$42        .dwtag  DW_TAG_member
     493                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$30)
     494                      .dwattr $C$DW$42, DW_AT_name("bit")
     495                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     496                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     498              
     499                      .dwendtag $C$DW$T$31
     500              
     501              
     502              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     503                      .dwattr $C$DW$T$32, DW_AT_name("LPMCR0_BITS")
     504                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     505              $C$DW$43        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     507                      .dwattr $C$DW$43, DW_AT_name("LPM")
     508                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_LPM")
     509                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0e)
     510                      .dwattr $C$DW$43, DW_AT_bit_size(0x02)
     511                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     513              
     514              $C$DW$44        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     516                      .dwattr $C$DW$44, DW_AT_name("QUALSTDBY")
     517                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_QUALSTDBY")
     518                      .dwattr $C$DW$44, DW_AT_bit_offset(0x08)
     519                      .dwattr $C$DW$44, DW_AT_bit_size(0x06)
     520                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$45        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$45, DW_AT_name("rsvd1")
     526                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd1")
     527                      .dwattr $C$DW$45, DW_AT_bit_offset(0x01)
     528                      .dwattr $C$DW$45, DW_AT_bit_size(0x07)
     529                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     531              
     532              $C$DW$46        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$46, DW_AT_name("WDINTE")
     535                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_WDINTE")
     536                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     537                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     538                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     540              
     541                      .dwendtag $C$DW$T$32
     542              
     543              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   11

     544              $C$DW$T$33      .dwtag  DW_TAG_union_type
     545                      .dwattr $C$DW$T$33, DW_AT_name("LPMCR0_REG")
     546                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     547              $C$DW$47        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$47, DW_AT_name("all")
     550                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
     551                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554              $C$DW$48        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$32)
     556                      .dwattr $C$DW$48, DW_AT_name("bit")
     557                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
     558                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     560              
     561                      .dwendtag $C$DW$T$33
     562              
     563              
     564              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     565                      .dwattr $C$DW$T$34, DW_AT_name("PCLKCR0_BITS")
     566                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     567              $C$DW$49        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     569                      .dwattr $C$DW$49, DW_AT_name("HRPWMENCLK")
     570                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_HRPWMENCLK")
     571                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0f)
     572                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     573                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     575              
     576              $C$DW$50        .dwtag  DW_TAG_member
     577                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     578                      .dwattr $C$DW$50, DW_AT_name("rsvd1")
     579                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd1")
     580                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     581                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     584              
     585              $C$DW$51        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     587                      .dwattr $C$DW$51, DW_AT_name("TBCLKSYNC")
     588                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_TBCLKSYNC")
     589                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0d)
     590                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     591                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     593              
     594              $C$DW$52        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$52, DW_AT_name("ADCENCLK")
     597                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ADCENCLK")
     598                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   12

     599                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     600                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603              $C$DW$53        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$53, DW_AT_name("I2CAENCLK")
     606                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_I2CAENCLK")
     607                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0b)
     608                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     609                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     611              
     612              $C$DW$54        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$54, DW_AT_name("rsvd2")
     615                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd2")
     616                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0a)
     617                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     618                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     620              
     621              $C$DW$55        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     623                      .dwattr $C$DW$55, DW_AT_name("rsvd3")
     624                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd3")
     625                      .dwattr $C$DW$55, DW_AT_bit_offset(0x08)
     626                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     627                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     628                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     629              
     630              $C$DW$56        .dwtag  DW_TAG_member
     631                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     632                      .dwattr $C$DW$56, DW_AT_name("SPIAENCLK")
     633                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SPIAENCLK")
     634                      .dwattr $C$DW$56, DW_AT_bit_offset(0x07)
     635                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     636                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     638              
     639              $C$DW$57        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     641                      .dwattr $C$DW$57, DW_AT_name("SPIBENCLK")
     642                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_SPIBENCLK")
     643                      .dwattr $C$DW$57, DW_AT_bit_offset(0x06)
     644                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     645                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     647              
     648              $C$DW$58        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     650                      .dwattr $C$DW$58, DW_AT_name("SCIAENCLK")
     651                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_SCIAENCLK")
     652                      .dwattr $C$DW$58, DW_AT_bit_offset(0x05)
     653                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   13

     654                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657              $C$DW$59        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     659                      .dwattr $C$DW$59, DW_AT_name("SCIBENCLK")
     660                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_SCIBENCLK")
     661                      .dwattr $C$DW$59, DW_AT_bit_offset(0x04)
     662                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     663                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     665              
     666              $C$DW$60        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$60, DW_AT_name("MCBSPAENCLK")
     669                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_MCBSPAENCLK")
     670                      .dwattr $C$DW$60, DW_AT_bit_offset(0x03)
     671                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     672                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     674              
     675              $C$DW$61        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$61, DW_AT_name("rsvd4")
     678                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd4")
     679                      .dwattr $C$DW$61, DW_AT_bit_offset(0x02)
     680                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     681                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     683              
     684              $C$DW$62        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$62, DW_AT_name("ECANAENCLK")
     687                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_ECANAENCLK")
     688                      .dwattr $C$DW$62, DW_AT_bit_offset(0x01)
     689                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     690                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$63        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$63, DW_AT_name("rsvd5")
     696                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd5")
     697                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
     698                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     699                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     701              
     702                      .dwendtag $C$DW$T$34
     703              
     704              
     705              $C$DW$T$35      .dwtag  DW_TAG_union_type
     706                      .dwattr $C$DW$T$35, DW_AT_name("PCLKCR0_REG")
     707                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     708              $C$DW$64        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   14

     709                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$64, DW_AT_name("all")
     711                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
     712                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     714              
     715              $C$DW$65        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$34)
     717                      .dwattr $C$DW$65, DW_AT_name("bit")
     718                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
     719                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     721              
     722                      .dwendtag $C$DW$T$35
     723              
     724              
     725              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     726                      .dwattr $C$DW$T$36, DW_AT_name("PCLKCR1_BITS")
     727                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     728              $C$DW$66        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$66, DW_AT_name("EPWM1ENCLK")
     731                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_EPWM1ENCLK")
     732                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0f)
     733                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     734                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     736              
     737              $C$DW$67        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$67, DW_AT_name("EPWM2ENCLK")
     740                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_EPWM2ENCLK")
     741                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e)
     742                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     743                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     745              
     746              $C$DW$68        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     748                      .dwattr $C$DW$68, DW_AT_name("EPWM3ENCLK")
     749                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_EPWM3ENCLK")
     750                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0d)
     751                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     752                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     754              
     755              $C$DW$69        .dwtag  DW_TAG_member
     756                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     757                      .dwattr $C$DW$69, DW_AT_name("EPWM4ENCLK")
     758                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_EPWM4ENCLK")
     759                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c)
     760                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     761                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     763              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   15

     764              $C$DW$70        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     766                      .dwattr $C$DW$70, DW_AT_name("EPWM5ENCLK")
     767                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_EPWM5ENCLK")
     768                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0b)
     769                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     770                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$71        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$71, DW_AT_name("EPWM6ENCLK")
     776                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_EPWM6ENCLK")
     777                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0a)
     778                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     779                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     780                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     781              
     782              $C$DW$72        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$72, DW_AT_name("EPWM7ENCLK")
     785                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_EPWM7ENCLK")
     786                      .dwattr $C$DW$72, DW_AT_bit_offset(0x09)
     787                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     788                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     790              
     791              $C$DW$73        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     793                      .dwattr $C$DW$73, DW_AT_name("EPWM8ENCLK")
     794                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_EPWM8ENCLK")
     795                      .dwattr $C$DW$73, DW_AT_bit_offset(0x08)
     796                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     797                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     799              
     800              $C$DW$74        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$74, DW_AT_name("ECAP1ENCLK")
     803                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ECAP1ENCLK")
     804                      .dwattr $C$DW$74, DW_AT_bit_offset(0x07)
     805                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     806                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     808              
     809              $C$DW$75        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$75, DW_AT_name("ECAP2ENCLK")
     812                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_ECAP2ENCLK")
     813                      .dwattr $C$DW$75, DW_AT_bit_offset(0x06)
     814                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     815                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$76        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   16

     819                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$76, DW_AT_name("ECAP3ENCLK")
     821                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_ECAP3ENCLK")
     822                      .dwattr $C$DW$76, DW_AT_bit_offset(0x05)
     823                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
     824                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     826              
     827              $C$DW$77        .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     829                      .dwattr $C$DW$77, DW_AT_name("rsvd1")
     830                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd1")
     831                      .dwattr $C$DW$77, DW_AT_bit_offset(0x02)
     832                      .dwattr $C$DW$77, DW_AT_bit_size(0x03)
     833                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     835              
     836              $C$DW$78        .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     838                      .dwattr $C$DW$78, DW_AT_name("EQEP1ENCLK")
     839                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_EQEP1ENCLK")
     840                      .dwattr $C$DW$78, DW_AT_bit_offset(0x01)
     841                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     842                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     844              
     845              $C$DW$79        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$79, DW_AT_name("EQEP2ENCLK")
     848                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_EQEP2ENCLK")
     849                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
     850                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     851                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     853              
     854                      .dwendtag $C$DW$T$36
     855              
     856              
     857              $C$DW$T$37      .dwtag  DW_TAG_union_type
     858                      .dwattr $C$DW$T$37, DW_AT_name("PCLKCR1_REG")
     859                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     860              $C$DW$80        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$80, DW_AT_name("all")
     863                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     864                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     866              
     867              $C$DW$81        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$36)
     869                      .dwattr $C$DW$81, DW_AT_name("bit")
     870                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     871                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     873              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   17

     874                      .dwendtag $C$DW$T$37
     875              
     876              
     877              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     878                      .dwattr $C$DW$T$38, DW_AT_name("PCLKCR2_BITS")
     879                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     880              $C$DW$82        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     882                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
     883                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
     884                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08)
     885                      .dwattr $C$DW$82, DW_AT_bit_size(0x08)
     886                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     888              
     889              $C$DW$83        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$83, DW_AT_name("HRCAP1ENCLK")
     892                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_HRCAP1ENCLK")
     893                      .dwattr $C$DW$83, DW_AT_bit_offset(0x07)
     894                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     895                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     897              
     898              $C$DW$84        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$84, DW_AT_name("HRCAP2ENCLK")
     901                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_HRCAP2ENCLK")
     902                      .dwattr $C$DW$84, DW_AT_bit_offset(0x06)
     903                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     904                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     906              
     907              $C$DW$85        .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     909                      .dwattr $C$DW$85, DW_AT_name("HRCAP3ENCLK")
     910                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_HRCAP3ENCLK")
     911                      .dwattr $C$DW$85, DW_AT_bit_offset(0x05)
     912                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$86        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$86, DW_AT_name("HRCAP4ENCLK")
     919                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_HRCAP4ENCLK")
     920                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04)
     921                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     922                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     924              
     925              $C$DW$87        .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     927                      .dwattr $C$DW$87, DW_AT_name("rsvd2")
     928                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   18

     929                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
     930                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
     931                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934                      .dwendtag $C$DW$T$38
     935              
     936              
     937              $C$DW$T$39      .dwtag  DW_TAG_union_type
     938                      .dwattr $C$DW$T$39, DW_AT_name("PCLKCR2_REG")
     939                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     940              $C$DW$88        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$88, DW_AT_name("all")
     943                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
     944                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     946              
     947              $C$DW$89        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$38)
     949                      .dwattr $C$DW$89, DW_AT_name("bit")
     950                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
     951                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954                      .dwendtag $C$DW$T$39
     955              
     956              
     957              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     958                      .dwattr $C$DW$T$40, DW_AT_name("PCLKCR3_BITS")
     959                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     960              $C$DW$90        .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     962                      .dwattr $C$DW$90, DW_AT_name("COMP1ENCLK")
     963                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_COMP1ENCLK")
     964                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f)
     965                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     966                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     968              
     969              $C$DW$91        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$91, DW_AT_name("COMP2ENCLK")
     972                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_COMP2ENCLK")
     973                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e)
     974                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     975                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     977              
     978              $C$DW$92        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     980                      .dwattr $C$DW$92, DW_AT_name("COMP3ENCLK")
     981                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_COMP3ENCLK")
     982                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d)
     983                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   19

     984                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     986              
     987              $C$DW$93        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
     990                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
     991                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08)
     992                      .dwattr $C$DW$93, DW_AT_bit_size(0x05)
     993                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     995              
     996              $C$DW$94        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$94, DW_AT_name("CPUTIMER0ENCLK")
     999                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CPUTIMER0ENCLK")
    1000                      .dwattr $C$DW$94, DW_AT_bit_offset(0x07)
    1001                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1002                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1004              
    1005              $C$DW$95        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1007                      .dwattr $C$DW$95, DW_AT_name("CPUTIMER1ENCLK")
    1008                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CPUTIMER1ENCLK")
    1009                      .dwattr $C$DW$95, DW_AT_bit_offset(0x06)
    1010                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1011                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1013              
    1014              $C$DW$96        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$96, DW_AT_name("CPUTIMER2ENCLK")
    1017                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CPUTIMER2ENCLK")
    1018                      .dwattr $C$DW$96, DW_AT_bit_offset(0x05)
    1019                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1020                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$97        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$97, DW_AT_name("DMAENCLK")
    1026                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_DMAENCLK")
    1027                      .dwattr $C$DW$97, DW_AT_bit_offset(0x04)
    1028                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1029                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1031              
    1032              $C$DW$98        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    1035                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    1036                      .dwattr $C$DW$98, DW_AT_bit_offset(0x03)
    1037                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   20

    1039                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1040              
    1041              $C$DW$99        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1043                      .dwattr $C$DW$99, DW_AT_name("rsvd3")
    1044                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd3")
    1045                      .dwattr $C$DW$99, DW_AT_bit_offset(0x02)
    1046                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1047                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1049              
    1050              $C$DW$100       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$100, DW_AT_name("CLA1ENCLK")
    1053                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_CLA1ENCLK")
    1054                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01)
    1055                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1056                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059              $C$DW$101       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$101, DW_AT_name("USB0ENCLK")
    1062                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_USB0ENCLK")
    1063                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1064                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1065                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068                      .dwendtag $C$DW$T$40
    1069              
    1070              
    1071              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1072                      .dwattr $C$DW$T$41, DW_AT_name("PCLKCR3_REG")
    1073                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1074              $C$DW$102       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$102, DW_AT_name("all")
    1077                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1078                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$103       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$40)
    1083                      .dwattr $C$DW$103, DW_AT_name("bit")
    1084                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1085                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088                      .dwendtag $C$DW$T$41
    1089              
    1090              
    1091              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1092                      .dwattr $C$DW$T$42, DW_AT_name("PLL2CTL_BITS")
    1093                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   21

    1094              $C$DW$104       .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1096                      .dwattr $C$DW$104, DW_AT_name("PLL2CLKSRCSEL")
    1097                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PLL2CLKSRCSEL")
    1098                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1099                      .dwattr $C$DW$104, DW_AT_bit_size(0x02)
    1100                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1102              
    1103              $C$DW$105       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$105, DW_AT_name("PLL2EN")
    1106                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PLL2EN")
    1107                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d)
    1108                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1109                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1110                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1111              
    1112              $C$DW$106       .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1114                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    1115                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    1116                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    1117                      .dwattr $C$DW$106, DW_AT_bit_size(0x0d)
    1118                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1120              
    1121                      .dwendtag $C$DW$T$42
    1122              
    1123              
    1124              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1125                      .dwattr $C$DW$T$43, DW_AT_name("PLL2CTL_REG")
    1126                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1127              $C$DW$107       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$107, DW_AT_name("all")
    1130                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    1131                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1133              
    1134              $C$DW$108       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$42)
    1136                      .dwattr $C$DW$108, DW_AT_name("bit")
    1137                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    1138                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1140              
    1141                      .dwendtag $C$DW$T$43
    1142              
    1143              
    1144              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1145                      .dwattr $C$DW$T$44, DW_AT_name("PLL2MULT_BITS")
    1146                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1147              $C$DW$109       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   22

    1149                      .dwattr $C$DW$109, DW_AT_name("PLL2MULT")
    1150                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PLL2MULT")
    1151                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1152                      .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1153                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156              $C$DW$110       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1159                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1160                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1161                      .dwattr $C$DW$110, DW_AT_bit_size(0x0c)
    1162                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165                      .dwendtag $C$DW$T$44
    1166              
    1167              
    1168              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1169                      .dwattr $C$DW$T$45, DW_AT_name("PLL2MULT_REG")
    1170                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1171              $C$DW$111       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$111, DW_AT_name("all")
    1174                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1175                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$112       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$44)
    1180                      .dwattr $C$DW$112, DW_AT_name("bit")
    1181                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1182                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185                      .dwendtag $C$DW$T$45
    1186              
    1187              
    1188              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1189                      .dwattr $C$DW$T$46, DW_AT_name("PLL2STS_BITS")
    1190                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1191              $C$DW$113       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$113, DW_AT_name("PLL2LOCKS")
    1194                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PLL2LOCKS")
    1195                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f)
    1196                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$114       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1203                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   23

    1204                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1205                      .dwattr $C$DW$114, DW_AT_bit_size(0x0f)
    1206                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209                      .dwendtag $C$DW$T$46
    1210              
    1211              
    1212              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1213                      .dwattr $C$DW$T$47, DW_AT_name("PLL2STS_REG")
    1214                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1215              $C$DW$115       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$115, DW_AT_name("all")
    1218                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1219                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1221              
    1222              $C$DW$116       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$46)
    1224                      .dwattr $C$DW$116, DW_AT_name("bit")
    1225                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1226                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229                      .dwendtag $C$DW$T$47
    1230              
    1231              
    1232              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1233                      .dwattr $C$DW$T$48, DW_AT_name("PLLCR_BITS")
    1234                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1235              $C$DW$117       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$117, DW_AT_name("DIV")
    1238                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_DIV")
    1239                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b)
    1240                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    1241                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$118       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1247                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1248                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1249                      .dwattr $C$DW$118, DW_AT_bit_size(0x0b)
    1250                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253                      .dwendtag $C$DW$T$48
    1254              
    1255              
    1256              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1257                      .dwattr $C$DW$T$49, DW_AT_name("PLLCR_REG")
    1258                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   24

    1259              $C$DW$119       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$119, DW_AT_name("all")
    1262                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1263                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$120       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$48)
    1268                      .dwattr $C$DW$120, DW_AT_name("bit")
    1269                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1270                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273                      .dwendtag $C$DW$T$49
    1274              
    1275              
    1276              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1277                      .dwattr $C$DW$T$50, DW_AT_name("PLLSTS_BITS")
    1278                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1279              $C$DW$121       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$121, DW_AT_name("PLLLOCKS")
    1282                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PLLLOCKS")
    1283                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f)
    1284                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$122       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1291                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    1292                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    1293                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$123       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$123, DW_AT_name("PLLOFF")
    1300                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PLLOFF")
    1301                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d)
    1302                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1303                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$124       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$124, DW_AT_name("MCLKSTS")
    1309                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_MCLKSTS")
    1310                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c)
    1311                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1312                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   25

    1314              
    1315              $C$DW$125       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$125, DW_AT_name("MCLKCLR")
    1318                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_MCLKCLR")
    1319                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b)
    1320                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1321                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$126       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$126, DW_AT_name("OSCOFF")
    1327                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_OSCOFF")
    1328                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    1329                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1330                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333              $C$DW$127       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$127, DW_AT_name("MCLKOFF")
    1336                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_MCLKOFF")
    1337                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09)
    1338                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$128       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$128, DW_AT_name("DIVSEL")
    1345                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_DIVSEL")
    1346                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    1347                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1348                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351              $C$DW$129       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$129, DW_AT_name("rsvd2")
    1354                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd2")
    1355                      .dwattr $C$DW$129, DW_AT_bit_offset(0x01)
    1356                      .dwattr $C$DW$129, DW_AT_bit_size(0x06)
    1357                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$130       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$130, DW_AT_name("NORMRDYE")
    1363                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_NORMRDYE")
    1364                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    1365                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1366                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1368              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initClock.asm                                                        PAGE   26

    1369                      .dwendtag $C$DW$T$50
    1370              
    1371              
    1372              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1373                      .dwattr $C$DW$T$51, DW_AT_name("PLLSTS_REG")
    1374                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1375              $C$DW$131       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$131, DW_AT_name("all")
    1378                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1379                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382              $C$DW$132       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$50)
    1384                      .dwattr $C$DW$132, DW_AT_name("bit")
    1385                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1386                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1388              
    1389                      .dwendtag $C$DW$T$51
    1390              
    1391              
    1392              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1393                      .dwattr $C$DW$T$55, DW_AT_name("SYS_CTRL_REGS")
    1394                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x30)
    1395              $C$DW$133       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$57)
    1397                      .dwattr $C$DW$133, DW_AT_name("XCLK")
    1398                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_XCLK")
    1399                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$134       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$51)
    1404                      .dwattr $C$DW$134, DW_AT_name("PLLSTS")
    1405                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PLLSTS")
    1406                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1407                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1408              
    1409              $C$DW$135       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    1411                      .dwattr $C$DW$135, DW_AT_name("CLKCTL")
    1412                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_CLKCTL")
    1413                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1414                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1415              
