TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Sat Mar 11 21:51:20 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../initGPIO.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Lawrence\Google Drive\workspace_v7\SeventhProject\Debug")
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioDataRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioDataRegs")

      78 0000000b D808          ADDB      XAR0,#8               ; [CPU_] |16| 
      79                      .dwpsn  file "../initGPIO.c",line 14,column 5,is_stmt,isa 0
      80 0000000c D90D          ADDB      XAR1,#13              ; [CPU_] |14| 
      81                      .dwpsn  file "../initGPIO.c",line 17,column 5,is_stmt,isa 0
      82 0000000d DF0B          ADDB      XAR7,#11              ; [CPU_] |17| 
      83                      .dwpsn  file "../initGPIO.c",line 20,column 5,is_stmt,isa 0
      84 0000000e DE1C          ADDB      XAR6,#28              ; [CPU_] |20| 
      85                      .dwpsn  file "../initGPIO.c",line 22,column 5,is_stmt,isa 0
      86 0000000f DD16          ADDB      XAR5,#22              ; [CPU_] |22| 
      87                      .dwpsn  file "../initGPIO.c",line 23,column 5,is_stmt,isa 0
      88 00000010 DC1A          ADDB      XAR4,#26              ; [CPU_] |23| 
      89                      .dwpsn  file "../initGPIO.c",line 14,column 5,is_stmt,isa 0
      90 00000011 1AC1          OR        *+XAR1[0],#0x0004     ; [CPU_] |14| 
         00000012 0004 
      91                      .dwpsn  file "../initGPIO.c",line 16,column 5,is_stmt,isa 0
      92 00000013 1AC0          OR        *+XAR0[0],#0x0030     ; [CPU_] |16| 
         00000014 0030 
      93                      .dwpsn  file "../initGPIO.c",line 17,column 5,is_stmt,isa 0
      94 00000015 1AC7          OR        *+XAR7[0],#0x0004     ; [CPU_] |17| 
         00000016 0004 
      95                      .dwpsn  file "../initGPIO.c",line 20,column 5,is_stmt,isa 0
      96 00000017 1AC6          OR        *+XAR6[0],#0x0004     ; [CPU_] |20| 
         00000018 0004 
      97                      .dwpsn  file "../initGPIO.c",line 21,column 5,is_stmt,isa 0
      98 00000019 1A0A!         OR        @_GpioDataRegs+10,#0x0004 ; [CPU_] |21| 
         0000001a 0004 
      99 0000001b 761F!         MOVW      DP,#_GpioCtrlRegs+28  ; [CPU_U] 
         0000001c 0000 
     100                      .dwpsn  file "../initGPIO.c",line 22,column 5,is_stmt,isa 0
     101 0000001d 18C5          AND       *+XAR5[0],#0xffcf     ; [CPU_] |22| 
         0000001e FFCF 
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    3

     102                      .dwpsn  file "../initGPIO.c",line 23,column 5,is_stmt,isa 0
     103 0000001f 1AC4          OR        *+XAR4[0],#0x0004     ; [CPU_] |23| 
         00000020 0004 
     104                      .dwpsn  file "../initGPIO.c",line 26,column 5,is_stmt,isa 0
     105 00000021 1A1C!         OR        @_GpioCtrlRegs+28,#0x0080 ; [CPU_] |26| 
         00000022 0080 
     106 00000023 761F!         MOVW      DP,#_GpioDataRegs+10  ; [CPU_U] 
         00000024 0000 
     107                      .dwpsn  file "../initGPIO.c",line 27,column 5,is_stmt,isa 0
     108 00000025 1A0A!         OR        @_GpioDataRegs+10,#0x0080 ; [CPU_] |27| 
         00000026 0080 
     109 00000027 761F!         MOVW      DP,#_GpioCtrlRegs+22  ; [CPU_U] 
         00000028 0000 
     110                      .dwpsn  file "../initGPIO.c",line 28,column 5,is_stmt,isa 0
     111 00000029 1816!         AND       @_GpioCtrlRegs+22,#0x3fff ; [CPU_] |28| 
         0000002a 3FFF 
     112                      .dwpsn  file "../initGPIO.c",line 29,column 5,is_stmt,isa 0
     113 0000002b 1A1A!         OR        @_GpioCtrlRegs+26,#0x0080 ; [CPU_] |29| 
         0000002c 0080 
     114 0000002d 761A   EDIS
     115 0000002e FF69          SPM       #0                    ; [CPU_] 
     116 0000002f 8BBE          MOVL      XAR1,*--SP            ; [CPU_] 
     117                      .dwcfi  cfa_offset, -2
     118                      .dwcfi  restore_reg, 7
     119              $C$DW$4 .dwtag  DW_TAG_TI_branch
     120                      .dwattr $C$DW$4, DW_AT_low_pc(0x00)
     121                      .dwattr $C$DW$4, DW_AT_TI_return
     122              
     123 00000030 0006          LRETR     ; [CPU_] 
     124                      ; return occurs ; [] 
     125                      .dwattr $C$DW$3, DW_AT_TI_end_file("../initGPIO.c")
     126                      .dwattr $C$DW$3, DW_AT_TI_end_line(0x1f)
     127                      .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     128                      .dwendentry
     129                      .dwendtag $C$DW$3
     130              
     131              ;**************************************************************
     132              ;* UNDEFINED EXTERNAL REFERENCES                              *
     133              ;**************************************************************
     134                      .global _GpioDataRegs
     135                      .global _GpioCtrlRegs
     136              
     137              ;***************************************************************
     138              ;* TYPE INFORMATION                                            *
     139              ;***************************************************************
     140              
     141              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     142                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     143                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     144              $C$DW$5 .dwtag  DW_TAG_member
     145                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     146                      .dwattr $C$DW$5, DW_AT_name("rsvd1")
     147                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_rsvd1")
     148                      .dwattr $C$DW$5, DW_AT_bit_offset(0x0f)
     149                      .dwattr $C$DW$5, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    4

     150                      .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     151                      .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     152              
     153              $C$DW$6 .dwtag  DW_TAG_member
     154                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     155                      .dwattr $C$DW$6, DW_AT_name("rsvd2")
     156                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_rsvd2")
     157                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0e)
     158                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     159                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     160                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     161              
     162              $C$DW$7 .dwtag  DW_TAG_member
     163                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     164                      .dwattr $C$DW$7, DW_AT_name("AIO2")
     165                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_AIO2")
     166                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0d)
     167                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     168                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     169                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     170              
     171              $C$DW$8 .dwtag  DW_TAG_member
     172                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     173                      .dwattr $C$DW$8, DW_AT_name("rsvd3")
     174                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_rsvd3")
     175                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0c)
     176                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     177                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     178                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     179              
     180              $C$DW$9 .dwtag  DW_TAG_member
     181                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     182                      .dwattr $C$DW$9, DW_AT_name("AIO4")
     183                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_AIO4")
     184                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0b)
     185                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     186                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     187                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     188              
     189              $C$DW$10        .dwtag  DW_TAG_member
     190                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     191                      .dwattr $C$DW$10, DW_AT_name("rsvd4")
     192                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_rsvd4")
     193                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0a)
     194                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     195                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     196                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     197              
     198              $C$DW$11        .dwtag  DW_TAG_member
     199                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     200                      .dwattr $C$DW$11, DW_AT_name("AIO6")
     201                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_AIO6")
     202                      .dwattr $C$DW$11, DW_AT_bit_offset(0x09)
     203                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     204                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    5

     205                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     206              
     207              $C$DW$12        .dwtag  DW_TAG_member
     208                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     209                      .dwattr $C$DW$12, DW_AT_name("rsvd5")
     210                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_rsvd5")
     211                      .dwattr $C$DW$12, DW_AT_bit_offset(0x08)
     212                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     213                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     214                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     215              
     216              $C$DW$13        .dwtag  DW_TAG_member
     217                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     218                      .dwattr $C$DW$13, DW_AT_name("rsvd6")
     219                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_rsvd6")
     220                      .dwattr $C$DW$13, DW_AT_bit_offset(0x07)
     221                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     222                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     223                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     224              
     225              $C$DW$14        .dwtag  DW_TAG_member
     226                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     227                      .dwattr $C$DW$14, DW_AT_name("rsvd7")
     228                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_rsvd7")
     229                      .dwattr $C$DW$14, DW_AT_bit_offset(0x06)
     230                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     231                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     232                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     233              
     234              $C$DW$15        .dwtag  DW_TAG_member
     235                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     236                      .dwattr $C$DW$15, DW_AT_name("AIO10")
     237                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_AIO10")
     238                      .dwattr $C$DW$15, DW_AT_bit_offset(0x05)
     239                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     240                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     241                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     242              
     243              $C$DW$16        .dwtag  DW_TAG_member
     244                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     245                      .dwattr $C$DW$16, DW_AT_name("rsvd8")
     246                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_rsvd8")
     247                      .dwattr $C$DW$16, DW_AT_bit_offset(0x04)
     248                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     249                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     250                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     251              
     252              $C$DW$17        .dwtag  DW_TAG_member
     253                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     254                      .dwattr $C$DW$17, DW_AT_name("AIO12")
     255                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_AIO12")
     256                      .dwattr $C$DW$17, DW_AT_bit_offset(0x03)
     257                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     258                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     259                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    6

     260              
     261              $C$DW$18        .dwtag  DW_TAG_member
     262                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     263                      .dwattr $C$DW$18, DW_AT_name("rsvd9")
     264                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd9")
     265                      .dwattr $C$DW$18, DW_AT_bit_offset(0x02)
     266                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     267                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     268                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     269              
     270              $C$DW$19        .dwtag  DW_TAG_member
     271                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     272                      .dwattr $C$DW$19, DW_AT_name("AIO14")
     273                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_AIO14")
     274                      .dwattr $C$DW$19, DW_AT_bit_offset(0x01)
     275                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     276                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     277                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     278              
     279              $C$DW$20        .dwtag  DW_TAG_member
     280                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     281                      .dwattr $C$DW$20, DW_AT_name("rsvd10")
     282                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd10")
     283                      .dwattr $C$DW$20, DW_AT_bit_offset(0x00)
     284                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     285                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     286                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     287              
     288              $C$DW$21        .dwtag  DW_TAG_member
     289                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     290                      .dwattr $C$DW$21, DW_AT_name("rsvd11")
     291                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd11")
     292                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00)
     293                      .dwattr $C$DW$21, DW_AT_bit_size(0x10)
     294                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     295                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     296              
     297                      .dwendtag $C$DW$T$20
     298              
     299              
     300              $C$DW$T$22      .dwtag  DW_TAG_union_type
     301                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     302                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     303              $C$DW$22        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     305                      .dwattr $C$DW$22, DW_AT_name("all")
     306                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_all")
     307                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     308                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     309              
     310              $C$DW$23        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     312                      .dwattr $C$DW$23, DW_AT_name("bit")
     313                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_bit")
     314                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    7

     315                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     316              
     317                      .dwendtag $C$DW$T$22
     318              
     319              
     320              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     321                      .dwattr $C$DW$T$23, DW_AT_name("AIO_BITS")
     322                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     323              $C$DW$24        .dwtag  DW_TAG_member
     324                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     325                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     326                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     327                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0e)
     328                      .dwattr $C$DW$24, DW_AT_bit_size(0x02)
     329                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     331              
     332              $C$DW$25        .dwtag  DW_TAG_member
     333                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     334                      .dwattr $C$DW$25, DW_AT_name("rsvd2")
     335                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd2")
     336                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0c)
     337                      .dwattr $C$DW$25, DW_AT_bit_size(0x02)
     338                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     339                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     340              
     341              $C$DW$26        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     343                      .dwattr $C$DW$26, DW_AT_name("AIO2")
     344                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_AIO2")
     345                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0a)
     346                      .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     347                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     348                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     349              
     350              $C$DW$27        .dwtag  DW_TAG_member
     351                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     352                      .dwattr $C$DW$27, DW_AT_name("rsvd3")
     353                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd3")
     354                      .dwattr $C$DW$27, DW_AT_bit_offset(0x08)
     355                      .dwattr $C$DW$27, DW_AT_bit_size(0x02)
     356                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     357                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     358              
     359              $C$DW$28        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     361                      .dwattr $C$DW$28, DW_AT_name("AIO4")
     362                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_AIO4")
     363                      .dwattr $C$DW$28, DW_AT_bit_offset(0x06)
     364                      .dwattr $C$DW$28, DW_AT_bit_size(0x02)
     365                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     366                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     367              
     368              $C$DW$29        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    8

     370                      .dwattr $C$DW$29, DW_AT_name("rsvd4")
     371                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd4")
     372                      .dwattr $C$DW$29, DW_AT_bit_offset(0x04)
     373                      .dwattr $C$DW$29, DW_AT_bit_size(0x02)
     374                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     376              
     377              $C$DW$30        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     379                      .dwattr $C$DW$30, DW_AT_name("AIO6")
     380                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_AIO6")
     381                      .dwattr $C$DW$30, DW_AT_bit_offset(0x02)
     382                      .dwattr $C$DW$30, DW_AT_bit_size(0x02)
     383                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     384                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     385              
     386              $C$DW$31        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     388                      .dwattr $C$DW$31, DW_AT_name("rsvd5")
     389                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd5")
     390                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     391                      .dwattr $C$DW$31, DW_AT_bit_size(0x02)
     392                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     393                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     394              
     395              $C$DW$32        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     397                      .dwattr $C$DW$32, DW_AT_name("rsvd6")
     398                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd6")
     399                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0e)
     400                      .dwattr $C$DW$32, DW_AT_bit_size(0x02)
     401                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     402                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     403              
     404              $C$DW$33        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$33, DW_AT_name("rsvd7")
     407                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd7")
     408                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c)
     409                      .dwattr $C$DW$33, DW_AT_bit_size(0x02)
     410                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     411                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     412              
     413              $C$DW$34        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     415                      .dwattr $C$DW$34, DW_AT_name("AIO10")
     416                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_AIO10")
     417                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0a)
     418                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     419                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     420                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     421              
     422              $C$DW$35        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$35, DW_AT_name("rsvd8")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE    9

     425                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd8")
     426                      .dwattr $C$DW$35, DW_AT_bit_offset(0x08)
     427                      .dwattr $C$DW$35, DW_AT_bit_size(0x02)
     428                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     429                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$36        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$36, DW_AT_name("AIO12")
     434                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_AIO12")
     435                      .dwattr $C$DW$36, DW_AT_bit_offset(0x06)
     436                      .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     437                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     438                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$37        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     442                      .dwattr $C$DW$37, DW_AT_name("rsvd9")
     443                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd9")
     444                      .dwattr $C$DW$37, DW_AT_bit_offset(0x04)
     445                      .dwattr $C$DW$37, DW_AT_bit_size(0x02)
     446                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     447                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     448              
     449              $C$DW$38        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     451                      .dwattr $C$DW$38, DW_AT_name("AIO14")
     452                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_AIO14")
     453                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02)
     454                      .dwattr $C$DW$38, DW_AT_bit_size(0x02)
     455                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     456                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     457              
     458              $C$DW$39        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$39, DW_AT_name("rsvd10")
     461                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd10")
     462                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00)
     463                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     464                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     465                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     466              
     467                      .dwendtag $C$DW$T$23
     468              
     469              
     470              $C$DW$T$24      .dwtag  DW_TAG_union_type
     471                      .dwattr $C$DW$T$24, DW_AT_name("AIO_REG")
     472                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     473              $C$DW$40        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$21)
     475                      .dwattr $C$DW$40, DW_AT_name("all")
     476                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
     477                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     479              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   10

     480              $C$DW$41        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$23)
     482                      .dwattr $C$DW$41, DW_AT_name("bit")
     483                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
     484                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     485                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     486              
     487                      .dwendtag $C$DW$T$24
     488              
     489              
     490              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     491                      .dwattr $C$DW$T$25, DW_AT_name("GPA1_BITS")
     492                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     493              $C$DW$42        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$42, DW_AT_name("GPIO0")
     496                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO0")
     497                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0e)
     498                      .dwattr $C$DW$42, DW_AT_bit_size(0x02)
     499                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$43        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$43, DW_AT_name("GPIO1")
     505                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO1")
     506                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c)
     507                      .dwattr $C$DW$43, DW_AT_bit_size(0x02)
     508                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     509                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     510              
     511              $C$DW$44        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$44, DW_AT_name("GPIO2")
     514                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO2")
     515                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0a)
     516                      .dwattr $C$DW$44, DW_AT_bit_size(0x02)
     517                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$45        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$45, DW_AT_name("GPIO3")
     523                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO3")
     524                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08)
     525                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
     526                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$46        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$46, DW_AT_name("GPIO4")
     532                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO4")
     533                      .dwattr $C$DW$46, DW_AT_bit_offset(0x06)
     534                      .dwattr $C$DW$46, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   11

     535                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538              $C$DW$47        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$47, DW_AT_name("GPIO5")
     541                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO5")
     542                      .dwattr $C$DW$47, DW_AT_bit_offset(0x04)
     543                      .dwattr $C$DW$47, DW_AT_bit_size(0x02)
     544                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$48        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$48, DW_AT_name("GPIO6")
     550                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO6")
     551                      .dwattr $C$DW$48, DW_AT_bit_offset(0x02)
     552                      .dwattr $C$DW$48, DW_AT_bit_size(0x02)
     553                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556              $C$DW$49        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$49, DW_AT_name("GPIO7")
     559                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO7")
     560                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     561                      .dwattr $C$DW$49, DW_AT_bit_size(0x02)
     562                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     564              
     565              $C$DW$50        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$50, DW_AT_name("GPIO8")
     568                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO8")
     569                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     570                      .dwattr $C$DW$50, DW_AT_bit_size(0x02)
     571                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     572                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574              $C$DW$51        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$51, DW_AT_name("GPIO9")
     577                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO9")
     578                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c)
     579                      .dwattr $C$DW$51, DW_AT_bit_size(0x02)
     580                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     581                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     582              
     583              $C$DW$52        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$52, DW_AT_name("GPIO10")
     586                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO10")
     587                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0a)
     588                      .dwattr $C$DW$52, DW_AT_bit_size(0x02)
     589                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   12

     590                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     591              
     592              $C$DW$53        .dwtag  DW_TAG_member
     593                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     594                      .dwattr $C$DW$53, DW_AT_name("GPIO11")
     595                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO11")
     596                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
     597                      .dwattr $C$DW$53, DW_AT_bit_size(0x02)
     598                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     599                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     600              
     601              $C$DW$54        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$54, DW_AT_name("GPIO12")
     604                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO12")
     605                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06)
     606                      .dwattr $C$DW$54, DW_AT_bit_size(0x02)
     607                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     608                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$55        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$55, DW_AT_name("GPIO13")
     613                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO13")
     614                      .dwattr $C$DW$55, DW_AT_bit_offset(0x04)
     615                      .dwattr $C$DW$55, DW_AT_bit_size(0x02)
     616                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     617                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     618              
     619              $C$DW$56        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$56, DW_AT_name("GPIO14")
     622                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO14")
     623                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02)
     624                      .dwattr $C$DW$56, DW_AT_bit_size(0x02)
     625                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     626                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     627              
     628              $C$DW$57        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$57, DW_AT_name("GPIO15")
     631                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO15")
     632                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     633                      .dwattr $C$DW$57, DW_AT_bit_size(0x02)
     634                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     635                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     636              
     637                      .dwendtag $C$DW$T$25
     638              
     639              
     640              $C$DW$T$26      .dwtag  DW_TAG_union_type
     641                      .dwattr $C$DW$T$26, DW_AT_name("GPA1_REG")
     642                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     643              $C$DW$58        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   13

     645                      .dwattr $C$DW$58, DW_AT_name("all")
     646                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     647                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     649              
     650              $C$DW$59        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
     652                      .dwattr $C$DW$59, DW_AT_name("bit")
     653                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     654                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     656              
     657                      .dwendtag $C$DW$T$26
     658              
     659              
     660              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     661                      .dwattr $C$DW$T$27, DW_AT_name("GPA2_BITS")
     662                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     663              $C$DW$60        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$60, DW_AT_name("GPIO16")
     666                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO16")
     667                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e)
     668                      .dwattr $C$DW$60, DW_AT_bit_size(0x02)
     669                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     671              
     672              $C$DW$61        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$61, DW_AT_name("GPIO17")
     675                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO17")
     676                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0c)
     677                      .dwattr $C$DW$61, DW_AT_bit_size(0x02)
     678                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     680              
     681              $C$DW$62        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     683                      .dwattr $C$DW$62, DW_AT_name("GPIO18")
     684                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO18")
     685                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0a)
     686                      .dwattr $C$DW$62, DW_AT_bit_size(0x02)
     687                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     689              
     690              $C$DW$63        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$63, DW_AT_name("GPIO19")
     693                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO19")
     694                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
     695                      .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     696                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     698              
     699              $C$DW$64        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   14

     700                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$64, DW_AT_name("GPIO20")
     702                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO20")
     703                      .dwattr $C$DW$64, DW_AT_bit_offset(0x06)
     704                      .dwattr $C$DW$64, DW_AT_bit_size(0x02)
     705                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     707              
     708              $C$DW$65        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$65, DW_AT_name("GPIO21")
     711                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO21")
     712                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04)
     713                      .dwattr $C$DW$65, DW_AT_bit_size(0x02)
     714                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     716              
     717              $C$DW$66        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     719                      .dwattr $C$DW$66, DW_AT_name("GPIO22")
     720                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO22")
     721                      .dwattr $C$DW$66, DW_AT_bit_offset(0x02)
     722                      .dwattr $C$DW$66, DW_AT_bit_size(0x02)
     723                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     725              
     726              $C$DW$67        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$67, DW_AT_name("GPIO23")
     729                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO23")
     730                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     731                      .dwattr $C$DW$67, DW_AT_bit_size(0x02)
     732                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735              $C$DW$68        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$68, DW_AT_name("GPIO24")
     738                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO24")
     739                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e)
     740                      .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     741                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     742                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     743              
     744              $C$DW$69        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$69, DW_AT_name("GPIO25")
     747                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO25")
     748                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c)
     749                      .dwattr $C$DW$69, DW_AT_bit_size(0x02)
     750                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     751                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     752              
     753              $C$DW$70        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   15

     755                      .dwattr $C$DW$70, DW_AT_name("GPIO26")
     756                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO26")
     757                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0a)
     758                      .dwattr $C$DW$70, DW_AT_bit_size(0x02)
     759                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     760                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     761              
     762              $C$DW$71        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     764                      .dwattr $C$DW$71, DW_AT_name("GPIO27")
     765                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO27")
     766                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
     767                      .dwattr $C$DW$71, DW_AT_bit_size(0x02)
     768                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     769                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     770              
     771              $C$DW$72        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$72, DW_AT_name("GPIO28")
     774                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO28")
     775                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06)
     776                      .dwattr $C$DW$72, DW_AT_bit_size(0x02)
     777                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     778                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$73        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$73, DW_AT_name("GPIO29")
     783                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO29")
     784                      .dwattr $C$DW$73, DW_AT_bit_offset(0x04)
     785                      .dwattr $C$DW$73, DW_AT_bit_size(0x02)
     786                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     787                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     788              
     789              $C$DW$74        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$74, DW_AT_name("GPIO30")
     792                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO30")
     793                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02)
     794                      .dwattr $C$DW$74, DW_AT_bit_size(0x02)
     795                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     796                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     797              
     798              $C$DW$75        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$75, DW_AT_name("GPIO31")
     801                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO31")
     802                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00)
     803                      .dwattr $C$DW$75, DW_AT_bit_size(0x02)
     804                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     805                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     806              
     807                      .dwendtag $C$DW$T$27
     808              
     809              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   16

     810              $C$DW$T$28      .dwtag  DW_TAG_union_type
     811                      .dwattr $C$DW$T$28, DW_AT_name("GPA2_REG")
     812                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     813              $C$DW$76        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     815                      .dwattr $C$DW$76, DW_AT_name("all")
     816                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     817                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     819              
     820              $C$DW$77        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$27)
     822                      .dwattr $C$DW$77, DW_AT_name("bit")
     823                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     824                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     826              
     827                      .dwendtag $C$DW$T$28
     828              
     829              
     830              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     831                      .dwattr $C$DW$T$29, DW_AT_name("GPACTRL2_BITS")
     832                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     833              $C$DW$78        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$78, DW_AT_name("USB0IOEN")
     836                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_USB0IOEN")
     837                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0f)
     838                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     839                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     841              
     842              $C$DW$79        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
     845                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
     846                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
     847                      .dwattr $C$DW$79, DW_AT_bit_size(0x0f)
     848                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     850              
     851                      .dwendtag $C$DW$T$29
     852              
     853              
     854              $C$DW$T$30      .dwtag  DW_TAG_union_type
     855                      .dwattr $C$DW$T$30, DW_AT_name("GPACTRL2_REG")
     856                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     857              $C$DW$80        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$80, DW_AT_name("all")
     860                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     861                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864              $C$DW$81        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   17

     865                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$29)
     866                      .dwattr $C$DW$81, DW_AT_name("bit")
     867                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     868                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     870              
     871                      .dwendtag $C$DW$T$30
     872              
     873              
     874              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     875                      .dwattr $C$DW$T$31, DW_AT_name("GPACTRL_BITS")
     876                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     877              $C$DW$82        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$82, DW_AT_name("QUALPRD0")
     880                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_QUALPRD0")
     881                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08)
     882                      .dwattr $C$DW$82, DW_AT_bit_size(0x08)
     883                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     884                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     885              
     886              $C$DW$83        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     888                      .dwattr $C$DW$83, DW_AT_name("QUALPRD1")
     889                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_QUALPRD1")
     890                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00)
     891                      .dwattr $C$DW$83, DW_AT_bit_size(0x08)
     892                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     894              
     895              $C$DW$84        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$84, DW_AT_name("QUALPRD2")
     898                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_QUALPRD2")
     899                      .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
     900                      .dwattr $C$DW$84, DW_AT_bit_size(0x08)
     901                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     902                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     903              
     904              $C$DW$85        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     906                      .dwattr $C$DW$85, DW_AT_name("QUALPRD3")
     907                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_QUALPRD3")
     908                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
     909                      .dwattr $C$DW$85, DW_AT_bit_size(0x08)
     910                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     911                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913                      .dwendtag $C$DW$T$31
     914              
     915              
     916              $C$DW$T$32      .dwtag  DW_TAG_union_type
     917                      .dwattr $C$DW$T$32, DW_AT_name("GPACTRL_REG")
     918                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     919              $C$DW$86        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   18

     920                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
     921                      .dwattr $C$DW$86, DW_AT_name("all")
     922                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
     923                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926              $C$DW$87        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$31)
     928                      .dwattr $C$DW$87, DW_AT_name("bit")
     929                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
     930                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     932              
     933                      .dwendtag $C$DW$T$32
     934              
     935              
     936              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     937                      .dwattr $C$DW$T$33, DW_AT_name("GPADAT_BITS")
     938                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
     939              $C$DW$88        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$88, DW_AT_name("GPIO0")
     942                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO0")
     943                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
     944                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
     945                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948              $C$DW$89        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$89, DW_AT_name("GPIO1")
     951                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO1")
     952                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
     953                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
     954                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$90        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$90, DW_AT_name("GPIO2")
     960                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO2")
     961                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
     962                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
     963                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     965              
     966              $C$DW$91        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$91, DW_AT_name("GPIO3")
     969                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO3")
     970                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
     971                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
     972                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     974              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   19

     975              $C$DW$92        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$92, DW_AT_name("GPIO4")
     978                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO4")
     979                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
     980                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
     981                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     983              
     984              $C$DW$93        .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     986                      .dwattr $C$DW$93, DW_AT_name("GPIO5")
     987                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO5")
     988                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
     989                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
     990                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     991                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     992              
     993              $C$DW$94        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     995                      .dwattr $C$DW$94, DW_AT_name("GPIO6")
     996                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO6")
     997                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
     998                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
     999                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$95        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$95, DW_AT_name("GPIO7")
    1005                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO7")
    1006                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1007                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1008                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1010              
    1011              $C$DW$96        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$96, DW_AT_name("GPIO8")
    1014                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO8")
    1015                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1016                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1017                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1019              
    1020              $C$DW$97        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1022                      .dwattr $C$DW$97, DW_AT_name("GPIO9")
    1023                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO9")
    1024                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1025                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1026                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1028              
    1029              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   20

    1030                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$98, DW_AT_name("GPIO10")
    1032                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO10")
    1033                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1034                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1035                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038              $C$DW$99        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$99, DW_AT_name("GPIO11")
    1041                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO11")
    1042                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1043                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1044                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$100       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$100, DW_AT_name("GPIO12")
    1050                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO12")
    1051                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1052                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1053                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1055              
    1056              $C$DW$101       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$101, DW_AT_name("GPIO13")
    1059                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO13")
    1060                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1061                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1064              
    1065              $C$DW$102       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$102, DW_AT_name("GPIO14")
    1068                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO14")
    1069                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1070                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1071                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1073              
    1074              $C$DW$103       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$103, DW_AT_name("GPIO15")
    1077                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO15")
    1078                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1079                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1080                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083              $C$DW$104       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   21

    1085                      .dwattr $C$DW$104, DW_AT_name("GPIO16")
    1086                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO16")
    1087                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0f)
    1088                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1090                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092              $C$DW$105       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$105, DW_AT_name("GPIO17")
    1095                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO17")
    1096                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
    1097                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1099                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$106       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$106, DW_AT_name("GPIO18")
    1104                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO18")
    1105                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0d)
    1106                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1108                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$107       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$107, DW_AT_name("GPIO19")
    1113                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO19")
    1114                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0c)
    1115                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1117                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$108       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$108, DW_AT_name("GPIO20")
    1122                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO20")
    1123                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0b)
    1124                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1126                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$109       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$109, DW_AT_name("GPIO21")
    1131                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO21")
    1132                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0a)
    1133                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1135                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$110       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$110, DW_AT_name("GPIO22")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   22

    1140                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO22")
    1141                      .dwattr $C$DW$110, DW_AT_bit_offset(0x09)
    1142                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1143                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1144                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146              $C$DW$111       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$111, DW_AT_name("GPIO23")
    1149                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO23")
    1150                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08)
    1151                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1153                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$112       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$112, DW_AT_name("GPIO24")
    1158                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO24")
    1159                      .dwattr $C$DW$112, DW_AT_bit_offset(0x07)
    1160                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1162                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$113       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$113, DW_AT_name("GPIO25")
    1167                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO25")
    1168                      .dwattr $C$DW$113, DW_AT_bit_offset(0x06)
    1169                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1171                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$114       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$114, DW_AT_name("GPIO26")
    1176                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO26")
    1177                      .dwattr $C$DW$114, DW_AT_bit_offset(0x05)
    1178                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1180                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$115       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$115, DW_AT_name("GPIO27")
    1185                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO27")
    1186                      .dwattr $C$DW$115, DW_AT_bit_offset(0x04)
    1187                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1189                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$116       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$116, DW_AT_name("GPIO28")
    1194                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO28")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   23

    1195                      .dwattr $C$DW$116, DW_AT_bit_offset(0x03)
    1196                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1198                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$117       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$117, DW_AT_name("GPIO29")
    1203                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO29")
    1204                      .dwattr $C$DW$117, DW_AT_bit_offset(0x02)
    1205                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1207                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209              $C$DW$118       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$118, DW_AT_name("GPIO30")
    1212                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO30")
    1213                      .dwattr $C$DW$118, DW_AT_bit_offset(0x01)
    1214                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1215                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1216                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$119       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$119, DW_AT_name("GPIO31")
    1221                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO31")
    1222                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1223                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1225                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227                      .dwendtag $C$DW$T$33
    1228              
    1229              
    1230              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1231                      .dwattr $C$DW$T$34, DW_AT_name("GPADAT_REG")
    1232                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1233              $C$DW$120       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    1235                      .dwattr $C$DW$120, DW_AT_name("all")
    1236                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1237                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1239              
    1240              $C$DW$121       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1242                      .dwattr $C$DW$121, DW_AT_name("bit")
    1243                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    1244                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247                      .dwendtag $C$DW$T$34
    1248              
    1249              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   24

    1250              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1251                      .dwattr $C$DW$T$35, DW_AT_name("GPB1_BITS")
    1252                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1253              $C$DW$122       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$122, DW_AT_name("GPIO32")
    1256                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO32")
    1257                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    1258                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    1259                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$123       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$123, DW_AT_name("GPIO33")
    1265                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO33")
    1266                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1267                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    1268                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$124       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$124, DW_AT_name("GPIO34")
    1274                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO34")
    1275                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a)
    1276                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1277                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$125       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$125, DW_AT_name("GPIO35")
    1283                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO35")
    1284                      .dwattr $C$DW$125, DW_AT_bit_offset(0x08)
    1285                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    1286                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$126       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$126, DW_AT_name("GPIO36")
    1292                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO36")
    1293                      .dwattr $C$DW$126, DW_AT_bit_offset(0x06)
    1294                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    1295                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$127       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$127, DW_AT_name("GPIO37")
    1301                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO37")
    1302                      .dwattr $C$DW$127, DW_AT_bit_offset(0x04)
    1303                      .dwattr $C$DW$127, DW_AT_bit_size(0x02)
    1304                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   25

    1305                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1306              
    1307              $C$DW$128       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1309                      .dwattr $C$DW$128, DW_AT_name("GPIO38")
    1310                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO38")
    1311                      .dwattr $C$DW$128, DW_AT_bit_offset(0x02)
    1312                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    1313                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1315              
    1316              $C$DW$129       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1318                      .dwattr $C$DW$129, DW_AT_name("GPIO39")
    1319                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO39")
    1320                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    1321                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1322                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1324              
    1325              $C$DW$130       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1327                      .dwattr $C$DW$130, DW_AT_name("GPIO40")
    1328                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO40")
    1329                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0e)
    1330                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1331                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1332                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1333              
    1334              $C$DW$131       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$131, DW_AT_name("GPIO41")
    1337                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO41")
    1338                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0c)
    1339                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1340                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1341                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343              $C$DW$132       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$132, DW_AT_name("GPIO42")
    1346                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO42")
    1347                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a)
    1348                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    1349                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1350                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1351              
    1352              $C$DW$133       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$133, DW_AT_name("GPIO43")
    1355                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO43")
    1356                      .dwattr $C$DW$133, DW_AT_bit_offset(0x08)
    1357                      .dwattr $C$DW$133, DW_AT_bit_size(0x02)
    1358                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1359                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   26

    1360              
    1361              $C$DW$134       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$134, DW_AT_name("GPIO44")
    1364                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO44")
    1365                      .dwattr $C$DW$134, DW_AT_bit_offset(0x06)
    1366                      .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    1367                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1368                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$135       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1373                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1374                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1375                      .dwattr $C$DW$135, DW_AT_bit_size(0x06)
    1376                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1377                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1378              
    1379                      .dwendtag $C$DW$T$35
    1380              
    1381              
    1382              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1383                      .dwattr $C$DW$T$36, DW_AT_name("GPB1_REG")
    1384                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1385              $C$DW$136       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1387                      .dwattr $C$DW$136, DW_AT_name("all")
    1388                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1389                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392              $C$DW$137       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$35)
    1394                      .dwattr $C$DW$137, DW_AT_name("bit")
    1395                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1396                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1398              
    1399                      .dwendtag $C$DW$T$36
    1400              
    1401              
    1402              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1403                      .dwattr $C$DW$T$37, DW_AT_name("GPB2_BITS")
    1404                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1405              $C$DW$138       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1407                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    1408                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    1409                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0c)
    1410                      .dwattr $C$DW$138, DW_AT_bit_size(0x04)
    1411                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1413              
    1414              $C$DW$139       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:20 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initGPIO.asm                                                         PAGE   27

    1415                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$139, DW_AT_name("GPIO50")
    1417                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO50")
    1418                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a)
    1419                      .dwattr $C$DW$139, DW_AT_bit_size(0x02)
    1420                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$140       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$140, DW_AT_name("GPIO51")
    1426                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO51")
    1427                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08)
    1428                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    1429                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$141       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$141, DW_AT_name("GPIO52")
