TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Sat Mar 11 21:51:20 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --diag_wrap=off --float_support=fpu32 --hll_source=on
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../initInterrupt.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Lawrence\Google Drive\workspace_v7\SeventhProject\Debug")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("InitPieVectTable")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_InitPieVectTable")

     164                      .dwattr $C$DW$8, DW_AT_name("cpu_timer1_isr")
     165                      .dwattr $C$DW$8, DW_AT_low_pc(_cpu_timer1_isr)
     166                      .dwattr $C$DW$8, DW_AT_high_pc(0x00)
     167                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_cpu_timer1_isr")
     168                      .dwattr $C$DW$8, DW_AT_external
     169                      .dwattr $C$DW$8, DW_AT_TI_begin_file("../initInterrupt.c")
     170                      .dwattr $C$DW$8, DW_AT_TI_begin_line(0x43)
     171                      .dwattr $C$DW$8, DW_AT_TI_begin_column(0x12)
     172                      .dwattr $C$DW$8, DW_AT_TI_interrupt
     173                      .dwattr $C$DW$8, DW_AT_TI_max_frame_size(-6)
     174                      .dwpsn  file "../initInterrupt.c",line 68,column 1,is_stmt,address _cpu_timer1_isr,isa 0
     175              
     176                      .dwfde $C$DW$CIE, _cpu_timer1_isr
     177              
     178              ;***************************************************************
     179              ;* FNAME: _cpu_timer1_isr               FR SIZE:   4           *
     180              ;*                                                             *
     181              ;* FUNCTION ENVIRONMENT                                        *
     182              ;*                                                             *
     183              ;* FUNCTION PROPERTIES                                         *
     184              ;*                            0 Parameter,  0 Auto,  4 SOE     *
     185              ;***************************************************************
     186              
     187 00000000       _cpu_timer1_isr:
     188                      .dwcfi  cfa_offset, -2
     189                      .dwcfi  save_reg_to_mem, 26, 0
     190 00000000 761B          ASP       ; [CPU_] 
     191 00000001 FFF0          PUSH      RB                    ; [CPU_] 
     192                      .dwcfi  save_reg_to_mem, 73, 2
     193                      .dwcfi  save_reg_to_mem, 74, 3
     194                      .dwcfi  cfa_offset, -4
     195 00000002 E200          MOV32     *SP++,STF             ; [CPU_] 
         00000003 00BD 
     196                      .dwcfi  save_reg_to_mem, 39, 4
     197                      .dwcfi  save_reg_to_mem, 40, 5
     198                      .dwcfi  cfa_offset, -6
     199 00000004 E630          SETFLG    RNDF32=1, RNDF64=1    ; [CPU_] 
         00000005 0600 
     200 00000006 2942          CLRC      PAGE0,OVM             ; [CPU_] 
     201 00000007 5616          CLRC      AMODE                 ; [CPU_] 
     202 00000008 7622   EALLOW
     203                      .dwpsn  file "../initInterrupt.c",line 70,column 4,is_stmt,isa 0
     204 00000009 0284          MOVB      ACC,#132              ; [CPU_] |70| 
     205 0000000a 761F!         MOVW      DP,#_GpioDataRegs+14  ; [CPU_U] 
         0000000b 0000 
     206 0000000c 1E0E!         MOVL      @_GpioDataRegs+14,ACC ; [CPU_] |70| 
     207 0000000d 761A   EDIS
     208 0000000e E280          MOV32     STF,*--SP             ; [CPU_] 
         0000000f 00BE 
     209                      .dwcfi  cfa_offset, -4
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    5

     210                      .dwcfi  restore_reg, 39
     211                      .dwcfi  restore_reg, 40
     212 00000010 3B30          SETC      INTM, DBGM            ; [CPU_] 
     213 00000011 FFF1          POP       RB                    ; [CPU_] 
     214                      .dwcfi  cfa_offset, -2
     215                      .dwcfi  restore_reg, 73
     216                      .dwcfi  restore_reg, 74
     217 00000012 7617          NASP      ; [CPU_] 
     218              $C$DW$9 .dwtag  DW_TAG_TI_branch
     219                      .dwattr $C$DW$9, DW_AT_low_pc(0x00)
     220                      .dwattr $C$DW$9, DW_AT_TI_return
     221              
     222 00000013 7602          IRET      ; [CPU_] 
     223                      ; return occurs ; [] 
     224                      .dwattr $C$DW$8, DW_AT_TI_end_file("../initInterrupt.c")
     225                      .dwattr $C$DW$8, DW_AT_TI_end_line(0x49)
     226                      .dwattr $C$DW$8, DW_AT_TI_end_column(0x01)
     227                      .dwendentry
     228                      .dwendtag $C$DW$8
     229              
     230              ;**************************************************************
     231              ;* UNDEFINED EXTERNAL REFERENCES                              *
     232              ;**************************************************************
     233                      .global _InitPieVectTable
     234                      .global _PieCtrlRegs
     235                      .global _GpioDataRegs
     236                      .global _PieVectTable
     237              
     238              ;***************************************************************
     239              ;* TYPE INFORMATION                                            *
     240              ;***************************************************************
     241              
     242              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     243                      .dwattr $C$DW$T$20, DW_AT_name("AIODAT_BITS")
     244                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     245              $C$DW$10        .dwtag  DW_TAG_member
     246                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     247                      .dwattr $C$DW$10, DW_AT_name("rsvd1")
     248                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_rsvd1")
     249                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0f)
     250                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     251                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     252                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     253              
     254              $C$DW$11        .dwtag  DW_TAG_member
     255                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     256                      .dwattr $C$DW$11, DW_AT_name("rsvd2")
     257                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_rsvd2")
     258                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0e)
     259                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     260                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     261                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     262              
     263              $C$DW$12        .dwtag  DW_TAG_member
     264                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    6

     265                      .dwattr $C$DW$12, DW_AT_name("AIO2")
     266                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_AIO2")
     267                      .dwattr $C$DW$12, DW_AT_bit_offset(0x0d)
     268                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     269                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     270                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     271              
     272              $C$DW$13        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     274                      .dwattr $C$DW$13, DW_AT_name("rsvd3")
     275                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_rsvd3")
     276                      .dwattr $C$DW$13, DW_AT_bit_offset(0x0c)
     277                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     278                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     279                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     280              
     281              $C$DW$14        .dwtag  DW_TAG_member
     282                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     283                      .dwattr $C$DW$14, DW_AT_name("AIO4")
     284                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_AIO4")
     285                      .dwattr $C$DW$14, DW_AT_bit_offset(0x0b)
     286                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     287                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     288                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     289              
     290              $C$DW$15        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     292                      .dwattr $C$DW$15, DW_AT_name("rsvd4")
     293                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd4")
     294                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0a)
     295                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     296                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     298              
     299              $C$DW$16        .dwtag  DW_TAG_member
     300                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     301                      .dwattr $C$DW$16, DW_AT_name("AIO6")
     302                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_AIO6")
     303                      .dwattr $C$DW$16, DW_AT_bit_offset(0x09)
     304                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     305                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     306                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     307              
     308              $C$DW$17        .dwtag  DW_TAG_member
     309                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     310                      .dwattr $C$DW$17, DW_AT_name("rsvd5")
     311                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd5")
     312                      .dwattr $C$DW$17, DW_AT_bit_offset(0x08)
     313                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     314                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     315                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     316              
     317              $C$DW$18        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$18, DW_AT_name("rsvd6")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    7

     320                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd6")
     321                      .dwattr $C$DW$18, DW_AT_bit_offset(0x07)
     322                      .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     323                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     324                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     325              
     326              $C$DW$19        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     328                      .dwattr $C$DW$19, DW_AT_name("rsvd7")
     329                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd7")
     330                      .dwattr $C$DW$19, DW_AT_bit_offset(0x06)
     331                      .dwattr $C$DW$19, DW_AT_bit_size(0x01)
     332                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     334              
     335              $C$DW$20        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$20, DW_AT_name("AIO10")
     338                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_AIO10")
     339                      .dwattr $C$DW$20, DW_AT_bit_offset(0x05)
     340                      .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     341                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     342                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     343              
     344              $C$DW$21        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$21, DW_AT_name("rsvd8")
     347                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd8")
     348                      .dwattr $C$DW$21, DW_AT_bit_offset(0x04)
     349                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     350                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     351                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     352              
     353              $C$DW$22        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     355                      .dwattr $C$DW$22, DW_AT_name("AIO12")
     356                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_AIO12")
     357                      .dwattr $C$DW$22, DW_AT_bit_offset(0x03)
     358                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     359                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362              $C$DW$23        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$23, DW_AT_name("rsvd9")
     365                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_rsvd9")
     366                      .dwattr $C$DW$23, DW_AT_bit_offset(0x02)
     367                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     368                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     370              
     371              $C$DW$24        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     373                      .dwattr $C$DW$24, DW_AT_name("AIO14")
     374                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_AIO14")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    8

     375                      .dwattr $C$DW$24, DW_AT_bit_offset(0x01)
     376                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     377                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     378                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     379              
     380              $C$DW$25        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     382                      .dwattr $C$DW$25, DW_AT_name("rsvd10")
     383                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd10")
     384                      .dwattr $C$DW$25, DW_AT_bit_offset(0x00)
     385                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     386                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     387                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389              $C$DW$26        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     391                      .dwattr $C$DW$26, DW_AT_name("rsvd11")
     392                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd11")
     393                      .dwattr $C$DW$26, DW_AT_bit_offset(0x00)
     394                      .dwattr $C$DW$26, DW_AT_bit_size(0x10)
     395                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     396                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     397              
     398                      .dwendtag $C$DW$T$20
     399              
     400              
     401              $C$DW$T$22      .dwtag  DW_TAG_union_type
     402                      .dwattr $C$DW$T$22, DW_AT_name("AIODAT_REG")
     403                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     404              $C$DW$27        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     406                      .dwattr $C$DW$27, DW_AT_name("all")
     407                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_all")
     408                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     409                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     410              
     411              $C$DW$28        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     413                      .dwattr $C$DW$28, DW_AT_name("bit")
     414                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_bit")
     415                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     416                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     417              
     418                      .dwendtag $C$DW$T$22
     419              
     420              
     421              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     422                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_BITS")
     423                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     424              $C$DW$29        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     426                      .dwattr $C$DW$29, DW_AT_name("GPIO0")
     427                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO0")
     428                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0f)
     429                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE    9

     430                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     432              
     433              $C$DW$30        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$30, DW_AT_name("GPIO1")
     436                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO1")
     437                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0e)
     438                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     439                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     440                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     441              
     442              $C$DW$31        .dwtag  DW_TAG_member
     443                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     444                      .dwattr $C$DW$31, DW_AT_name("GPIO2")
     445                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO2")
     446                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0d)
     447                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     448                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     449                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     450              
     451              $C$DW$32        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     453                      .dwattr $C$DW$32, DW_AT_name("GPIO3")
     454                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO3")
     455                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0c)
     456                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     457                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     458                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     459              
     460              $C$DW$33        .dwtag  DW_TAG_member
     461                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     462                      .dwattr $C$DW$33, DW_AT_name("GPIO4")
     463                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO4")
     464                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0b)
     465                      .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     466                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     467                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     468              
     469              $C$DW$34        .dwtag  DW_TAG_member
     470                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     471                      .dwattr $C$DW$34, DW_AT_name("GPIO5")
     472                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO5")
     473                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0a)
     474                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     475                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     477              
     478              $C$DW$35        .dwtag  DW_TAG_member
     479                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     480                      .dwattr $C$DW$35, DW_AT_name("GPIO6")
     481                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO6")
     482                      .dwattr $C$DW$35, DW_AT_bit_offset(0x09)
     483                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     484                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   10

     485                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     486              
     487              $C$DW$36        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$36, DW_AT_name("GPIO7")
     490                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO7")
     491                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08)
     492                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     493                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     495              
     496              $C$DW$37        .dwtag  DW_TAG_member
     497                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     498                      .dwattr $C$DW$37, DW_AT_name("GPIO8")
     499                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO8")
     500                      .dwattr $C$DW$37, DW_AT_bit_offset(0x07)
     501                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     502                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     504              
     505              $C$DW$38        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     507                      .dwattr $C$DW$38, DW_AT_name("GPIO9")
     508                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO9")
     509                      .dwattr $C$DW$38, DW_AT_bit_offset(0x06)
     510                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     511                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     513              
     514              $C$DW$39        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     516                      .dwattr $C$DW$39, DW_AT_name("GPIO10")
     517                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO10")
     518                      .dwattr $C$DW$39, DW_AT_bit_offset(0x05)
     519                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     520                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$40        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$40, DW_AT_name("GPIO11")
     526                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO11")
     527                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04)
     528                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     529                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     531              
     532              $C$DW$41        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$41, DW_AT_name("GPIO12")
     535                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO12")
     536                      .dwattr $C$DW$41, DW_AT_bit_offset(0x03)
     537                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     538                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   11

     540              
     541              $C$DW$42        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$42, DW_AT_name("GPIO13")
     544                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO13")
     545                      .dwattr $C$DW$42, DW_AT_bit_offset(0x02)
     546                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     547                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     548                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     549              
     550              $C$DW$43        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     552                      .dwattr $C$DW$43, DW_AT_name("GPIO14")
     553                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO14")
     554                      .dwattr $C$DW$43, DW_AT_bit_offset(0x01)
     555                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     556                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     558              
     559              $C$DW$44        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     561                      .dwattr $C$DW$44, DW_AT_name("GPIO15")
     562                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO15")
     563                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     564                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     565                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568              $C$DW$45        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$45, DW_AT_name("GPIO16")
     571                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO16")
     572                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0f)
     573                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     574                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     575                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     576              
     577              $C$DW$46        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$46, DW_AT_name("GPIO17")
     580                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO17")
     581                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0e)
     582                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     583                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     584                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     585              
     586              $C$DW$47        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$47, DW_AT_name("GPIO18")
     589                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO18")
     590                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0d)
     591                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     592                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     593                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     594              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   12

     595              $C$DW$48        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$48, DW_AT_name("GPIO19")
     598                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO19")
     599                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c)
     600                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     602                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     603              
     604              $C$DW$49        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     606                      .dwattr $C$DW$49, DW_AT_name("GPIO20")
     607                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO20")
     608                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0b)
     609                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     611                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$50        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$50, DW_AT_name("GPIO21")
     616                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO21")
     617                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a)
     618                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     619                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     620                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     621              
     622              $C$DW$51        .dwtag  DW_TAG_member
     623                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     624                      .dwattr $C$DW$51, DW_AT_name("GPIO22")
     625                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO22")
     626                      .dwattr $C$DW$51, DW_AT_bit_offset(0x09)
     627                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     628                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     629                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     630              
     631              $C$DW$52        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$52, DW_AT_name("GPIO23")
     634                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO23")
     635                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     636                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     637                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     638                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640              $C$DW$53        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$53, DW_AT_name("GPIO24")
     643                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO24")
     644                      .dwattr $C$DW$53, DW_AT_bit_offset(0x07)
     645                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     646                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     647                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     648              
     649              $C$DW$54        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   13

     650                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     651                      .dwattr $C$DW$54, DW_AT_name("GPIO25")
     652                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO25")
     653                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06)
     654                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     655                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     656                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     657              
     658              $C$DW$55        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     660                      .dwattr $C$DW$55, DW_AT_name("GPIO26")
     661                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO26")
     662                      .dwattr $C$DW$55, DW_AT_bit_offset(0x05)
     663                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     664                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     665                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     666              
     667              $C$DW$56        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$56, DW_AT_name("GPIO27")
     670                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO27")
     671                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
     672                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     673                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     674                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$57        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$57, DW_AT_name("GPIO28")
     679                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO28")
     680                      .dwattr $C$DW$57, DW_AT_bit_offset(0x03)
     681                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     683                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685              $C$DW$58        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$58, DW_AT_name("GPIO29")
     688                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO29")
     689                      .dwattr $C$DW$58, DW_AT_bit_offset(0x02)
     690                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     691                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     692                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$59        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$59, DW_AT_name("GPIO30")
     697                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO30")
     698                      .dwattr $C$DW$59, DW_AT_bit_offset(0x01)
     699                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     700                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     701                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     702              
     703              $C$DW$60        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   14

     705                      .dwattr $C$DW$60, DW_AT_name("GPIO31")
     706                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO31")
     707                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00)
     708                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     709                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     710                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     711              
     712                      .dwendtag $C$DW$T$23
     713              
     714              
     715              $C$DW$T$24      .dwtag  DW_TAG_union_type
     716                      .dwattr $C$DW$T$24, DW_AT_name("GPADAT_REG")
     717                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     718              $C$DW$61        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     720                      .dwattr $C$DW$61, DW_AT_name("all")
     721                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     722                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     724              
     725              $C$DW$62        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
     727                      .dwattr $C$DW$62, DW_AT_name("bit")
     728                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     729                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     731              
     732                      .dwendtag $C$DW$T$24
     733              
     734              
     735              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     736                      .dwattr $C$DW$T$25, DW_AT_name("GPBDAT_BITS")
     737                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     738              $C$DW$63        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$63, DW_AT_name("GPIO32")
     741                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO32")
     742                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0f)
     743                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     744                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     746              
     747              $C$DW$64        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$64, DW_AT_name("GPIO33")
     750                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO33")
     751                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0e)
     752                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     753                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     755              
     756              $C$DW$65        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$65, DW_AT_name("GPIO34")
     759                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO34")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   15

     760                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0d)
     761                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     762                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765              $C$DW$66        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$66, DW_AT_name("GPIO35")
     768                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO35")
     769                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0c)
     770                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     771                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     773              
     774              $C$DW$67        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$67, DW_AT_name("GPIO36")
     777                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO36")
     778                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0b)
     779                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     780                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     782              
     783              $C$DW$68        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$68, DW_AT_name("GPIO37")
     786                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO37")
     787                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a)
     788                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     789                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     791              
     792              $C$DW$69        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$69, DW_AT_name("GPIO38")
     795                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO38")
     796                      .dwattr $C$DW$69, DW_AT_bit_offset(0x09)
     797                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     798                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     800              
     801              $C$DW$70        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$70, DW_AT_name("GPIO39")
     804                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO39")
     805                      .dwattr $C$DW$70, DW_AT_bit_offset(0x08)
     806                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     807                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     809              
     810              $C$DW$71        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$71, DW_AT_name("GPIO40")
     813                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO40")
     814                      .dwattr $C$DW$71, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   16

     815                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     816                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819              $C$DW$72        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$72, DW_AT_name("GPIO41")
     822                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO41")
     823                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06)
     824                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     825                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     826                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     827              
     828              $C$DW$73        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$73, DW_AT_name("GPIO42")
     831                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO42")
     832                      .dwattr $C$DW$73, DW_AT_bit_offset(0x05)
     833                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     834                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     836              
     837              $C$DW$74        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$74, DW_AT_name("GPIO43")
     840                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO43")
     841                      .dwattr $C$DW$74, DW_AT_bit_offset(0x04)
     842                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$75        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$75, DW_AT_name("GPIO44")
     849                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO44")
     850                      .dwattr $C$DW$75, DW_AT_bit_offset(0x03)
     851                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     854              
     855              $C$DW$76        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$76, DW_AT_name("rsvd1")
     858                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd1")
     859                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
     860                      .dwattr $C$DW$76, DW_AT_bit_size(0x03)
     861                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864              $C$DW$77        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
     867                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
     868                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0e)
     869                      .dwattr $C$DW$77, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   17

     870                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     871                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     872              
     873              $C$DW$78        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$78, DW_AT_name("GPIO50")
     876                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO50")
     877                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0d)
     878                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
     879                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     880                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     881              
     882              $C$DW$79        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$79, DW_AT_name("GPIO51")
     885                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO51")
     886                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0c)
     887                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
     888                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     889                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891              $C$DW$80        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$80, DW_AT_name("GPIO52")
     894                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO52")
     895                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0b)
     896                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
     897                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     898                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     899              
     900              $C$DW$81        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$81, DW_AT_name("GPIO53")
     903                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO53")
     904                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0a)
     905                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
     906                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     907                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$82        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$82, DW_AT_name("GPIO54")
     912                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO54")
     913                      .dwattr $C$DW$82, DW_AT_bit_offset(0x09)
     914                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
     915                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     916                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     917              
     918              $C$DW$83        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     920                      .dwattr $C$DW$83, DW_AT_name("GPIO55")
     921                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO55")
     922                      .dwattr $C$DW$83, DW_AT_bit_offset(0x08)
     923                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
     924                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   18

     925                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$84        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$84, DW_AT_name("GPIO56")
     930                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO56")
     931                      .dwattr $C$DW$84, DW_AT_bit_offset(0x07)
     932                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     934                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     935              
     936              $C$DW$85        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$85, DW_AT_name("GPIO57")
     939                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO57")
     940                      .dwattr $C$DW$85, DW_AT_bit_offset(0x06)
     941                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
     942                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     943                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     944              
     945              $C$DW$86        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$86, DW_AT_name("GPIO58")
     948                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO58")
     949                      .dwattr $C$DW$86, DW_AT_bit_offset(0x05)
     950                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
     951                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     952                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954              $C$DW$87        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$87, DW_AT_name("rsvd3")
     957                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd3")
     958                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
     959                      .dwattr $C$DW$87, DW_AT_bit_size(0x05)
     960                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     961                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963                      .dwendtag $C$DW$T$25
     964              
     965              
     966              $C$DW$T$26      .dwtag  DW_TAG_union_type
     967                      .dwattr $C$DW$T$26, DW_AT_name("GPBDAT_REG")
     968                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     969              $C$DW$88        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
     971                      .dwattr $C$DW$88, DW_AT_name("all")
     972                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
     973                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$89        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
     978                      .dwattr $C$DW$89, DW_AT_name("bit")
     979                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   19

     980                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983                      .dwendtag $C$DW$T$26
     984              
     985              
     986              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     987                      .dwattr $C$DW$T$28, DW_AT_name("GPIO_DATA_REGS")
     988                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
     989              $C$DW$90        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$24)
     991                      .dwattr $C$DW$90, DW_AT_name("GPADAT")
     992                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPADAT")
     993                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     995              
     996              $C$DW$91        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$24)
     998                      .dwattr $C$DW$91, DW_AT_name("GPASET")
     999                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPASET")
    1000                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1001                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003              $C$DW$92        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
    1005                      .dwattr $C$DW$92, DW_AT_name("GPACLEAR")
    1006                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPACLEAR")
    1007                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1008                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$93        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$24)
    1012                      .dwattr $C$DW$93, DW_AT_name("GPATOGGLE")
    1013                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPATOGGLE")
    1014                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1015                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$94        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$26)
    1019                      .dwattr $C$DW$94, DW_AT_name("GPBDAT")
    1020                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPBDAT")
    1021                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1022                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1023              
    1024              $C$DW$95        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$26)
    1026                      .dwattr $C$DW$95, DW_AT_name("GPBSET")
    1027                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPBSET")
    1028                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1029                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$96        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
    1033                      .dwattr $C$DW$96, DW_AT_name("GPBCLEAR")
    1034                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPBCLEAR")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   20

    1035                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1036                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038              $C$DW$97        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
    1040                      .dwattr $C$DW$97, DW_AT_name("GPBTOGGLE")
    1041                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1042                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1043                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045              $C$DW$98        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$27)
    1047                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
    1048                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
    1049                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1050                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1051              
    1052              $C$DW$99        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$22)
    1054                      .dwattr $C$DW$99, DW_AT_name("AIODAT")
    1055                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_AIODAT")
    1056                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1057                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059              $C$DW$100       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
    1061                      .dwattr $C$DW$100, DW_AT_name("AIOSET")
    1062                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_AIOSET")
    1063                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1064                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$101       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1068                      .dwattr $C$DW$101, DW_AT_name("AIOCLEAR")
    1069                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_AIOCLEAR")
    1070                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1071                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$102       .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    1075                      .dwattr $C$DW$102, DW_AT_name("AIOTOGGLE")
    1076                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1077                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1078                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080                      .dwendtag $C$DW$T$28
    1081              
    1082              $C$DW$103       .dwtag  DW_TAG_TI_far_type
    1083                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1084              
    1085              $C$DW$T$43      .dwtag  DW_TAG_volatile_type
    1086                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$103)
    1087              
    1088              
    1089              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   21

    1090                      .dwattr $C$DW$T$29, DW_AT_name("PIEACK_BITS")
    1091                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1092              $C$DW$104       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$104, DW_AT_name("ACK1")
    1095                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ACK1")
    1096                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0f)
    1097                      .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$105       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$105, DW_AT_name("ACK2")
    1104                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ACK2")
    1105                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
    1106                      .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1109              
    1110              $C$DW$106       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$106, DW_AT_name("ACK3")
    1113                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ACK3")
    1114                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0d)
    1115                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1118              
    1119              $C$DW$107       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$107, DW_AT_name("ACK4")
    1122                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ACK4")
    1123                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0c)
    1124                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$108       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$108, DW_AT_name("ACK5")
    1131                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ACK5")
    1132                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0b)
    1133                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$109       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$109, DW_AT_name("ACK6")
    1140                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ACK6")
    1141                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0a)
    1142                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1143                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   22

    1145              
    1146              $C$DW$110       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$110, DW_AT_name("ACK7")
    1149                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ACK7")
    1150                      .dwattr $C$DW$110, DW_AT_bit_offset(0x09)
    1151                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$111       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$111, DW_AT_name("ACK8")
    1158                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ACK8")
    1159                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08)
    1160                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$112       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$112, DW_AT_name("ACK9")
    1167                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_ACK9")
    1168                      .dwattr $C$DW$112, DW_AT_bit_offset(0x07)
    1169                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$113       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$113, DW_AT_name("ACK10")
    1176                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_ACK10")
    1177                      .dwattr $C$DW$113, DW_AT_bit_offset(0x06)
    1178                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$114       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$114, DW_AT_name("ACK11")
    1185                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_ACK11")
    1186                      .dwattr $C$DW$114, DW_AT_bit_offset(0x05)
    1187                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$115       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$115, DW_AT_name("ACK12")
    1194                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ACK12")
    1195                      .dwattr $C$DW$115, DW_AT_bit_offset(0x04)
    1196                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1199              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   23

    1200              $C$DW$116       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1203                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1204                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1205                      .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    1206                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209                      .dwendtag $C$DW$T$29
    1210              
    1211              
    1212              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1213                      .dwattr $C$DW$T$30, DW_AT_name("PIEACK_REG")
    1214                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1215              $C$DW$117       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$117, DW_AT_name("all")
    1218                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1219                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1221              
    1222              $C$DW$118       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    1224                      .dwattr $C$DW$118, DW_AT_name("bit")
    1225                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1226                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229                      .dwendtag $C$DW$T$30
    1230              
    1231              
    1232              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1233                      .dwattr $C$DW$T$31, DW_AT_name("PIECTRL_BITS")
    1234                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1235              $C$DW$119       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$119, DW_AT_name("ENPIE")
    1238                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ENPIE")
    1239                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f)
    1240                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$120       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$120, DW_AT_name("PIEVECT")
    1247                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PIEVECT")
    1248                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1249                      .dwattr $C$DW$120, DW_AT_bit_size(0x0f)
    1250                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253                      .dwendtag $C$DW$T$31
    1254              
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   24

    1255              
    1256              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1257                      .dwattr $C$DW$T$32, DW_AT_name("PIECTRL_REG")
    1258                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1259              $C$DW$121       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$121, DW_AT_name("all")
    1262                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1263                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$122       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$31)
    1268                      .dwattr $C$DW$122, DW_AT_name("bit")
    1269                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1270                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273                      .dwendtag $C$DW$T$32
    1274              
    1275              
    1276              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1277                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER_BITS")
    1278                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1279              $C$DW$123       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$123, DW_AT_name("INTx1")
    1282                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx1")
    1283                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f)
    1284                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$124       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$124, DW_AT_name("INTx2")
    1291                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx2")
    1292                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1293                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$125       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$125, DW_AT_name("INTx3")
    1300                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTx3")
    1301                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1302                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1303                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$126       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$126, DW_AT_name("INTx4")
    1309                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_INTx4")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   25

    1310                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c)
    1311                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1312                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315              $C$DW$127       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$127, DW_AT_name("INTx5")
    1318                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INTx5")
    1319                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b)
    1320                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1321                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$128       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$128, DW_AT_name("INTx6")
    1327                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTx6")
    1328                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    1329                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1330                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333              $C$DW$129       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$129, DW_AT_name("INTx7")
    1336                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTx7")
    1337                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09)
    1338                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$130       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$130, DW_AT_name("INTx8")
    1345                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTx8")
    1346                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08)
    1347                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1348                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351              $C$DW$131       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    1354                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    1355                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1356                      .dwattr $C$DW$131, DW_AT_bit_size(0x08)
    1357                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360                      .dwendtag $C$DW$T$33
    1361              
    1362              
    1363              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1364                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER_REG")
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   26

    1365                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1366              $C$DW$132       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$132, DW_AT_name("all")
    1369                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    1370                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1372              
    1373              $C$DW$133       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
    1375                      .dwattr $C$DW$133, DW_AT_name("bit")
    1376                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    1377                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380                      .dwendtag $C$DW$T$34
    1381              
    1382              
    1383              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1384                      .dwattr $C$DW$T$35, DW_AT_name("PIEIFR_BITS")
    1385                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1386              $C$DW$134       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$134, DW_AT_name("INTx1")
    1389                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INTx1")
    1390                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0f)
    1391                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1392                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$135       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$135, DW_AT_name("INTx2")
    1398                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INTx2")
    1399                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e)
    1400                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$136       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$136, DW_AT_name("INTx3")
    1407                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_INTx3")
    1408                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0d)
    1409                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$137       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$137, DW_AT_name("INTx4")
    1416                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_INTx4")
    1417                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0c)
    1418                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1419                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   27

    1420                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$138       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$138, DW_AT_name("INTx5")
    1425                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_INTx5")
    1426                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0b)
    1427                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$139       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$139, DW_AT_name("INTx6")
    1434                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_INTx6")
    1435                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a)
    1436                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$140       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$140, DW_AT_name("INTx7")
    1443                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_INTx7")
    1444                      .dwattr $C$DW$140, DW_AT_bit_offset(0x09)
    1445                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1446                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449              $C$DW$141       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$141, DW_AT_name("INTx8")
    1452                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_INTx8")
    1453                      .dwattr $C$DW$141, DW_AT_bit_offset(0x08)
    1454                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1455                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458              $C$DW$142       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1461                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1462                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    1463                      .dwattr $C$DW$142, DW_AT_bit_size(0x08)
    1464                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467                      .dwendtag $C$DW$T$35
    1468              
    1469              
    1470              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1471                      .dwattr $C$DW$T$36, DW_AT_name("PIEIFR_REG")
    1472                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1473              $C$DW$143       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   28

    1475                      .dwattr $C$DW$143, DW_AT_name("all")
    1476                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    1477                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1479              
    1480              $C$DW$144       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$35)
    1482                      .dwattr $C$DW$144, DW_AT_name("bit")
    1483                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    1484                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1486              
    1487                      .dwendtag $C$DW$T$36
    1488              
    1489              
    1490              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1491                      .dwattr $C$DW$T$37, DW_AT_name("PIE_CTRL_REGS")
    1492                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x1a)
    1493              $C$DW$145       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    1495                      .dwattr $C$DW$145, DW_AT_name("PIECTRL")
    1496                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIECTRL")
    1497                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1499              
    1500              $C$DW$146       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$30)
    1502                      .dwattr $C$DW$146, DW_AT_name("PIEACK")
    1503                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIEACK")
    1504                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1505                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1506              
    1507              $C$DW$147       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$34)
    1509                      .dwattr $C$DW$147, DW_AT_name("PIEIER1")
    1510                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIEIER1")
    1511                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1512                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1513              
    1514              $C$DW$148       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$36)
    1516                      .dwattr $C$DW$148, DW_AT_name("PIEIFR1")
    1517                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PIEIFR1")
    1518                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1519                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1520              
    1521              $C$DW$149       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$34)
    1523                      .dwattr $C$DW$149, DW_AT_name("PIEIER2")
    1524                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PIEIER2")
    1525                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1526                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1527              
    1528              $C$DW$150       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v16.9.1 Sat Mar 11 21:51:21 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
initInterrupt.asm                                                    PAGE   29

    1530                      .dwattr $C$DW$150, DW_AT_name("PIEIFR2")
